[
{
  "article_id": "article_1",
  "article_number": "1",
  "text": "Điều 1. Phạm vi điều chỉnh\nLuật này quy định về phòng, chống ma túy; quản lý người sử dụng trái phép chất ma túy; cai nghiện ma túy; trách nhiệm của cá nhân, gia đình, cơ quan, tổ chức trong phòng, chống ma túy; quản lý nhà nước và hợp tác quốc tế về phòng, chống ma túy.",
  "concepts": [
    {
      "name": "Phòng, chống ma túy",
      "meaning": "Các hoạt động nhằm ngăn chặn, hạn chế và loại bỏ tệ nạn ma túy trong xã hội.",
      "attrs": [],
      "keyphrases": [
        "phòng, chống ma túy"
      ],
      "similar": []
    },
    {
      "name": "Quản lý người sử dụng trái phép chất ma túy",
      "meaning": "Các biện pháp hành chính và xã hội nhằm kiểm soát, giáo dục và giúp đỡ người sử dụng trái phép chất ma túy.",
      "attrs": [],
      "keyphrases": [
        "quản lý người sử dụng trái phép chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Cai nghiện ma túy",
      "meaning": "Quá trình điều trị, phục hồi sức khỏe và tâm lý cho người nghiện ma túy.",
      "attrs": [],
      "keyphrases": [
        "cai nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Trách nhiệm phòng, chống ma túy",
      "meaning": "Nghĩa vụ và vai trò của các chủ thể khác nhau trong việc tham gia vào công tác phòng, chống ma túy.",
      "attrs": [
        "cá nhân",
        "gia đình",
        "cơ quan",
        "tổ chức"
      ],
      "keyphrases": [
        "trách nhiệm của cá nhân, gia đình, cơ quan, tổ chức trong phòng, chống ma túy"
      ],
      "similar": []
    },
    {
      "name": "Quản lý nhà nước về phòng, chống ma túy",
      "meaning": "Hoạt động quản lý, điều hành của Nhà nước trong lĩnh vực phòng, chống ma túy.",
      "attrs": [],
      "keyphrases": [
        "quản lý nhà nước về phòng, chống ma túy"
      ],
      "similar": []
    },
    {
      "name": "Hợp tác quốc tế về phòng, chống ma túy",
      "meaning": "Sự phối hợp và hợp tác giữa Việt Nam và các quốc gia, tổ chức quốc tế trong công tác phòng, chống ma túy.",
      "attrs": [],
      "keyphrases": [
        "hợp tác quốc tế về phòng, chống ma túy"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_2",
  "article_number": "2",
  "text": "Điều 2. Giải thích từ ngữ\nTrong Luật này, các từ ngữ dưới đây được hiểu như sau:\n1. Chất ma túy là chất gây nghiện, chất hướng thần được quy định trong danh mục chất ma túy do Chính phủ ban hành.\n2. Chất gây nghiện là chất kích thích hoặc ức chế thần kinh, dễ gây tình trạng nghiện đối với người sử dụng.\n3. Chất hướng thần là chất kích thích hoặc ức chế thần kinh hoặc gây ảo giác, nếu sử dụng nhiều lần có thể dẫn tới tình trạng nghiện đối với người sử dụng.\n4. Tiền chất là hóa chất không thể thiếu được trong quá trình điều chế, sản xuất chất ma túy được quy định trong danh mục tiền chất do Chính phủ ban hành.\n5. Thuốc thú y có chứa chất ma túy, tiền chất là thuốc thú y có chứa các chất được quy định tại các khoản 2, 3 và 4 của Điều này.\n6. Cây có chứa chất ma túy là cây thuốc phiện, cây côca, cây cần sa và các loại cây khác có chứa chất ma túy do Chính phủ quy định.\n7. Phòng, chống ma túy là phòng ngừa, ngăn chặn, đấu tranh chống tội phạm và tệ nạn ma túy; kiểm soát các hoạt động hợp pháp liên quan đến ma túy.\n8. Tệ nạn ma túy là việc sử dụng trái phép chất ma túy, nghiện ma túy và các hành vi vi phạm pháp luật về ma túy mà chưa đến mức hoặc không bị truy cứu trách nhiệm hình sự.\n9. Kiểm soát các hoạt động hợp pháp liên quan đến ma túy là việc cho phép, theo dõi, kiểm tra, giám sát các hoạt động hợp pháp liên quan đến ma túy và phòng ngừa, ngăn chặn việc lợi dụng các hoạt động đó vào mục đích khác.\n10. Người sử dụng trái phép chất ma túy là người có hành vi sử dụng chất ma túy mà không được sự cho phép của người hoặc cơ quan chuyên môn có thẩm quyền và xét nghiệm chất ma túy trong cơ thể có kết quả dương tính.\n11. Xét nghiệm chất ma túy trong cơ thể là việc thực hiện các kỹ thuật chuyên môn nhằm xác định chất ma túy trong cơ thể thông qua mẫu nước tiểu, mẫu máu hoặc các mẫu vật khác của cơ thể người.\n12. Người nghiện ma túy là người sử dụng chất ma túy, thuốc gây nghiện, thuốc hướng thần và bị lệ thuộc vào các chất này.\n13. Cai nghiện ma túy là quá trình thực hiện các hoạt động hỗ trợ về y tế, tâm lý, xã hội, giúp người nghiện ma túy dừng sử dụng chất ma túy, thuốc gây nghiện, thuốc hướng thần, phục hồi thể chất, tinh thần, nâng cao nhận thức, thay đổi hành vi để chấm dứt việc sử dụng trái phép các chất này.\n14. Cơ sở cai nghiện ma túy là cơ sở được thành lập để thực hiện đầy đủ quy trình cai nghiện theo quy định của Luật này, bao gồm cơ sở cai nghiện ma túy công lập và cơ sở cai nghiện ma túy tự nguyện.",
  "concepts": [
    {
      "name": "Chất ma túy",
      "meaning": "Chất gây nghiện, chất hướng thần được quy định trong danh mục do Chính phủ ban hành.",
      "attrs": [
        "gây nghiện",
        "hướng thần",
        "được quy định trong danh mục của Chính phủ"
      ],
      "keyphrases": [
        "chất ma túy",
        "chất gây nghiện",
        "chất hướng thần",
        "danh mục chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Chất gây nghiện",
      "meaning": "Chất kích thích hoặc ức chế thần kinh, dễ gây tình trạng nghiện đối với người sử dụng.",
      "attrs": [
        "kích thích thần kinh",
        "ức chế thần kinh",
        "gây nghiện"
      ],
      "keyphrases": [
        "chất gây nghiện",
        "kích thích thần kinh",
        "ức chế thần kinh",
        "tình trạng nghiện"
      ],
      "similar": []
    },
    {
      "name": "Chất hướng thần",
      "meaning": "Chất kích thích hoặc ức chế thần kinh hoặc gây ảo giác, nếu sử dụng nhiều lần có thể dẫn tới tình trạng nghiện.",
      "attrs": [
        "kích thích thần kinh",
        "ức chế thần kinh",
        "gây ảo giác",
        "gây nghiện (khi sử dụng nhiều lần)"
      ],
      "keyphrases": [
        "chất hướng thần",
        "kích thích thần kinh",
        "ức chế thần kinh",
        "gây ảo giác",
        "tình trạng nghiện"
      ],
      "similar": []
    },
    {
      "name": "Tiền chất",
      "meaning": "Hóa chất không thể thiếu trong quá trình điều chế, sản xuất chất ma túy, được quy định trong danh mục do Chính phủ ban hành.",
      "attrs": [
        "hóa chất",
        "không thể thiếu trong điều chế/sản xuất chất ma túy",
        "được quy định trong danh mục của Chính phủ"
      ],
      "keyphrases": [
        "tiền chất",
        "hóa chất",
        "điều chế",
        "sản xuất chất ma túy",
        "danh mục tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Thuốc thú y có chứa chất ma túy, tiền chất",
      "meaning": "Thuốc thú y có chứa các chất gây nghiện, chất hướng thần hoặc tiền chất.",
      "attrs": [
        "thuốc thú y",
        "chứa chất ma túy",
        "chứa tiền chất"
      ],
      "keyphrases": [
        "thuốc thú y",
        "chất ma túy",
        "tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Cây có chứa chất ma túy",
      "meaning": "Cây thuốc phiện, cây côca, cây cần sa và các loại cây khác có chứa chất ma túy do Chính phủ quy định.",
      "attrs": [
        "cây thuốc phiện",
        "cây côca",
        "cây cần sa",
        "các loại cây khác có chứa chất ma túy"
      ],
      "keyphrases": [
        "cây có chứa chất ma túy",
        "cây thuốc phiện",
        "cây côca",
        "cây cần sa"
      ],
      "similar": []
    },
    {
      "name": "Phòng, chống ma túy",
      "meaning": "Phòng ngừa, ngăn chặn, đấu tranh chống tội phạm và tệ nạn ma túy; kiểm soát các hoạt động hợp pháp liên quan đến ma túy.",
      "attrs": [
        "phòng ngừa",
        "ngăn chặn",
        "đấu tranh chống tội phạm ma túy",
        "đấu tranh chống tệ nạn ma túy",
        "kiểm soát các hoạt động hợp pháp liên quan đến ma túy"
      ],
      "keyphrases": [
        "phòng, chống ma túy",
        "phòng ngừa",
        "ngăn chặn",
        "đấu tranh",
        "tội phạm ma túy",
        "tệ nạn ma túy",
        "kiểm soát các hoạt động hợp pháp liên quan đến ma túy"
      ],
      "similar": []
    },
    {
      "name": "Tệ nạn ma túy",
      "meaning": "Việc sử dụng trái phép chất ma túy, nghiện ma túy và các hành vi vi phạm pháp luật về ma túy mà chưa đến mức hoặc không bị truy cứu trách nhiệm hình sự.",
      "attrs": [
        "sử dụng trái phép chất ma túy",
        "nghiện ma túy",
        "vi phạm pháp luật về ma túy",
        "chưa đến mức truy cứu trách nhiệm hình sự",
        "không bị truy cứu trách nhiệm hình sự"
      ],
      "keyphrases": [
        "tệ nạn ma túy",
        "sử dụng trái phép chất ma túy",
        "nghiện ma túy",
        "vi phạm pháp luật về ma túy"
      ],
      "similar": []
    },
    {
      "name": "Kiểm soát các hoạt động hợp pháp liên quan đến ma túy",
      "meaning": "Việc cho phép, theo dõi, kiểm tra, giám sát các hoạt động hợp pháp liên quan đến ma túy và phòng ngừa, ngăn chặn việc lợi dụng các hoạt động đó vào mục đích khác.",
      "attrs": [
        "cho phép",
        "theo dõi",
        "kiểm tra",
        "giám sát",
        "hoạt động hợp pháp liên quan đến ma túy",
        "phòng ngừa",
        "ngăn chặn việc lợi dụng"
      ],
      "keyphrases": [
        "kiểm soát các hoạt động hợp pháp liên quan đến ma túy",
        "cho phép",
        "theo dõi",
        "kiểm tra",
        "giám sát",
        "hoạt động hợp pháp",
        "phòng ngừa",
        "ngăn chặn",
        "lợi dụng"
      ],
      "similar": []
    },
    {
      "name": "Người sử dụng trái phép chất ma túy",
      "meaning": "Người có hành vi sử dụng chất ma túy mà không được sự cho phép của người hoặc cơ quan chuyên môn có thẩm quyền và xét nghiệm chất ma túy trong cơ thể có kết quả dương tính.",
      "attrs": [
        "sử dụng chất ma túy",
        "không được sự cho phép",
        "người/cơ quan chuyên môn có thẩm quyền",
        "xét nghiệm dương tính"
      ],
      "keyphrases": [
        "người sử dụng trái phép chất ma túy",
        "sử dụng chất ma túy",
        "không được sự cho phép",
        "cơ quan chuyên môn có thẩm quyền",
        "xét nghiệm chất ma túy",
        "kết quả dương tính"
      ],
      "similar": []
    },
    {
      "name": "Xét nghiệm chất ma túy trong cơ thể",
      "meaning": "Việc thực hiện các kỹ thuật chuyên môn nhằm xác định chất ma túy trong cơ thể thông qua mẫu nước tiểu, mẫu máu hoặc các mẫu vật khác của cơ thể người.",
      "attrs": [
        "kỹ thuật chuyên môn",
        "xác định chất ma túy",
        "mẫu nước tiểu",
        "mẫu máu",
        "mẫu vật khác của cơ thể"
      ],
      "keyphrases": [
        "xét nghiệm chất ma túy trong cơ thể",
        "kỹ thuật chuyên môn",
        "xác định chất ma túy",
        "mẫu nước tiểu",
        "mẫu máu",
        "mẫu vật khác"
      ],
      "similar": []
    },
    {
      "name": "Người nghiện ma túy",
      "meaning": "Người sử dụng chất ma túy, thuốc gây nghiện, thuốc hướng thần và bị lệ thuộc vào các chất này.",
      "attrs": [
        "sử dụng chất ma túy",
        "sử dụng thuốc gây nghiện",
        "sử dụng thuốc hướng thần",
        "bị lệ thuộc"
      ],
      "keyphrases": [
        "người nghiện ma túy",
        "chất ma túy",
        "thuốc gây nghiện",
        "thuốc hướng thần",
        "lệ thuộc"
      ],
      "similar": []
    },
    {
      "name": "Cai nghiện ma túy",
      "meaning": "Quá trình hỗ trợ về y tế, tâm lý, xã hội, giúp người nghiện dừng sử dụng chất ma túy, phục hồi thể chất, tinh thần, nâng cao nhận thức, thay đổi hành vi để chấm dứt việc sử dụng trái phép.",
      "attrs": [
        "hỗ trợ y tế",
        "hỗ trợ tâm lý",
        "hỗ trợ xã hội",
        "dừng sử dụng chất ma túy",
        "phục hồi thể chất",
        "phục hồi tinh thần",
        "nâng cao nhận thức",
        "thay đổi hành vi",
        "chấm dứt sử dụng trái phép"
      ],
      "keyphrases": [
        "cai nghiện ma túy",
        "hỗ trợ y tế",
        "hỗ trợ tâm lý",
        "hỗ trợ xã hội",
        "dừng sử dụng",
        "phục hồi thể chất",
        "phục hồi tinh thần",
        "nâng cao nhận thức",
        "thay đổi hành vi",
        "chấm dứt việc sử dụng trái phép"
      ],
      "similar": []
    },
    {
      "name": "Cơ sở cai nghiện ma túy",
      "meaning": "Cơ sở được thành lập để thực hiện đầy đủ quy trình cai nghiện theo quy định của Luật này, bao gồm cơ sở cai nghiện ma túy công lập và cơ sở cai nghiện ma túy tự nguyện.",
      "attrs": [
        "thành lập để thực hiện quy trình cai nghiện",
        "cơ sở cai nghiện ma túy công lập",
        "cơ sở cai nghiện ma túy tự nguyện"
      ],
      "keyphrases": [
        "cơ sở cai nghiện ma túy",
        "quy trình cai nghiện",
        "cơ sở cai nghiện ma túy công lập",
        "cơ sở cai nghiện ma túy tự nguyện"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_3",
  "article_number": "3",
  "text": "Điều 3. Chính sách của Nhà nước về phòng, chống ma túy\n1. Thực hiện đồng bộ các biện pháp phòng, chống ma túy; kết hợp với phòng, chống HIV/AIDS và các tệ nạn xã hội khác.\n2. Tăng cường hoạt động tuyên truyền, giáo dục về công tác phòng, chống ma túy; khuyến khích tổ chức, cá nhân tham gia tuyên truyền, giáo dục phòng, chống ma túy.\n3. Ưu tiên nguồn lực phòng, chống ma túy cho vùng đồng bào dân tộc thiểu số và miền núi, vùng sâu, vùng xa, hải đảo, khu vực biên giới và địa bàn phức tạp về ma túy.\n4. Cán bộ, chiến sĩ thuộc cơ quan chuyên trách phòng, chống tội phạm về ma túy, người làm công tác cai nghiện ma túy trong các cơ sở cai nghiện ma túy công lập được hưởng chế độ, chính sách ưu đãi phù hợp với tính chất nhiệm vụ, địa bàn hoạt động theo quy định của Chính phủ.\n5. Bảo vệ, hỗ trợ cá nhân, gia đình, cơ quan, tổ chức tham gia phòng, chống ma túy.\n6. Quản lý chặt chẽ người sử dụng trái phép chất ma túy, người nghiện ma túy; khuyến khích người nghiện ma túy tự nguyện cai nghiện ma túy, điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế; khuyến khích cá nhân, gia đình, cơ quan, tổ chức tham gia, hỗ trợ hoạt động cai nghiện ma túy, quản lý sau cai nghiện ma túy.\n7. Bảo đảm kinh phí cai nghiện ma túy bắt buộc; hỗ trợ kinh phí cai nghiện ma túy tự nguyện, kinh phí quản lý sau cai nghiện ma túy.\n8. Tổ chức, cá nhân trong nước và ngoài nước đầu tư vào hoạt động cai nghiện ma túy, hỗ trợ quản lý sau cai nghiện ma túy, phòng, chống tái nghiện ma túy được miễn, giảm tiền thuê đất, thuế thu nhập doanh nghiệp theo quy định của pháp luật.\n9. Khuyến khích nghiên cứu khoa học, phát triển công nghệ và ứng dụng công nghệ cao trong phòng, chống ma túy.\n10. Khen thưởng cá nhân, tổ chức, cơ quan có thành tích trong phòng, chống ma túy.",
  "concepts": [
    {
      "name": "Phòng, chống ma túy",
      "meaning": "Các biện pháp và hoạt động do Nhà nước thực hiện để ngăn chặn, giảm thiểu tác hại của ma túy đối với xã hội.",
      "attrs": [
        "Đồng bộ các biện pháp",
        "Kết hợp với phòng, chống HIV/AIDS và các tệ nạn xã hội khác",
        "Tuyên truyền, giáo dục",
        "Ưu tiên nguồn lực",
        "Bảo vệ, hỗ trợ",
        "Quản lý chặt chẽ",
        "Bảo đảm kinh phí",
        "Khuyến khích đầu tư",
        "Khuyến khích nghiên cứu khoa học",
        "Khen thưởng"
      ],
      "keyphrases": [
        "phòng, chống ma túy",
        "công tác phòng, chống ma túy",
        "hoạt động cai nghiện ma túy",
        "quản lý sau cai nghiện ma túy",
        "phòng, chống tái nghiện ma túy"
      ],
      "similar": [
        "đấu tranh phòng, chống ma túy",
        "chống tệ nạn ma túy"
      ]
    },
    {
      "name": "Cơ quan chuyên trách phòng, chống tội phạm về ma túy",
      "meaning": "Các cơ quan nhà nước có chức năng, nhiệm vụ chuyên biệt trong việc phòng ngừa, phát hiện, điều tra và xử lý các hành vi phạm tội liên quan đến ma túy.",
      "attrs": [
        "Cán bộ, chiến sĩ thuộc cơ quan",
        "Được hưởng chế độ, chính sách ưu đãi",
        "Phù hợp với tính chất nhiệm vụ, địa bàn hoạt động"
      ],
      "keyphrases": [
        "cơ quan chuyên trách phòng, chống tội phạm về ma túy"
      ],
      "similar": [
        "lực lượng phòng, chống ma túy"
      ]
    },
    {
      "name": "Cai nghiện ma túy",
      "meaning": "Quá trình điều trị và phục hồi cho người nghiện ma túy, nhằm giúp họ từ bỏ việc sử dụng ma túy và tái hòa nhập cộng đồng.",
      "attrs": [
        "Tự nguyện",
        "Bắt buộc",
        "Điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
        "Quản lý sau cai nghiện"
      ],
      "keyphrases": [
        "cai nghiện ma túy",
        "cơ sở cai nghiện ma túy",
        "cai nghiện ma túy bắt buộc",
        "cai nghiện ma túy tự nguyện",
        "quản lý sau cai nghiện ma túy"
      ],
      "similar": [
        "điều trị nghiện",
        "phục hồi chức năng cho người nghiện"
      ]
    },
    {
      "name": "Người sử dụng trái phép chất ma túy",
      "meaning": "Cá nhân sử dụng các chất ma túy mà không được phép của pháp luật.",
      "attrs": [
        "Quản lý chặt chẽ"
      ],
      "keyphrases": [
        "người sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "người nghiện ma túy"
      ]
    },
    {
      "name": "Người nghiện ma túy",
      "meaning": "Cá nhân bị lệ thuộc vào chất ma túy, có nhu cầu sử dụng ma túy thường xuyên và không thể tự kiểm soát được hành vi sử dụng ma túy.",
      "attrs": [
        "Quản lý chặt chẽ",
        "Khuyến khích tự nguyện cai nghiện",
        "Điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế"
      ],
      "keyphrases": [
        "người nghiện ma túy"
      ],
      "similar": [
        "người sử dụng ma túy",
        "con nghiện"
      ]
    }
  ]
},
{
  "article_id": "article_4",
  "article_number": "4",
  "text": "Điều 4. Nguồn tài chính cho phòng, chống ma túy\n1. Ngân sách nhà nước.\n2. Nguồn tài trợ, viện trợ, đầu tư, tặng cho của tổ chức, cá nhân trong nước và ngoài nước.\n3. Chi trả của gia đình, người nghiện ma túy.\n4. Các nguồn tài chính hợp pháp khác.",
  "concepts": [
    {
      "name": "Nguồn tài chính cho phòng, chống ma túy",
      "meaning": "Các nguồn lực tài chính được sử dụng để thực hiện các hoạt động phòng ngừa và chống lại tệ nạn ma túy.",
      "attrs": [
        "Tính hợp pháp",
        "Đa dạng nguồn gốc"
      ],
      "keyphrases": [
        "Nguồn tài chính cho phòng, chống ma túy"
      ],
      "similar": [
        "Kinh phí cho phòng, chống ma túy",
        "Nguồn lực tài chính cho công tác phòng, chống ma túy"
      ]
    },
    {
      "name": "Ngân sách nhà nước",
      "meaning": "Khoản tiền được phân bổ từ ngân sách quốc gia để phục vụ cho công tác phòng, chống ma túy.",
      "attrs": [
        "Nguồn gốc công",
        "Tính ổn định",
        "Được quản lý theo quy định của pháp luật về ngân sách"
      ],
      "keyphrases": [
        "Ngân sách nhà nước"
      ],
      "similar": [
        "Ngân sách quốc gia",
        "Kinh phí từ ngân sách"
      ]
    },
    {
      "name": "Tài trợ, viện trợ, đầu tư, tặng cho",
      "meaning": "Các khoản tiền hoặc tài sản được cung cấp bởi các tổ chức, cá nhân trong và ngoài nước để hỗ trợ công tác phòng, chống ma túy.",
      "attrs": [
        "Nguồn gốc tư nhân hoặc tổ chức",
        "Tính tự nguyện",
        "Có thể có điều kiện kèm theo"
      ],
      "keyphrases": [
        "tài trợ",
        "viện trợ",
        "đầu tư",
        "tặng cho",
        "tổ chức, cá nhân trong nước và ngoài nước"
      ],
      "similar": [
        "Hỗ trợ tài chính",
        "Đóng góp"
      ]
    },
    {
      "name": "Chi trả của gia đình, người nghiện ma túy",
      "meaning": "Khoản tiền do gia đình hoặc chính người nghiện ma túy chi trả cho các hoạt động liên quan đến cai nghiện, phục hồi chức năng.",
      "attrs": [
        "Nguồn gốc cá nhân/gia đình",
        "Liên quan trực tiếp đến người nghiện",
        "Nhằm mục đích điều trị, phục hồi"
      ],
      "keyphrases": [
        "Chi trả của gia đình",
        "người nghiện ma túy"
      ],
      "similar": [
        "Kinh phí tự chi trả",
        "Chi phí điều trị"
      ]
    },
    {
      "name": "Nguồn tài chính hợp pháp khác",
      "meaning": "Bất kỳ nguồn tài chính nào khác không thuộc các nguồn đã nêu trên, nhưng được thu thập và sử dụng một cách hợp pháp cho mục đích phòng, chống ma túy.",
      "attrs": [
        "Tính hợp pháp",
        "Không xác định cụ thể",
        "Bổ sung cho các nguồn chính"
      ],
      "keyphrases": [
        "Các nguồn tài chính hợp pháp khác"
      ],
      "similar": [
        "Nguồn thu hợp pháp khác",
        "Các nguồn lực tài chính khác theo quy định của pháp luật"
      ]
    }
  ]
},
{
  "article_id": "article_5",
  "article_number": "5",
  "text": "Điều 5. Các hành vi bị nghiêm cấm\n1. Trồng cây có chứa chất ma túy, hướng dẫn trồng cây có chứa chất ma túy.\n2. Nghiên cứu, giám định, kiểm nghiệm, kiểm định, sản xuất, tàng trữ, vận chuyển, bảo quản, tồn trữ, mua bán, phân phối, xử lý, trao đổi, xuất khẩu, nhập khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh trái phép chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc, thuốc thú y có chứa chất ma túy, tiền chất.\n3. Chiếm đoạt chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc, thuốc thú y có chứa chất ma túy, tiền chất.\n4. Giao nhận, quản lý, kiểm soát, lưu giữ, cấp phát, bảo quản chất ma túy, tiền chất trái quy định của pháp luật; cho phép người sử dụng chất ma túy, thuốc gây nghiện hoặc thuốc hướng thần trái quy định của pháp luật.\n5. Sử dụng, tổ chức sử dụng trái phép chất ma túy; cưỡng bức, lôi kéo người khác sử dụng trái phép chất ma túy; chứa chấp, hỗ trợ việc sử dụng trái phép chất ma túy.\n6. Sản xuất, tàng trữ, vận chuyển, mua bán phương tiện, dụng cụ dùng vào việc sản xuất hoặc sử dụng trái phép chất ma túy.\n7. Chống lại hoặc cản trở việc xét nghiệm chất ma túy trong cơ thể, xác định tình trạng nghiện ma túy, quản lý người sử dụng trái phép chất ma túy, cai nghiện ma túy, quản lý sau cai nghiện ma túy.\n8. Trả thù hoặc cản trở người thực thi nhiệm vụ phòng, chống ma túy, người tham gia phòng, chống ma túy.\n9. Lợi dụng chức vụ, quyền hạn, nghề nghiệp để vi phạm pháp luật về phòng, chống ma túy.\n10. Hướng dẫn sản xuất, hướng dẫn sử dụng trái phép chất ma túy; quảng cáo, tiếp thị chất ma túy.\n11. Kỳ thị người sử dụng trái phép chất ma túy, người cai nghiện ma túy, người sau cai nghiện ma túy.\n12. Các hành vi bị nghiêm cấm khác do luật định liên quan đến ma túy.\nChương II\nTRÁCH NHIỆM PHÒNG, CHỐNG MA TÚY",
  "concepts": [
    {
      "name": "Hành vi bị nghiêm cấm",
      "meaning": "Những hành động, hoạt động mà pháp luật cấm thực hiện, đặc biệt trong lĩnh vực phòng, chống ma túy.",
      "attrs": [
        "Tính trái pháp luật",
        "Hậu quả pháp lý (ví dụ: xử phạt hành chính, truy cứu trách nhiệm hình sự)"
      ],
      "keyphrases": [
        "hành vi bị nghiêm cấm"
      ],
      "similar": [
        "hành vi vi phạm pháp luật",
        "hành vi trái pháp luật"
      ]
    },
    {
      "name": "Chất ma túy",
      "meaning": "Các chất gây nghiện, chất hướng thần được quy định trong danh mục do cơ quan nhà nước có thẩm quyền ban hành.",
      "attrs": [
        "Gây nghiện",
        "Gây ảo giác",
        "Ảnh hưởng đến thần kinh",
        "Bị kiểm soát chặt chẽ bởi pháp luật"
      ],
      "keyphrases": [
        "chất ma túy"
      ],
      "similar": [
        "ma túy"
      ]
    },
    {
      "name": "Tiền chất",
      "meaning": "Các hóa chất được sử dụng trong quá trình sản xuất chất ma túy.",
      "attrs": [
        "Sử dụng để sản xuất ma túy",
        "Bị kiểm soát chặt chẽ bởi pháp luật"
      ],
      "keyphrases": [
        "tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Thuốc gây nghiện",
      "meaning": "Các loại thuốc có chứa chất gây nghiện, được sử dụng trong y tế nhưng cần kiểm soát chặt chẽ.",
      "attrs": [
        "Chứa chất gây nghiện",
        "Sử dụng trong y tế",
        "Bị kiểm soát chặt chẽ bởi pháp luật"
      ],
      "keyphrases": [
        "thuốc gây nghiện"
      ],
      "similar": []
    },
    {
      "name": "Thuốc hướng thần",
      "meaning": "Các loại thuốc tác động lên hệ thần kinh, có thể gây ảo giác hoặc thay đổi tâm trạng, cần kiểm soát chặt chẽ.",
      "attrs": [
        "Tác động lên hệ thần kinh",
        "Có thể gây ảo giác",
        "Bị kiểm soát chặt chẽ bởi pháp luật"
      ],
      "keyphrases": [
        "thuốc hướng thần"
      ],
      "similar": []
    },
    {
      "name": "Thuốc tiền chất",
      "meaning": "Các loại thuốc có chứa tiền chất, được sử dụng trong y tế nhưng cần kiểm soát chặt chẽ.",
      "attrs": [
        "Chứa tiền chất",
        "Sử dụng trong y tế",
        "Bị kiểm soát chặt chẽ bởi pháp luật"
      ],
      "keyphrases": [
        "thuốc tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Nguyên liệu làm thuốc",
      "meaning": "Các dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc.",
      "attrs": [
        "Dược chất gây nghiện",
        "Dược chất hướng thần",
        "Tiền chất dùng làm thuốc"
      ],
      "keyphrases": [
        "nguyên liệu làm thuốc là dược chất gây nghiện",
        "dược chất hướng thần",
        "tiền chất dùng làm thuốc"
      ],
      "similar": []
    },
    {
      "name": "Thuốc thú y có chứa chất ma túy, tiền chất",
      "meaning": "Các loại thuốc dùng cho động vật có chứa chất ma túy hoặc tiền chất, cần kiểm soát chặt chẽ.",
      "attrs": [
        "Dùng cho động vật",
        "Chứa chất ma túy",
        "Chứa tiền chất",
        "Bị kiểm soát chặt chẽ bởi pháp luật"
      ],
      "keyphrases": [
        "thuốc thú y có chứa chất ma túy",
        "tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Sử dụng trái phép chất ma túy",
      "meaning": "Việc sử dụng chất ma túy mà không được phép của pháp luật.",
      "attrs": [
        "Không được phép",
        "Vi phạm pháp luật"
      ],
      "keyphrases": [
        "sử dụng trái phép chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Phương tiện, dụng cụ dùng vào việc sản xuất hoặc sử dụng trái phép chất ma túy",
      "meaning": "Các công cụ, thiết bị được sử dụng để sản xuất hoặc sử dụng chất ma túy một cách bất hợp pháp.",
      "attrs": [
        "Sử dụng để sản xuất ma túy",
        "Sử dụng để sử dụng ma túy",
        "Trái phép"
      ],
      "keyphrases": [
        "phương tiện, dụng cụ dùng vào việc sản xuất hoặc sử dụng trái phép chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Tình trạng nghiện ma túy",
      "meaning": "Trạng thái lệ thuộc vào chất ma túy về mặt thể chất và tinh thần.",
      "attrs": [
        "Lệ thuộc thể chất",
        "Lệ thuộc tinh thần"
      ],
      "keyphrases": [
        "tình trạng nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Quản lý người sử dụng trái phép chất ma túy",
      "meaning": "Các biện pháp hành chính và pháp lý nhằm kiểm soát và giúp đỡ người sử dụng trái phép chất ma túy.",
      "attrs": [
        "Biện pháp hành chính",
        "Biện pháp pháp lý",
        "Kiểm soát",
        "Hỗ trợ"
      ],
      "keyphrases": [
        "quản lý người sử dụng trái phép chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Cai nghiện ma túy",
      "meaning": "Quá trình giúp người nghiện ma túy từ bỏ việc sử dụng chất ma túy.",
      "attrs": [
        "Từ bỏ ma túy",
        "Phục hồi sức khỏe"
      ],
      "keyphrases": [
        "cai nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Quản lý sau cai nghiện ma túy",
      "meaning": "Các biện pháp hỗ trợ và giám sát người đã cai nghiện ma túy để ngăn ngừa tái nghiện.",
      "attrs": [
        "Hỗ trợ",
        "Giám sát",
        "Ngăn ngừa tái nghiện"
      ],
      "keyphrases": [
        "quản lý sau cai nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Phòng, chống ma túy",
      "meaning": "Các hoạt động nhằm ngăn chặn và đẩy lùi tệ nạn ma túy.",
      "attrs": [
        "Ngăn chặn",
        "Đẩy lùi",
        "Tệ nạn ma túy"
      ],
      "keyphrases": [
        "phòng, chống ma túy"
      ],
      "similar": []
    },
    {
      "name": "Kỳ thị",
      "meaning": "Thái độ phân biệt đối xử, xa lánh đối với một nhóm người cụ thể.",
      "attrs": [
        "Phân biệt đối xử",
        "Xa lánh"
      ],
      "keyphrases": [
        "kỳ thị"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_6",
  "article_number": "6",
  "text": "Điều 6. Trách nhiệm của cá nhân, gia đình\n1. Tuyên truyền, giáo dục thành viên trong gia đình, người thân về tác hại của ma túy và thực hiện quy định của pháp luật về phòng, chống ma túy; quản lý, ngăn chặn thành viên trong gia đình vi phạm pháp luật về phòng, chống ma túy.\n2. Thực hiện đúng chỉ định của người có thẩm quyền về sử dụng thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, thuốc thú y có chứa chất ma túy, tiền chất.\n3. Hợp tác với cơ quan chức năng trong đấu tranh với tội phạm và tệ nạn ma túy; tham gia hỗ trợ hoạt động cai nghiện ma túy tự nguyện tại gia đình, cộng đồng, cai nghiện ma túy tại cơ sở cai nghiện ma túy và điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế; theo dõi, giúp đỡ người sau cai nghiện ma túy hòa nhập cộng đồng; phòng, chống tái nghiện ma túy.\n4. Cung cấp kịp thời thông tin về tội phạm, tệ nạn ma túy và việc trồng cây có chứa chất ma túy cho cơ quan công an hoặc cơ quan nhà nước có thẩm quyền; tham gia xóa bỏ cây có chứa chất ma túy do chính quyền địa phương tổ chức.",
  "concepts": [
    {
      "name": "Trách nhiệm của cá nhân, gia đình về phòng, chống ma túy",
      "meaning": "Nghĩa vụ pháp lý mà cá nhân và gia đình phải thực hiện để ngăn ngừa, đấu tranh và giảm thiểu tác hại của ma túy.",
      "attrs": [
        "Tuyên truyền, giáo dục",
        "Quản lý, ngăn chặn",
        "Thực hiện đúng chỉ định",
        "Hợp tác với cơ quan chức năng",
        "Tham gia hỗ trợ cai nghiện",
        "Theo dõi, giúp đỡ người sau cai nghiện",
        "Cung cấp thông tin",
        "Tham gia xóa bỏ cây có chứa chất ma túy"
      ],
      "keyphrases": [
        "Trách nhiệm của cá nhân, gia đình",
        "Tuyên truyền, giáo dục thành viên trong gia đình, người thân về tác hại của ma túy",
        "Thực hiện quy định của pháp luật về phòng, chống ma túy",
        "Quản lý, ngăn chặn thành viên trong gia đình vi phạm pháp luật về phòng, chống ma túy",
        "Thực hiện đúng chỉ định của người có thẩm quyền",
        "Hợp tác với cơ quan chức năng trong đấu tranh với tội phạm và tệ nạn ma túy",
        "Tham gia hỗ trợ hoạt động cai nghiện ma túy",
        "Theo dõi, giúp đỡ người sau cai nghiện ma túy hòa nhập cộng đồng",
        "Cung cấp kịp thời thông tin về tội phạm, tệ nạn ma túy",
        "Tham gia xóa bỏ cây có chứa chất ma túy"
      ],
      "similar": [
        "Nghĩa vụ của cá nhân và gia đình trong phòng, chống ma túy"
      ]
    },
    {
      "name": "Phòng, chống ma túy",
      "meaning": "Các hoạt động nhằm ngăn chặn, hạn chế và loại bỏ các hành vi liên quan đến ma túy, bao gồm sản xuất, tàng trữ, vận chuyển, mua bán, sử dụng trái phép chất ma túy.",
      "attrs": [
        "Tuyên truyền",
        "Giáo dục",
        "Quản lý",
        "Ngăn chặn",
        "Đấu tranh",
        "Cai nghiện",
        "Hòa nhập cộng đồng",
        "Phòng, chống tái nghiện",
        "Xóa bỏ cây có chứa chất ma túy"
      ],
      "keyphrases": [
        "phòng, chống ma túy",
        "tác hại của ma túy",
        "vi phạm pháp luật về phòng, chống ma túy",
        "tội phạm và tệ nạn ma túy",
        "cai nghiện ma túy",
        "tái nghiện ma túy",
        "cây có chứa chất ma túy"
      ],
      "similar": [
        "Chống ma túy",
        "Ngăn ngừa ma túy",
        "Đấu tranh với ma túy"
      ]
    },
    {
      "name": "Thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, thuốc thú y có chứa chất ma túy, tiền chất",
      "meaning": "Các loại thuốc có chứa các chất có khả năng gây nghiện, ảnh hưởng đến thần kinh, hoặc là tiền chất để sản xuất ma túy, bao gồm cả thuốc thú y.",
      "attrs": [
        "Gây nghiện",
        "Hướng thần",
        "Tiền chất",
        "Thuốc thú y",
        "Chứa chất ma túy",
        "Chứa tiền chất"
      ],
      "keyphrases": [
        "thuốc gây nghiện",
        "thuốc hướng thần",
        "thuốc tiền chất",
        "thuốc thú y có chứa chất ma túy, tiền chất"
      ],
      "similar": [
        "Các loại thuốc có chứa chất ma túy",
        "Các chất gây nghiện"
      ]
    },
    {
      "name": "Cai nghiện ma túy",
      "meaning": "Quá trình giúp người nghiện ma túy từ bỏ việc sử dụng chất ma túy, phục hồi sức khỏe và hòa nhập cộng đồng.",
      "attrs": [
        "Tự nguyện",
        "Tại gia đình",
        "Tại cộng đồng",
        "Tại cơ sở cai nghiện",
        "Điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế"
      ],
      "keyphrases": [
        "cai nghiện ma túy tự nguyện tại gia đình, cộng đồng",
        "cai nghiện ma túy tại cơ sở cai nghiện ma túy",
        "điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
        "người sau cai nghiện ma túy"
      ],
      "similar": [
        "Điều trị nghiện ma túy",
        "Phục hồi cho người nghiện ma túy"
      ]
    },
    {
      "name": "Tội phạm và tệ nạn ma túy",
      "meaning": "Các hành vi vi phạm pháp luật liên quan đến ma túy và các hiện tượng tiêu cực phát sinh từ việc sử dụng ma túy.",
      "attrs": [
        "Tội phạm",
        "Tệ nạn"
      ],
      "keyphrases": [
        "tội phạm và tệ nạn ma túy"
      ],
      "similar": [
        "Các hành vi phạm tội liên quan đến ma túy",
        "Các vấn đề xã hội do ma túy gây ra"
      ]
    },
    {
      "name": "Cây có chứa chất ma túy",
      "meaning": "Các loại thực vật tự nhiên hoặc được trồng có chứa các chất có khả năng gây nghiện hoặc tạo ra các chất ma túy.",
      "attrs": [
        "Chứa chất ma túy"
      ],
      "keyphrases": [
        "cây có chứa chất ma túy"
      ],
      "similar": [
        "Thực vật chứa chất ma túy"
      ]
    }
  ]
},
{
  "article_id": "article_7",
  "article_number": "7",
  "text": "Điều 7. Trách nhiệm của cơ quan nhà nước\n1. Tổ chức phòng, chống ma túy trong cơ quan, đơn vị; phòng ngừa, ngăn chặn cán bộ, công chức, viên chức, người lao động thuộc quyền quản lý và cán bộ, chiến sĩ thuộc lực lượng vũ trang nhân dân vi phạm pháp luật về phòng, chống ma túy; tuyên truyền, vận động Nhân dân phát hiện, tố giác, đấu tranh với tội phạm và tệ nạn ma túy.\n2. Tổ chức thực hiện chủ trương, chính sách của Nhà nước về quy hoạch, phát triển kinh tế - xã hội để thay thế việc trồng cây có chứa chất ma túy tại các vùng xóa bỏ cây có chứa chất ma túy.",
  "concepts": [
    {
      "name": "Trách nhiệm của cơ quan nhà nước",
      "meaning": "Nghĩa vụ pháp lý của các cơ quan nhà nước trong việc phòng, chống ma túy, bao gồm tổ chức phòng chống ma túy nội bộ, phòng ngừa vi phạm pháp luật về ma túy, tuyên truyền vận động nhân dân và thực hiện chính sách thay thế cây có chứa chất ma túy.",
      "attrs": [
        "Phòng, chống ma túy trong cơ quan, đơn vị",
        "Phòng ngừa, ngăn chặn vi phạm pháp luật về ma túy",
        "Tuyên truyền, vận động Nhân dân",
        "Thực hiện chủ trương, chính sách về thay thế cây có chứa chất ma túy"
      ],
      "keyphrases": [
        "Trách nhiệm của cơ quan nhà nước",
        "Tổ chức phòng, chống ma túy",
        "Phòng ngừa, ngăn chặn",
        "Vi phạm pháp luật về phòng, chống ma túy",
        "Tuyên truyền, vận động Nhân dân",
        "Tố giác, đấu tranh với tội phạm và tệ nạn ma túy",
        "Chủ trương, chính sách của Nhà nước",
        "Thay thế việc trồng cây có chứa chất ma túy",
        "Vùng xóa bỏ cây có chứa chất ma túy"
      ],
      "similar": [
        "Nghĩa vụ của cơ quan nhà nước",
        "Vai trò của cơ quan nhà nước trong phòng chống ma túy"
      ]
    },
    {
      "name": "Phòng, chống ma túy trong cơ quan, đơn vị",
      "meaning": "Hoạt động tổ chức và thực hiện các biện pháp phòng ngừa, ngăn chặn và đấu tranh với các hành vi liên quan đến ma túy trong phạm vi cơ quan, đơn vị nhà nước.",
      "attrs": [
        "Tổ chức",
        "Phòng ngừa",
        "Ngăn chặn",
        "Đấu tranh"
      ],
      "keyphrases": [
        "Phòng, chống ma túy trong cơ quan, đơn vị"
      ],
      "similar": [
        "Công tác phòng chống ma túy nội bộ",
        "Biện pháp phòng ngừa ma túy tại cơ quan"
      ]
    },
    {
      "name": "Phòng ngừa, ngăn chặn vi phạm pháp luật về phòng, chống ma túy",
      "meaning": "Các biện pháp chủ động để ngăn chặn cán bộ, công chức, viên chức, người lao động và lực lượng vũ trang nhân dân thực hiện các hành vi vi phạm pháp luật liên quan đến ma túy.",
      "attrs": [
        "Chủ động",
        "Ngăn chặn",
        "Cán bộ, công chức, viên chức",
        "Người lao động",
        "Lực lượng vũ trang nhân dân"
      ],
      "keyphrases": [
        "Phòng ngừa, ngăn chặn",
        "Vi phạm pháp luật về phòng, chống ma túy"
      ],
      "similar": [
        "Ngăn chặn hành vi phạm tội về ma túy",
        "Phòng ngừa các hành vi liên quan đến ma túy"
      ]
    },
    {
      "name": "Tuyên truyền, vận động Nhân dân",
      "meaning": "Hoạt động thông tin, giáo dục và thuyết phục người dân tham gia vào công tác phòng, chống ma túy, bao gồm phát hiện, tố giác và đấu tranh với tội phạm và tệ nạn ma túy.",
      "attrs": [
        "Thông tin",
        "Giáo dục",
        "Thuyết phục",
        "Phát hiện",
        "Tố giác",
        "Đấu tranh"
      ],
      "keyphrases": [
        "Tuyên truyền, vận động Nhân dân",
        "Tố giác, đấu tranh với tội phạm và tệ nạn ma túy"
      ],
      "similar": [
        "Vận động quần chúng tham gia phòng chống ma túy",
        "Nâng cao nhận thức về phòng chống ma túy"
      ]
    },
    {
      "name": "Chủ trương, chính sách về thay thế cây có chứa chất ma túy",
      "meaning": "Các quy định và biện pháp của Nhà nước nhằm chuyển đổi sản xuất từ cây trồng có chứa chất ma túy sang các loại cây trồng khác, góp phần xóa bỏ nguồn cung ma túy.",
      "attrs": [
        "Quy hoạch",
        "Phát triển kinh tế - xã hội",
        "Thay thế cây trồng",
        "Xóa bỏ cây có chứa chất ma túy"
      ],
      "keyphrases": [
        "Chủ trương, chính sách của Nhà nước",
        "Thay thế việc trồng cây có chứa chất ma túy",
        "Vùng xóa bỏ cây có chứa chất ma túy"
      ],
      "similar": [
        "Chính sách chuyển đổi cây trồng",
        "Biện pháp xóa bỏ cây có chứa chất ma túy"
      ]
    }
  ]
},
{
  "article_id": "article_8",
  "article_number": "8",
  "text": "Điều 8. Trách nhiệm của cơ sở giáo dục\n1. Tổ chức thực hiện chương trình giáo dục về phòng, chống ma túy; phổ biến, giáo dục pháp luật về phòng, chống ma túy cho học sinh, sinh viên, học viên; quản lý chặt chẽ, ngăn chặn học sinh, sinh viên, học viên vi phạm pháp luật về phòng, chống ma túy.\n2. Phối hợp với gia đình, cơ quan, tổ chức và chính quyền địa phương để quản lý, giáo dục học sinh, sinh viên, học viên về phòng, chống ma túy.\n3. Phối hợp với cơ quan, tổ chức, cá nhân có thẩm quyền tổ chức xét nghiệm chất ma túy trong cơ thể khi cần thiết để phát hiện học sinh, sinh viên, học viên sử dụng trái phép chất ma túy.",
  "concepts": [
    {
      "name": "Cơ sở giáo dục",
      "meaning": "Tổ chức có trách nhiệm thực hiện các hoạt động giáo dục và đào tạo, có nghĩa vụ trong phòng, chống ma túy theo quy định của pháp luật.",
      "attrs": [
        "Tổ chức thực hiện chương trình giáo dục về phòng, chống ma túy",
        "Phổ biến, giáo dục pháp luật về phòng, chống ma túy",
        "Quản lý chặt chẽ, ngăn chặn học sinh, sinh viên, học viên vi phạm pháp luật về phòng, chống ma túy",
        "Phối hợp với gia đình, cơ quan, tổ chức và chính quyền địa phương",
        "Phối hợp tổ chức xét nghiệm chất ma túy"
      ],
      "keyphrases": [
        "cơ sở giáo dục"
      ],
      "similar": []
    },
    {
      "name": "Phòng, chống ma túy",
      "meaning": "Các hoạt động nhằm ngăn chặn, phát hiện, xử lý các hành vi liên quan đến ma túy, bảo vệ cộng đồng và cá nhân khỏi tác hại của ma túy.",
      "attrs": [
        "Chương trình giáo dục",
        "Phổ biến, giáo dục pháp luật",
        "Quản lý, ngăn chặn vi phạm",
        "Phối hợp với các bên liên quan",
        "Xét nghiệm chất ma túy"
      ],
      "keyphrases": [
        "phòng, chống ma túy"
      ],
      "similar": [
        "chống tệ nạn ma túy",
        "kiểm soát ma túy"
      ]
    },
    {
      "name": "Học sinh, sinh viên, học viên",
      "meaning": "Đối tượng được giáo dục và quản lý bởi cơ sở giáo dục, có trách nhiệm tuân thủ pháp luật về phòng, chống ma túy.",
      "attrs": [
        "Đối tượng quản lý của cơ sở giáo dục",
        "Đối tượng được giáo dục về phòng, chống ma túy",
        "Đối tượng có thể bị xét nghiệm chất ma túy"
      ],
      "keyphrases": [
        "học sinh",
        "sinh viên",
        "học viên"
      ],
      "similar": [
        "người học"
      ]
    },
    {
      "name": "Vi phạm pháp luật về phòng, chống ma túy",
      "meaning": "Hành vi trái pháp luật liên quan đến ma túy, bao gồm sử dụng, tàng trữ, vận chuyển, mua bán, sản xuất trái phép chất ma túy.",
      "attrs": [
        "Hành vi trái pháp luật",
        "Liên quan đến ma túy"
      ],
      "keyphrases": [
        "vi phạm pháp luật về phòng, chống ma túy"
      ],
      "similar": [
        "hành vi phạm tội về ma túy",
        "tội phạm ma túy"
      ]
    },
    {
      "name": "Xét nghiệm chất ma túy",
      "meaning": "Thủ tục kiểm tra sự hiện diện của chất ma túy trong cơ thể người, được thực hiện khi có căn cứ để nghi ngờ sử dụng trái phép chất ma túy.",
      "attrs": [
        "Kiểm tra sự hiện diện của chất ma túy",
        "Thực hiện khi cần thiết",
        "Phát hiện sử dụng trái phép chất ma túy"
      ],
      "keyphrases": [
        "xét nghiệm chất ma túy"
      ],
      "similar": [
        "kiểm tra ma túy",
        "test ma túy"
      ]
    },
    {
      "name": "Sử dụng trái phép chất ma túy",
      "meaning": "Hành vi sử dụng chất ma túy không được pháp luật cho phép, gây ảnh hưởng đến sức khỏe và trật tự xã hội.",
      "attrs": [
        "Hành vi sử dụng chất ma túy",
        "Không được pháp luật cho phép"
      ],
      "keyphrases": [
        "sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "nghiện ma túy",
        "lạm dụng ma túy"
      ]
    }
  ]
},
{
  "article_id": "article_9",
  "article_number": "9",
  "text": "Điều 9. Trách nhiệm của cơ quan báo chí\nCơ quan báo chí có trách nhiệm phối hợp với cơ quan, tổ chức có liên quan tuyên truyền chủ trương, chính sách, pháp luật về phòng, chống ma túy.",
  "concepts": [
    {
      "name": "Cơ quan báo chí",
      "meaning": "Tổ chức được nhà nước cho phép hoạt động trong lĩnh vực báo chí, có trách nhiệm thực hiện các hoạt động thông tin, tuyên truyền.",
      "attrs": [
        "Được nhà nước cho phép",
        "Hoạt động trong lĩnh vực báo chí"
      ],
      "keyphrases": [
        "cơ quan báo chí"
      ],
      "similar": [
        "tổ chức báo chí",
        "đơn vị báo chí"
      ]
    },
    {
      "name": "Trách nhiệm của cơ quan báo chí",
      "meaning": "Nghĩa vụ pháp lý mà cơ quan báo chí phải thực hiện, cụ thể là phối hợp tuyên truyền về phòng, chống ma túy.",
      "attrs": [
        "Nghĩa vụ pháp lý",
        "Phối hợp tuyên truyền"
      ],
      "keyphrases": [
        "trách nhiệm của cơ quan báo chí",
        "phối hợp với cơ quan, tổ chức có liên quan tuyên truyền"
      ],
      "similar": [
        "nghĩa vụ của báo chí",
        "vai trò của báo chí"
      ]
    },
    {
      "name": "Cơ quan, tổ chức có liên quan",
      "meaning": "Các cơ quan nhà nước hoặc tổ chức xã hội có chức năng, nhiệm vụ liên quan đến công tác phòng, chống ma túy.",
      "attrs": [
        "Liên quan đến phòng, chống ma túy",
        "Cơ quan nhà nước hoặc tổ chức xã hội"
      ],
      "keyphrases": [
        "cơ quan, tổ chức có liên quan"
      ],
      "similar": [
        "đơn vị liên quan",
        "tổ chức hữu quan"
      ]
    },
    {
      "name": "Tuyên truyền",
      "meaning": "Hoạt động truyền bá, phổ biến thông tin, kiến thức nhằm nâng cao nhận thức và thay đổi hành vi của công chúng.",
      "attrs": [
        "Truyền bá thông tin",
        "Nâng cao nhận thức",
        "Thay đổi hành vi"
      ],
      "keyphrases": [
        "tuyên truyền"
      ],
      "similar": [
        "phổ biến",
        "giáo dục",
        "vận động"
      ]
    },
    {
      "name": "Chủ trương, chính sách, pháp luật về phòng, chống ma túy",
      "meaning": "Hệ thống các quy định, biện pháp của nhà nước nhằm ngăn chặn, kiểm soát và giảm thiểu tác hại của ma túy.",
      "attrs": [
        "Quy định của nhà nước",
        "Ngăn chặn ma túy",
        "Kiểm soát ma túy",
        "Giảm thiểu tác hại"
      ],
      "keyphrases": [
        "chủ trương, chính sách, pháp luật về phòng, chống ma túy"
      ],
      "similar": [
        "quy định về phòng chống ma túy",
        "văn bản pháp luật về ma túy"
      ]
    },
    {
      "name": "Phòng, chống ma túy",
      "meaning": "Các hoạt động nhằm ngăn ngừa, phát hiện, ngăn chặn và xử lý các hành vi liên quan đến ma túy.",
      "attrs": [
        "Ngăn ngừa",
        "Phát hiện",
        "Ngăn chặn",
        "Xử lý"
      ],
      "keyphrases": [
        "phòng, chống ma túy"
      ],
      "similar": [
        "chống ma túy",
        "đấu tranh phòng chống ma túy"
      ]
    }
  ]
},
{
  "article_id": "article_10",
  "article_number": "10",
  "text": "Điều 10. Trách nhiệm của Mặt trận Tổ quốc Việt Nam, các tổ chức thành viên của Mặt trận và tổ chức khác\n1. Tổ chức và phối hợp với cơ quan có thẩm quyền tuyên truyền, phổ biến kiến thức, pháp luật về phòng, chống ma túy trong Nhân dân; vận động Nhân dân tham gia phòng, chống ma túy và thực hiện các phong trào phòng, chống ma túy.\n2. Phòng ngừa, ngăn chặn người của tổ chức mình và mọi công dân vi phạm pháp luật về phòng, chống ma túy.\n3. Phối hợp với chính quyền địa phương các cấp, cơ quan có thẩm quyền vận động người nghiện ma túy thực hiện biện pháp cai nghiện ma túy, điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế; tham gia cảm hóa, giáo dục, dạy nghề, tìm việc làm và giúp đỡ người sau cai nghiện ma túy hòa nhập cộng đồng; phòng, chống tái nghiện ma túy.",
  "concepts": [
    {
      "name": "Trách nhiệm phòng, chống ma túy của Mặt trận Tổ quốc Việt Nam, các tổ chức thành viên và tổ chức khác",
      "meaning": "Nghĩa vụ và vai trò của Mặt trận Tổ quốc Việt Nam, các tổ chức thành viên và các tổ chức khác trong việc tham gia vào công tác phòng, chống ma túy.",
      "attrs": [
        "Tuyên truyền, phổ biến kiến thức, pháp luật về phòng, chống ma túy",
        "Vận động Nhân dân tham gia phòng, chống ma túy",
        "Thực hiện các phong trào phòng, chống ma túy",
        "Phòng ngừa, ngăn chặn người của tổ chức và công dân vi phạm pháp luật về phòng, chống ma túy",
        "Phối hợp vận động người nghiện ma túy cai nghiện",
        "Tham gia cảm hóa, giáo dục, dạy nghề, tìm việc làm cho người sau cai nghiện",
        "Giúp đỡ người sau cai nghiện ma túy hòa nhập cộng đồng",
        "Phòng, chống tái nghiện ma túy"
      ],
      "keyphrases": [
        "Trách nhiệm của Mặt trận Tổ quốc Việt Nam",
        "các tổ chức thành viên của Mặt trận",
        "tổ chức khác",
        "phòng, chống ma túy",
        "tuyên truyền, phổ biến kiến thức, pháp luật",
        "vận động Nhân dân tham gia",
        "phong trào phòng, chống ma túy",
        "phòng ngừa, ngăn chặn",
        "vi phạm pháp luật về phòng, chống ma túy",
        "cai nghiện ma túy",
        "điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
        "cảm hóa, giáo dục, dạy nghề, tìm việc làm",
        "người sau cai nghiện ma túy hòa nhập cộng đồng",
        "phòng, chống tái nghiện ma túy"
      ],
      "similar": [
        "Vai trò của Mặt trận Tổ quốc Việt Nam trong phòng, chống ma túy",
        "Nghĩa vụ của các tổ chức thành viên của Mặt trận trong phòng, chống ma túy",
        "Trách nhiệm xã hội trong phòng, chống ma túy"
      ]
    },
    {
      "name": "Tuyên truyền, phổ biến kiến thức, pháp luật về phòng, chống ma túy",
      "meaning": "Hoạt động truyền đạt thông tin, nâng cao nhận thức của người dân về tác hại của ma túy và các quy định pháp luật liên quan đến phòng, chống ma túy.",
      "attrs": [
        "Đối tượng: Nhân dân",
        "Nội dung: Kiến thức, pháp luật về phòng, chống ma túy",
        "Mục đích: Nâng cao nhận thức, thay đổi hành vi"
      ],
      "keyphrases": [
        "tuyên truyền",
        "phổ biến kiến thức",
        "pháp luật về phòng, chống ma túy",
        "trong Nhân dân"
      ],
      "similar": [
        "Giáo dục về phòng, chống ma túy",
        "Nâng cao nhận thức về tác hại của ma túy"
      ]
    },
    {
      "name": "Vận động Nhân dân tham gia phòng, chống ma túy",
      "meaning": "Kêu gọi, khuyến khích người dân chủ động tham gia vào các hoạt động phòng ngừa, phát hiện, tố giác và đấu tranh chống lại tệ nạn ma túy.",
      "attrs": [
        "Đối tượng: Nhân dân",
        "Hình thức: Kêu gọi, khuyến khích",
        "Mục đích: Tăng cường sự tham gia của cộng đồng vào công tác phòng, chống ma túy"
      ],
      "keyphrases": [
        "vận động Nhân dân",
        "tham gia phòng, chống ma túy"
      ],
      "similar": [
        "Khuyến khích cộng đồng tham gia phòng, chống ma túy",
        "Tăng cường sự tham gia của người dân vào công tác phòng, chống ma túy"
      ]
    },
    {
      "name": "Phòng ngừa, ngăn chặn vi phạm pháp luật về phòng, chống ma túy",
      "meaning": "Các biện pháp chủ động nhằm ngăn chặn các hành vi vi phạm pháp luật liên quan đến ma túy, bao gồm cả việc sử dụng, tàng trữ, mua bán, vận chuyển, sản xuất trái phép chất ma túy.",
      "attrs": [
        "Mục đích: Ngăn chặn vi phạm pháp luật",
        "Phạm vi: Các hành vi liên quan đến ma túy",
        "Đối tượng: Người của tổ chức và mọi công dân"
      ],
      "keyphrases": [
        "phòng ngừa",
        "ngăn chặn",
        "vi phạm pháp luật về phòng, chống ma túy"
      ],
      "similar": [
        "Ngăn chặn các hành vi phạm tội về ma túy",
        "Phòng chống tội phạm ma túy"
      ]
    },
    {
      "name": "Cai nghiện ma túy",
      "meaning": "Quá trình giúp người nghiện ma túy từ bỏ việc sử dụng ma túy, phục hồi sức khỏe và tái hòa nhập cộng đồng.",
      "attrs": [
        "Đối tượng: Người nghiện ma túy",
        "Mục tiêu: Từ bỏ ma túy, phục hồi sức khỏe, tái hòa nhập cộng đồng",
        "Biện pháp: Điều trị, tư vấn, hỗ trợ"
      ],
      "keyphrases": [
        "cai nghiện ma túy",
        "điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế"
      ],
      "similar": [
        "Điều trị nghiện ma túy",
        "Phục hồi cho người nghiện ma túy"
      ]
    },
    {
      "name": "Hòa nhập cộng đồng cho người sau cai nghiện",
      "meaning": "Quá trình giúp người đã cai nghiện ma túy tái hòa nhập vào cuộc sống xã hội, có việc làm ổn định và không tái nghiện.",
      "attrs": [
        "Đối tượng: Người sau cai nghiện ma túy",
        "Mục tiêu: Tái hòa nhập xã hội, có việc làm, không tái nghiện",
        "Biện pháp: Cảm hóa, giáo dục, dạy nghề, tìm việc làm, giúp đỡ"
      ],
      "keyphrases": [
        "người sau cai nghiện ma túy hòa nhập cộng đồng",
        "cảm hóa, giáo dục, dạy nghề, tìm việc làm",
        "giúp đỡ"
      ],
      "similar": [
        "Tái hòa nhập xã hội cho người sau cai nghiện",
        "Hỗ trợ người sau cai nghiện"
      ]
    },
    {
      "name": "Phòng, chống tái nghiện ma túy",
      "meaning": "Các biện pháp nhằm ngăn chặn người đã cai nghiện ma túy quay trở lại sử dụng ma túy.",
      "attrs": [
        "Mục đích: Ngăn chặn tái nghiện",
        "Đối tượng: Người đã cai nghiện ma túy",
        "Biện pháp: Theo dõi, hỗ trợ, tư vấn"
      ],
      "keyphrases": [
        "phòng, chống tái nghiện ma túy"
      ],
      "similar": [
        "Ngăn ngừa tái nghiện",
        "Chống tái nghiện"
      ]
    }
  ]
},
{
  "article_id": "article_11",
  "article_number": "11",
  "text": "Điều 11. Cơ quan chuyên trách phòng, chống tội phạm về ma túy\n1. Cơ quan chuyên trách phòng, chống tội phạm về ma túy bao gồm:\na) Cơ quan chuyên trách phòng, chống tội phạm về ma túy thuộc Công an nhân dân;\nb) Cơ quan chuyên trách phòng, chống tội phạm về ma túy thuộc Bộ đội Biên phòng, Cảnh sát biển Việt Nam và Hải quan.\n2. Cơ quan chuyên trách phòng, chống tội phạm về ma túy thuộc Công an nhân dân, trong phạm vi nhiệm vụ, quyền hạn của mình, chủ trì, phối hợp với cơ quan, tổ chức có liên quan thực hiện các hoạt động phòng ngừa, ngăn chặn và đấu tranh chống tội phạm về ma túy.\n3. Cơ quan chuyên trách phòng, chống tội phạm về ma túy thuộc Bộ đội Biên phòng, Cảnh sát biển Việt Nam, Hải quan, trong phạm vi nhiệm vụ, quyền hạn của mình, chủ trì, phối hợp với cơ quan công an, cơ quan, tổ chức khác có liên quan thực hiện các hoạt động phòng ngừa, ngăn chặn và đấu tranh chống tội phạm về ma túy tại khu vực hoặc địa bàn quản lý, kiểm soát.\n4. Trên cùng một địa bàn khi phát hiện hành vi vi phạm pháp luật liên quan đến nhiệm vụ, quyền hạn của nhiều cơ quan thì cơ quan phát hiện trước có trách nhiệm xử lý theo thẩm quyền do pháp luật quy định; trường hợp vụ việc không thuộc thẩm quyền của mình thì chuyển giao hồ sơ, người, tang vật vi phạm pháp luật cho cơ quan có thẩm quyền chủ trì giải quyết.\n5. Chính phủ quy định việc phối hợp của các cơ quan chuyên trách phòng, chống tội phạm về ma túy.\nChương III\nKIỂM SOÁT CÁC HOẠT ĐỘNG HỢP PHÁP LIÊN QUAN ĐẾN MA TÚY",
  "concepts": [
    {
      "name": "Cơ quan chuyên trách phòng, chống tội phạm về ma túy",
      "meaning": "Các cơ quan nhà nước được giao nhiệm vụ chính trong việc phòng ngừa, ngăn chặn và đấu tranh chống tội phạm liên quan đến ma túy.",
      "attrs": [
        "Thuộc Công an nhân dân",
        "Thuộc Bộ đội Biên phòng",
        "Thuộc Cảnh sát biển Việt Nam",
        "Thuộc Hải quan",
        "Có nhiệm vụ phòng ngừa, ngăn chặn, đấu tranh chống tội phạm về ma túy",
        "Có quyền hạn trong phạm vi nhiệm vụ được giao",
        "Phối hợp với các cơ quan, tổ chức liên quan"
      ],
      "keyphrases": [
        "Cơ quan chuyên trách phòng, chống tội phạm về ma túy",
        "phòng ngừa, ngăn chặn và đấu tranh chống tội phạm về ma túy"
      ],
      "similar": [
        "Cơ quan phòng chống ma túy"
      ]
    },
    {
      "name": "Phạm vi nhiệm vụ, quyền hạn",
      "meaning": "Giới hạn về công việc và quyền lực mà một cơ quan chuyên trách phòng, chống tội phạm về ma túy được phép thực hiện.",
      "attrs": [
        "Được quy định cụ thể cho từng cơ quan",
        "Liên quan đến địa bàn quản lý, kiểm soát",
        "Liên quan đến loại tội phạm ma túy"
      ],
      "keyphrases": [
        "phạm vi nhiệm vụ, quyền hạn"
      ],
      "similar": [
        "thẩm quyền",
        "giới hạn trách nhiệm"
      ]
    },
    {
      "name": "Hoạt động phòng ngừa, ngăn chặn và đấu tranh",
      "meaning": "Các biện pháp được thực hiện để ngăn chặn sự phát sinh và phát triển của tội phạm ma túy, cũng như các hành động để triệt phá các hoạt động phạm tội.",
      "attrs": [
        "Phòng ngừa tội phạm",
        "Ngăn chặn tội phạm",
        "Đấu tranh chống tội phạm"
      ],
      "keyphrases": [
        "phòng ngừa, ngăn chặn và đấu tranh"
      ],
      "similar": [
        "biện pháp nghiệp vụ",
        "hoạt động nghiệp vụ"
      ]
    },
    {
      "name": "Xử lý theo thẩm quyền",
      "meaning": "Việc giải quyết vụ việc vi phạm pháp luật theo đúng quyền hạn và trách nhiệm được pháp luật quy định cho cơ quan có thẩm quyền.",
      "attrs": [
        "Tuân thủ quy định pháp luật",
        "Đúng quyền hạn",
        "Đúng trách nhiệm"
      ],
      "keyphrases": [
        "xử lý theo thẩm quyền"
      ],
      "similar": [
        "giải quyết theo quy định",
        "xử lý đúng pháp luật"
      ]
    },
    {
      "name": "Chuyển giao hồ sơ, người, tang vật",
      "meaning": "Hành động chuyển giao toàn bộ thông tin, đối tượng và vật chứng liên quan đến vụ việc vi phạm pháp luật cho cơ quan có thẩm quyền giải quyết.",
      "attrs": [
        "Hồ sơ vụ việc",
        "Người vi phạm",
        "Tang vật vi phạm"
      ],
      "keyphrases": [
        "chuyển giao hồ sơ, người, tang vật"
      ],
      "similar": [
        "bàn giao vụ việc",
        "chuyển giao thẩm quyền"
      ]
    },
    {
      "name": "Phối hợp giữa các cơ quan chuyên trách",
      "meaning": "Sự hợp tác và chia sẻ thông tin, nguồn lực giữa các cơ quan chuyên trách phòng, chống tội phạm về ma túy để đạt hiệu quả cao nhất trong công tác.",
      "attrs": [
        "Hợp tác",
        "Chia sẻ thông tin",
        "Chia sẻ nguồn lực"
      ],
      "keyphrases": [
        "phối hợp của các cơ quan chuyên trách"
      ],
      "similar": [
        "hiệp đồng tác chiến",
        "liên kết nghiệp vụ"
      ]
    }
  ]
},
{
  "article_id": "article_12",
  "article_number": "12",
  "text": "Điều 12. Các hoạt động hợp pháp liên quan đến ma túy\n1. Hoạt động hợp pháp liên quan đến ma túy là hoạt động được cơ quan quản lý nhà nước có thẩm quyền cho phép, bao gồm:\na) Nghiên cứu, giám định, kiểm nghiệm, kiểm định, sản xuất chất ma túy (không bao gồm trồng cây có chứa chất ma túy), tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc và thuốc thú y có chứa chất ma túy, tiền chất;\nb) Vận chuyển, bảo quản, tồn trữ, mua bán, phân phối, sử dụng, xử lý, trao đổi chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc và thuốc thú y có chứa chất ma túy, tiền chất;\nc) Nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc và thuốc thú y có chứa chất ma túy, tiền chất.\n2. Hoạt động hợp pháp liên quan đến ma túy quy định tại khoản 1 Điều này được kiểm soát chặt chẽ theo quy định của Luật này và quy định khác của pháp luật có liên quan.",
  "concepts": [
    {
      "name": "Hoạt động hợp pháp liên quan đến ma túy",
      "meaning": "Các hoạt động liên quan đến ma túy được cơ quan quản lý nhà nước có thẩm quyền cho phép thực hiện.",
      "attrs": [
        "Được cơ quan quản lý nhà nước có thẩm quyền cho phép",
        "Được kiểm soát chặt chẽ theo quy định của Luật này và pháp luật liên quan"
      ],
      "keyphrases": [
        "hoạt động hợp pháp liên quan đến ma túy",
        "cơ quan quản lý nhà nước có thẩm quyền cho phép"
      ],
      "similar": [
        "Hoạt động được phép liên quan đến ma túy"
      ]
    },
    {
      "name": "Chất ma túy",
      "meaning": "Chất gây nghiện, chất hướng thần và tiền chất.",
      "attrs": [
        "Nghiên cứu, giám định, kiểm nghiệm, kiểm định, sản xuất",
        "Vận chuyển, bảo quản, tồn trữ, mua bán, phân phối, sử dụng, xử lý, trao đổi",
        "Nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh"
      ],
      "keyphrases": [
        "chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Tiền chất",
      "meaning": "Chất được sử dụng trong quá trình sản xuất chất ma túy.",
      "attrs": [
        "Nghiên cứu, giám định, kiểm nghiệm, kiểm định, sản xuất",
        "Vận chuyển, bảo quản, tồn trữ, mua bán, phân phối, sử dụng, xử lý, trao đổi",
        "Nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh"
      ],
      "keyphrases": [
        "tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Thuốc gây nghiện",
      "meaning": "Thuốc có chứa chất gây nghiện.",
      "attrs": [
        "Nghiên cứu, giám định, kiểm nghiệm, kiểm định, sản xuất",
        "Vận chuyển, bảo quản, tồn trữ, mua bán, phân phối, sử dụng, xử lý, trao đổi",
        "Nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh"
      ],
      "keyphrases": [
        "thuốc gây nghiện"
      ],
      "similar": []
    },
    {
      "name": "Thuốc hướng thần",
      "meaning": "Thuốc có tác động lên hệ thần kinh trung ương, gây ra thay đổi về tâm trạng, nhận thức, hành vi.",
      "attrs": [
        "Nghiên cứu, giám định, kiểm nghiệm, kiểm định, sản xuất",
        "Vận chuyển, bảo quản, tồn trữ, mua bán, phân phối, sử dụng, xử lý, trao đổi",
        "Nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh"
      ],
      "keyphrases": [
        "thuốc hướng thần"
      ],
      "similar": []
    },
    {
      "name": "Thuốc tiền chất",
      "meaning": "Thuốc có chứa tiền chất.",
      "attrs": [
        "Nghiên cứu, giám định, kiểm nghiệm, kiểm định, sản xuất",
        "Vận chuyển, bảo quản, tồn trữ, mua bán, phân phối, sử dụng, xử lý, trao đổi",
        "Nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh"
      ],
      "keyphrases": [
        "thuốc tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Nguyên liệu làm thuốc",
      "meaning": "Dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc và thuốc thú y có chứa chất ma túy, tiền chất.",
      "attrs": [
        "Nghiên cứu, giám định, kiểm nghiệm, kiểm định, sản xuất",
        "Vận chuyển, bảo quản, tồn trữ, mua bán, phân phối, sử dụng, xử lý, trao đổi",
        "Nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh"
      ],
      "keyphrases": [
        "nguyên liệu làm thuốc là dược chất gây nghiện",
        "dược chất hướng thần",
        "tiền chất dùng làm thuốc",
        "thuốc thú y có chứa chất ma túy, tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Cơ quan quản lý nhà nước có thẩm quyền",
      "meaning": "Cơ quan nhà nước được giao quyền hạn để quản lý các hoạt động liên quan đến ma túy.",
      "attrs": [
        "Cho phép hoạt động hợp pháp liên quan đến ma túy"
      ],
      "keyphrases": [
        "cơ quan quản lý nhà nước có thẩm quyền"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_13",
  "article_number": "13",
  "text": "Điều 13. Kiểm soát hoạt động nghiên cứu, giám định, sản xuất chất ma túy, tiền chất\n1. Hoạt động nghiên cứu, giám định, sản xuất chất ma túy (không bao gồm trồng cây có chứa chất ma túy), tiền chất phải được cơ quan nhà nước có thẩm quyền theo dõi, kiểm tra, giám sát.\n2. Chính phủ quy định cơ quan có thẩm quyền cho phép, trình tự, thủ tục cho phép, việc theo dõi, kiểm tra, giám sát quy định tại khoản 1 Điều này.",
  "concepts": [
    {
      "name": "Kiểm soát hoạt động nghiên cứu, giám định, sản xuất chất ma túy, tiền chất",
      "meaning": "Việc cơ quan nhà nước có thẩm quyền thực hiện theo dõi, kiểm tra, giám sát các hoạt động liên quan đến chất ma túy và tiền chất để đảm bảo tuân thủ quy định pháp luật.",
      "attrs": [
        "Theo dõi",
        "Kiểm tra",
        "Giám sát",
        "Cơ quan nhà nước có thẩm quyền"
      ],
      "keyphrases": [
        "Kiểm soát hoạt động",
        "Nghiên cứu",
        "Giám định",
        "Sản xuất",
        "Chất ma túy",
        "Tiền chất",
        "Theo dõi",
        "Kiểm tra",
        "Giám sát",
        "Cơ quan nhà nước có thẩm quyền"
      ],
      "similar": [
        "Quản lý hoạt động",
        "Giám sát hoạt động"
      ]
    },
    {
      "name": "Chất ma túy",
      "meaning": "Chất gây nghiện, chất hướng thần được quy định trong danh mục do cơ quan nhà nước có thẩm quyền ban hành.",
      "attrs": [
        "Gây nghiện",
        "Hướng thần",
        "Quy định trong danh mục"
      ],
      "keyphrases": [
        "Chất ma túy"
      ],
      "similar": [
        "Ma túy"
      ]
    },
    {
      "name": "Tiền chất",
      "meaning": "Chất hóa học được sử dụng trong quá trình sản xuất chất ma túy.",
      "attrs": [
        "Chất hóa học",
        "Sử dụng trong sản xuất chất ma túy"
      ],
      "keyphrases": [
        "Tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Cơ quan nhà nước có thẩm quyền",
      "meaning": "Cơ quan được nhà nước trao quyền để thực hiện các hoạt động theo dõi, kiểm tra, giám sát liên quan đến chất ma túy và tiền chất.",
      "attrs": [
        "Được nhà nước trao quyền",
        "Thực hiện theo dõi",
        "Thực hiện kiểm tra",
        "Thực hiện giám sát"
      ],
      "keyphrases": [
        "Cơ quan nhà nước có thẩm quyền"
      ],
      "similar": [
        "Cơ quan có thẩm quyền"
      ]
    },
    {
      "name": "Cho phép hoạt động",
      "meaning": "Việc cơ quan có thẩm quyền ra quyết định cho phép một tổ chức, cá nhân thực hiện các hoạt động nghiên cứu, giám định, sản xuất chất ma túy, tiền chất.",
      "attrs": [
        "Quyết định của cơ quan có thẩm quyền",
        "Cho phép thực hiện hoạt động",
        "Nghiên cứu, giám định, sản xuất chất ma túy, tiền chất"
      ],
      "keyphrases": [
        "Cho phép",
        "Trình tự, thủ tục cho phép"
      ],
      "similar": [
        "Cấp phép hoạt động"
      ]
    }
  ]
},
{
  "article_id": "article_14",
  "article_number": "14",
  "text": "Điều 14. Kiểm soát hoạt động vận chuyển chất ma túy, tiền chất\n1. Cơ quan, tổ chức, cá nhân đã được cơ quan nhà nước có thẩm quyền cho phép thì được vận chuyển chất ma túy, tiền chất; khi thực hiện việc vận chuyển phải đóng gói, niêm phong theo quy định của cơ quan có thẩm quyền; chịu trách nhiệm về số lượng, chất lượng, có biện pháp bảo vệ an toàn, không để bị thất thoát trong quá trình vận chuyển và chịu sự theo dõi, kiểm tra, giám sát của cơ quan nhà nước có thẩm quyền.\n2. Chính phủ quy định chi tiết Điều này.",
  "concepts": [
    {
      "name": "Vận chuyển chất ma túy, tiền chất",
      "meaning": "Hoạt động di chuyển chất ma túy, tiền chất từ địa điểm này đến địa điểm khác.",
      "attrs": [
        "Phải được cơ quan nhà nước có thẩm quyền cho phép",
        "Phải đóng gói, niêm phong theo quy định",
        "Phải đảm bảo số lượng, chất lượng",
        "Phải có biện pháp bảo vệ an toàn",
        "Không để bị thất thoát trong quá trình vận chuyển",
        "Chịu sự theo dõi, kiểm tra, giám sát của cơ quan nhà nước có thẩm quyền"
      ],
      "keyphrases": [
        "vận chuyển chất ma túy",
        "vận chuyển tiền chất",
        "trong quá trình vận chuyển"
      ],
      "similar": [
        "di chuyển chất ma túy, tiền chất"
      ]
    },
    {
      "name": "Cơ quan, tổ chức, cá nhân được phép vận chuyển",
      "meaning": "Chủ thể được cơ quan nhà nước có thẩm quyền cho phép thực hiện hoạt động vận chuyển chất ma túy, tiền chất.",
      "attrs": [
        "Đã được cơ quan nhà nước có thẩm quyền cho phép",
        "Chịu trách nhiệm về số lượng, chất lượng",
        "Phải tuân thủ quy định về đóng gói, niêm phong",
        "Phải đảm bảo an toàn, không để thất thoát",
        "Chịu sự theo dõi, kiểm tra, giám sát"
      ],
      "keyphrases": [
        "cơ quan, tổ chức, cá nhân",
        "được cơ quan nhà nước có thẩm quyền cho phép"
      ],
      "similar": [
        "chủ thể được phép vận chuyển"
      ]
    },
    {
      "name": "Trách nhiệm của chủ thể vận chuyển",
      "meaning": "Nghĩa vụ mà cơ quan, tổ chức, cá nhân được phép vận chuyển chất ma túy, tiền chất phải thực hiện.",
      "attrs": [
        "Đóng gói, niêm phong theo quy định",
        "Chịu trách nhiệm về số lượng, chất lượng",
        "Bảo vệ an toàn, không để thất thoát",
        "Chịu sự theo dõi, kiểm tra, giám sát"
      ],
      "keyphrases": [
        "chịu trách nhiệm về số lượng, chất lượng",
        "có biện pháp bảo vệ an toàn",
        "không để bị thất thoát",
        "chịu sự theo dõi, kiểm tra, giám sát"
      ],
      "similar": [
        "nghĩa vụ của người vận chuyển"
      ]
    },
    {
      "name": "Kiểm tra, giám sát của cơ quan nhà nước có thẩm quyền",
      "meaning": "Hoạt động của cơ quan nhà nước có thẩm quyền nhằm đảm bảo việc vận chuyển chất ma túy, tiền chất được thực hiện đúng quy định.",
      "attrs": [
        "Theo dõi",
        "Kiểm tra",
        "Giám sát"
      ],
      "keyphrases": [
        "theo dõi, kiểm tra, giám sát",
        "cơ quan nhà nước có thẩm quyền"
      ],
      "similar": [
        "giám sát vận chuyển",
        "kiểm soát vận chuyển"
      ]
    }
  ]
},
{
  "article_id": "article_15",
  "article_number": "15",
  "text": "Điều 15. Kiểm soát hoạt động liên quan đến thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc\nViệc kiểm soát hoạt động liên quan đến thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc thực hiện theo quy định của pháp luật về dược, trừ hoạt động quy định tại điểm b khoản 1 và khoản 2",
  "concepts": [
    {
      "name": "Kiểm soát hoạt động liên quan đến thuốc gây nghiện",
      "meaning": "Việc quản lý và giám sát các hoạt động liên quan đến thuốc gây nghiện để đảm bảo tuân thủ pháp luật.",
      "attrs": [
        "Phạm vi: Thuốc gây nghiện",
        "Mục đích: Đảm bảo tuân thủ pháp luật",
        "Cơ sở pháp lý: Pháp luật về dược"
      ],
      "keyphrases": [
        "kiểm soát hoạt động liên quan đến thuốc gây nghiện"
      ],
      "similar": [
        "Quản lý thuốc gây nghiện",
        "Giám sát hoạt động liên quan đến thuốc gây nghiện"
      ]
    },
    {
      "name": "Kiểm soát hoạt động liên quan đến thuốc hướng thần",
      "meaning": "Việc quản lý và giám sát các hoạt động liên quan đến thuốc hướng thần để đảm bảo tuân thủ pháp luật.",
      "attrs": [
        "Phạm vi: Thuốc hướng thần",
        "Mục đích: Đảm bảo tuân thủ pháp luật",
        "Cơ sở pháp lý: Pháp luật về dược"
      ],
      "keyphrases": [
        "kiểm soát hoạt động liên quan đến thuốc hướng thần"
      ],
      "similar": [
        "Quản lý thuốc hướng thần",
        "Giám sát hoạt động liên quan đến thuốc hướng thần"
      ]
    },
    {
      "name": "Kiểm soát hoạt động liên quan đến thuốc tiền chất",
      "meaning": "Việc quản lý và giám sát các hoạt động liên quan đến thuốc tiền chất để đảm bảo tuân thủ pháp luật.",
      "attrs": [
        "Phạm vi: Thuốc tiền chất",
        "Mục đích: Đảm bảo tuân thủ pháp luật",
        "Cơ sở pháp lý: Pháp luật về dược"
      ],
      "keyphrases": [
        "kiểm soát hoạt động liên quan đến thuốc tiền chất"
      ],
      "similar": [
        "Quản lý thuốc tiền chất",
        "Giám sát hoạt động liên quan đến thuốc tiền chất"
      ]
    },
    {
      "name": "Kiểm soát hoạt động liên quan đến nguyên liệu làm thuốc là dược chất gây nghiện",
      "meaning": "Việc quản lý và giám sát các hoạt động liên quan đến nguyên liệu làm thuốc là dược chất gây nghiện để đảm bảo tuân thủ pháp luật.",
      "attrs": [
        "Phạm vi: Nguyên liệu làm thuốc là dược chất gây nghiện",
        "Mục đích: Đảm bảo tuân thủ pháp luật",
        "Cơ sở pháp lý: Pháp luật về dược"
      ],
      "keyphrases": [
        "kiểm soát hoạt động liên quan đến nguyên liệu làm thuốc là dược chất gây nghiện"
      ],
      "similar": [
        "Quản lý nguyên liệu làm thuốc là dược chất gây nghiện",
        "Giám sát hoạt động liên quan đến nguyên liệu làm thuốc là dược chất gây nghiện"
      ]
    },
    {
      "name": "Kiểm soát hoạt động liên quan đến nguyên liệu làm thuốc là dược chất hướng thần",
      "meaning": "Việc quản lý và giám sát các hoạt động liên quan đến nguyên liệu làm thuốc là dược chất hướng thần để đảm bảo tuân thủ pháp luật.",
      "attrs": [
        "Phạm vi: Nguyên liệu làm thuốc là dược chất hướng thần",
        "Mục đích: Đảm bảo tuân thủ pháp luật",
        "Cơ sở pháp lý: Pháp luật về dược"
      ],
      "keyphrases": [
        "kiểm soát hoạt động liên quan đến nguyên liệu làm thuốc là dược chất hướng thần"
      ],
      "similar": [
        "Quản lý nguyên liệu làm thuốc là dược chất hướng thần",
        "Giám sát hoạt động liên quan đến nguyên liệu làm thuốc là dược chất hướng thần"
      ]
    },
    {
      "name": "Kiểm soát hoạt động liên quan đến nguyên liệu làm thuốc là tiền chất dùng làm thuốc",
      "meaning": "Việc quản lý và giám sát các hoạt động liên quan đến nguyên liệu làm thuốc là tiền chất dùng làm thuốc để đảm bảo tuân thủ pháp luật.",
      "attrs": [
        "Phạm vi: Nguyên liệu làm thuốc là tiền chất dùng làm thuốc",
        "Mục đích: Đảm bảo tuân thủ pháp luật",
        "Cơ sở pháp lý: Pháp luật về dược"
      ],
      "keyphrases": [
        "kiểm soát hoạt động liên quan đến nguyên liệu làm thuốc là tiền chất dùng làm thuốc"
      ],
      "similar": [
        "Quản lý nguyên liệu làm thuốc là tiền chất dùng làm thuốc",
        "Giám sát hoạt động liên quan đến nguyên liệu làm thuốc là tiền chất dùng làm thuốc"
      ]
    },
    {
      "name": "Pháp luật về dược",
      "meaning": "Hệ thống các quy định pháp luật điều chỉnh các hoạt động liên quan đến thuốc, bao gồm thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất và nguyên liệu làm thuốc.",
      "attrs": [
        "Phạm vi: Các hoạt động liên quan đến thuốc",
        "Chức năng: Điều chỉnh và quản lý"
      ],
      "keyphrases": [
        "pháp luật về dược"
      ],
      "similar": [
        "Quy định của pháp luật về dược",
        "Luật dược"
      ]
    }
  ]
},
{
  "article_id": "article_17",
  "article_number": "17",
  "text": "Điều 17 của Luật này.",
  "concepts": [
    {
      "name": "Điều luật",
      "meaning": "Một phần cụ thể của một văn bản luật, thường quy định về một vấn đề pháp lý cụ thể.",
      "attrs": [
        "Số điều",
        "Nội dung quy định",
        "Văn bản luật gốc"
      ],
      "keyphrases": [
        "Điều 17"
      ],
      "similar": [
        "Khoản",
        "Điểm"
      ]
    },
    {
      "name": "Luật",
      "meaning": "Một văn bản quy phạm pháp luật do cơ quan nhà nước có thẩm quyền ban hành, quy định các quy tắc xử sự chung, có tính bắt buộc thi hành đối với mọi đối tượng.",
      "attrs": [
        "Tên luật",
        "Cơ quan ban hành",
        "Hiệu lực thi hành"
      ],
      "keyphrases": [
        "Luật này"
      ],
      "similar": [
        "Văn bản quy phạm pháp luật",
        "Quy định pháp luật"
      ]
    }
  ]
},
{
  "article_id": "article_16",
  "article_number": "16",
  "text": "Điều 16. Kiểm soát hoạt động liên quan đến thuốc thú y có chứa chất ma túy, tiền chất\nViệc kiểm soát hoạt động liên quan đến thuốc thú y có chứa chất ma túy, tiền chất thực hiện theo quy định của Chính phủ.",
  "concepts": [
    {
      "name": "Kiểm soát hoạt động liên quan đến thuốc thú y có chứa chất ma túy, tiền chất",
      "meaning": "Việc quản lý và giám sát các hoạt động liên quan đến thuốc thú y có thành phần là chất ma túy hoặc tiền chất nhằm đảm bảo tuân thủ pháp luật và ngăn ngừa lạm dụng.",
      "attrs": [
        "Thuốc thú y",
        "Chất ma túy",
        "Tiền chất",
        "Hoạt động liên quan",
        "Quy định của Chính phủ"
      ],
      "keyphrases": [
        "Kiểm soát hoạt động liên quan đến thuốc thú y có chứa chất ma túy, tiền chất",
        "thuốc thú y có chứa chất ma túy, tiền chất",
        "quy định của Chính phủ"
      ],
      "similar": [
        "Quản lý thuốc thú y chứa chất ma túy, tiền chất",
        "Giám sát hoạt động liên quan đến thuốc thú y có chất gây nghiện"
      ]
    },
    {
      "name": "Thuốc thú y",
      "meaning": "Sản phẩm dùng để phòng bệnh, chữa bệnh, chẩn đoán bệnh hoặc điều chỉnh chức năng sinh lý của động vật.",
      "attrs": [
        "Phòng bệnh",
        "Chữa bệnh",
        "Chẩn đoán bệnh",
        "Điều chỉnh chức năng sinh lý",
        "Động vật"
      ],
      "keyphrases": [
        "thuốc thú y"
      ],
      "similar": [
        "Dược phẩm thú y",
        "Sản phẩm dùng cho động vật"
      ]
    },
    {
      "name": "Chất ma túy",
      "meaning": "Chất gây nghiện, chất hướng thần được quy định trong danh mục do Chính phủ ban hành.",
      "attrs": [
        "Gây nghiện",
        "Hướng thần",
        "Danh mục của Chính phủ"
      ],
      "keyphrases": [
        "chất ma túy"
      ],
      "similar": [
        "Chất gây nghiện",
        "Ma túy"
      ]
    },
    {
      "name": "Tiền chất",
      "meaning": "Các hóa chất không thể thiếu trong quá trình điều chế, sản xuất chất ma túy, được quy định trong danh mục do Chính phủ ban hành.",
      "attrs": [
        "Hóa chất",
        "Điều chế chất ma túy",
        "Sản xuất chất ma túy",
        "Danh mục của Chính phủ"
      ],
      "keyphrases": [
        "tiền chất"
      ],
      "similar": [
        "Hóa chất dùng để sản xuất ma túy"
      ]
    },
    {
      "name": "Quy định của Chính phủ",
      "meaning": "Các văn bản quy phạm pháp luật do Chính phủ ban hành để hướng dẫn chi tiết việc thực hiện các quy định của pháp luật.",
      "attrs": [
        "Văn bản quy phạm pháp luật",
        "Chính phủ ban hành",
        "Hướng dẫn chi tiết"
      ],
      "keyphrases": [
        "quy định của Chính phủ"
      ],
      "similar": [
        "Nghị định của Chính phủ",
        "Thông tư hướng dẫn của Chính phủ"
      ]
    }
  ]
},
{
  "article_id": "article_17",
  "article_number": "17",
  "text": "Điều 17. Kiểm soát hoạt động nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc\n1. Các hoạt động sau đây phải được cơ quan có thẩm quyền cho phép:\na) Nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập chất ma túy, tiền chất;\nb) Tạm nhập, tái xuất, tạm xuất, tái nhập thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc.\n2. Hoạt động quá cảnh lãnh thổ Việt Nam chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc phải theo đúng hành trình đã ghi trong giấy phép quá cảnh. Cơ quan, tổ chức thực hiện việc quá cảnh phải làm thủ tục, chịu sự kiểm soát của cơ quan Hải quan và cơ quan có thẩm quyền của Việt Nam.\n3. Chính phủ quy định chi tiết Điều này.",
  "concepts": [
    {
      "name": "Kiểm soát hoạt động nhập khẩu, xuất khẩu",
      "meaning": "Sự quản lý và giám sát của cơ quan nhà nước có thẩm quyền đối với các hoạt động đưa hàng hóa (chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc) từ nước ngoài vào Việt Nam (nhập khẩu) và từ Việt Nam ra nước ngoài (xuất khẩu).",
      "attrs": [
        "Phải được cơ quan có thẩm quyền cho phép",
        "Áp dụng với chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc"
      ],
      "keyphrases": [
        "Kiểm soát hoạt động nhập khẩu",
        "Kiểm soát hoạt động xuất khẩu",
        "Nhập khẩu",
        "Xuất khẩu"
      ],
      "similar": [
        "Quản lý hoạt động nhập khẩu, xuất khẩu",
        "Giám sát hoạt động nhập khẩu, xuất khẩu"
      ]
    },
    {
      "name": "Kiểm soát hoạt động tạm nhập, tái xuất",
      "meaning": "Sự quản lý và giám sát của cơ quan nhà nước có thẩm quyền đối với các hoạt động đưa hàng hóa (chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc) vào Việt Nam trong một thời gian nhất định (tạm nhập) và sau đó đưa trở lại nước ngoài (tái xuất).",
      "attrs": [
        "Phải được cơ quan có thẩm quyền cho phép",
        "Áp dụng với chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc"
      ],
      "keyphrases": [
        "Kiểm soát hoạt động tạm nhập",
        "Kiểm soát hoạt động tái xuất",
        "Tạm nhập",
        "Tái xuất"
      ],
      "similar": [
        "Quản lý hoạt động tạm nhập, tái xuất",
        "Giám sát hoạt động tạm nhập, tái xuất"
      ]
    },
    {
      "name": "Kiểm soát hoạt động tạm xuất, tái nhập",
      "meaning": "Sự quản lý và giám sát của cơ quan nhà nước có thẩm quyền đối với các hoạt động đưa hàng hóa (chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc) ra khỏi Việt Nam trong một thời gian nhất định (tạm xuất) và sau đó đưa trở lại Việt Nam (tái nhập).",
      "attrs": [
        "Phải được cơ quan có thẩm quyền cho phép",
        "Áp dụng với chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc"
      ],
      "keyphrases": [
        "Kiểm soát hoạt động tạm xuất",
        "Kiểm soát hoạt động tái nhập",
        "Tạm xuất",
        "Tái nhập"
      ],
      "similar": [
        "Quản lý hoạt động tạm xuất, tái nhập",
        "Giám sát hoạt động tạm xuất, tái nhập"
      ]
    },
    {
      "name": "Kiểm soát hoạt động quá cảnh",
      "meaning": "Sự quản lý và giám sát của cơ quan nhà nước có thẩm quyền đối với các hoạt động vận chuyển hàng hóa (chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc) đi qua lãnh thổ Việt Nam.",
      "attrs": [
        "Phải theo đúng hành trình đã ghi trong giấy phép quá cảnh",
        "Phải làm thủ tục, chịu sự kiểm soát của cơ quan Hải quan và cơ quan có thẩm quyền của Việt Nam",
        "Áp dụng với chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc"
      ],
      "keyphrases": [
        "Kiểm soát hoạt động quá cảnh",
        "Quá cảnh"
      ],
      "similar": [
        "Quản lý hoạt động quá cảnh",
        "Giám sát hoạt động quá cảnh"
      ]
    },
    {
      "name": "Chất ma túy",
      "meaning": "Các chất gây nghiện, chất hướng thần được quy định trong danh mục do cơ quan nhà nước có thẩm quyền ban hành.",
      "attrs": [],
      "keyphrases": [
        "chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Tiền chất",
      "meaning": "Các hóa chất được sử dụng làm nguyên liệu để sản xuất chất ma túy, được quy định trong danh mục do cơ quan nhà nước có thẩm quyền ban hành.",
      "attrs": [],
      "keyphrases": [
        "tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Thuốc gây nghiện",
      "meaning": "Các loại thuốc có chứa chất gây nghiện, được quy định trong danh mục do cơ quan nhà nước có thẩm quyền ban hành.",
      "attrs": [],
      "keyphrases": [
        "thuốc gây nghiện"
      ],
      "similar": []
    },
    {
      "name": "Thuốc hướng thần",
      "meaning": "Các loại thuốc có chứa chất hướng thần, được quy định trong danh mục do cơ quan nhà nước có thẩm quyền ban hành.",
      "attrs": [],
      "keyphrases": [
        "thuốc hướng thần"
      ],
      "similar": []
    },
    {
      "name": "Thuốc tiền chất",
      "meaning": "Các loại thuốc có chứa tiền chất, được quy định trong danh mục do cơ quan nhà nước có thẩm quyền ban hành.",
      "attrs": [],
      "keyphrases": [
        "thuốc tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc",
      "meaning": "Các dược chất gây nghiện, dược chất hướng thần, tiền chất được sử dụng làm nguyên liệu để sản xuất thuốc.",
      "attrs": [],
      "keyphrases": [
        "nguyên liệu làm thuốc là dược chất gây nghiện",
        "dược chất hướng thần",
        "tiền chất dùng làm thuốc"
      ],
      "similar": []
    },
    {
      "name": "Cơ quan có thẩm quyền",
      "meaning": "Cơ quan nhà nước được trao quyền thực hiện các hoạt động kiểm soát nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc.",
      "attrs": [],
      "keyphrases": [
        "cơ quan có thẩm quyền"
      ],
      "similar": []
    },
    {
      "name": "Giấy phép quá cảnh",
      "meaning": "Văn bản do cơ quan có thẩm quyền cấp cho phép thực hiện hoạt động quá cảnh hàng hóa qua lãnh thổ Việt Nam.",
      "attrs": [],
      "keyphrases": [
        "giấy phép quá cảnh"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_18",
  "article_number": "18",
  "text": "Điều 18. Lập hồ sơ các hoạt động hợp pháp liên quan đến ma túy\nCơ quan, tổ chức, cá nhân khi tiến hành hoạt động quy định tại khoản 1",
  "concepts": [
    {
      "name": "Hoạt động hợp pháp liên quan đến ma túy",
      "meaning": "Các hoạt động được pháp luật cho phép liên quan đến ma túy.",
      "attrs": [
        "Tính hợp pháp",
        "Liên quan đến ma túy"
      ],
      "keyphrases": [
        "hoạt động hợp pháp liên quan đến ma túy"
      ],
      "similar": [
        "Hoạt động được pháp luật cho phép về ma túy"
      ]
    },
    {
      "name": "Cơ quan, tổ chức, cá nhân",
      "meaning": "Các chủ thể có thể thực hiện các hoạt động hợp pháp liên quan đến ma túy.",
      "attrs": [
        "Chủ thể thực hiện hoạt động",
        "Có thể là cơ quan nhà nước, tổ chức hoặc cá nhân"
      ],
      "keyphrases": [
        "Cơ quan",
        "tổ chức",
        "cá nhân"
      ],
      "similar": [
        "Chủ thể"
      ]
    },
    {
      "name": "Lập hồ sơ",
      "meaning": "Việc ghi chép, thu thập và lưu trữ thông tin về các hoạt động hợp pháp liên quan đến ma túy.",
      "attrs": [
        "Ghi chép thông tin",
        "Thu thập thông tin",
        "Lưu trữ thông tin"
      ],
      "keyphrases": [
        "Lập hồ sơ"
      ],
      "similar": [
        "Ghi nhận",
        "Lưu trữ"
      ]
    }
  ]
},
{
  "article_id": "article_12",
  "article_number": "12",
  "text": "Điều 12 của Luật này có trách nhiệm lập hồ sơ và báo cáo theo quy định của Chính phủ.",
  "concepts": [
    {
      "name": "Trách nhiệm pháp lý",
      "meaning": "Nghĩa vụ mà một chủ thể phải thực hiện theo quy định của pháp luật.",
      "attrs": [
        "Bắt buộc",
        "Do pháp luật quy định",
        "Không thực hiện có thể bị xử lý"
      ],
      "keyphrases": [
        "có trách nhiệm"
      ],
      "similar": [
        "Nghĩa vụ pháp lý"
      ]
    },
    {
      "name": "Lập hồ sơ",
      "meaning": "Việc thu thập, sắp xếp, và hệ thống hóa các tài liệu, thông tin theo một trình tự nhất định.",
      "attrs": [
        "Thu thập tài liệu",
        "Sắp xếp tài liệu",
        "Hệ thống hóa thông tin"
      ],
      "keyphrases": [
        "lập hồ sơ"
      ],
      "similar": [
        "Soạn thảo hồ sơ",
        "Xây dựng hồ sơ"
      ]
    },
    {
      "name": "Báo cáo",
      "meaning": "Việc cung cấp thông tin, số liệu về một vấn đề cụ thể cho cơ quan nhà nước có thẩm quyền.",
      "attrs": [
        "Cung cấp thông tin",
        "Cung cấp số liệu",
        "Gửi đến cơ quan có thẩm quyền"
      ],
      "keyphrases": [
        "báo cáo"
      ],
      "similar": [
        "Trình báo",
        "Thông báo"
      ]
    },
    {
      "name": "Quy định của Chính phủ",
      "meaning": "Các văn bản quy phạm pháp luật do Chính phủ ban hành để hướng dẫn thi hành luật.",
      "attrs": [
        "Văn bản quy phạm pháp luật",
        "Do Chính phủ ban hành",
        "Hướng dẫn thi hành luật"
      ],
      "keyphrases": [
        "quy định của Chính phủ"
      ],
      "similar": [
        "Nghị định của Chính phủ",
        "Quy chế do Chính phủ ban hành"
      ]
    }
  ]
},
{
  "article_id": "article_19",
  "article_number": "19",
  "text": "Điều 19. Kiểm soát hoạt động hợp pháp liên quan đến ma túy vì mục đích quốc phòng, an ninh\nHoạt động nghiên cứu, giám định, sản xuất, vận chuyển, tồn trữ, bảo quản, sử dụng, nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc, thuốc thú y có chứa chất ma túy, tiền chất vì mục đích quốc phòng, an ninh thực hiện theo quy định của Chính phủ.",
  "concepts": [
    {
      "name": "Kiểm soát hoạt động hợp pháp liên quan đến ma túy",
      "meaning": "Việc quản lý và giám sát các hoạt động liên quan đến ma túy được pháp luật cho phép, nhằm đảm bảo tuân thủ quy định và ngăn chặn lạm dụng.",
      "attrs": [
        "hoạt động hợp pháp",
        "liên quan đến ma túy",
        "mục đích quốc phòng, an ninh"
      ],
      "keyphrases": [
        "Kiểm soát hoạt động hợp pháp liên quan đến ma túy",
        "mục đích quốc phòng, an ninh"
      ],
      "similar": [
        "Quản lý hoạt động ma túy hợp pháp",
        "Giám sát hoạt động liên quan đến ma túy"
      ]
    },
    {
      "name": "Hoạt động nghiên cứu, giám định, sản xuất, vận chuyển, tồn trữ, bảo quản, sử dụng, nhập khẩu, xuất khẩu, tạm nhập, tái xuất, tạm xuất, tái nhập, quá cảnh",
      "meaning": "Các hành vi cụ thể liên quan đến chất ma túy và tiền chất, bao gồm cả các hoạt động liên quan đến thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất và nguyên liệu làm thuốc.",
      "attrs": [
        "nghiên cứu",
        "giám định",
        "sản xuất",
        "vận chuyển",
        "tồn trữ",
        "bảo quản",
        "sử dụng",
        "nhập khẩu",
        "xuất khẩu",
        "tạm nhập",
        "tái xuất",
        "tạm xuất",
        "tái nhập",
        "quá cảnh"
      ],
      "keyphrases": [
        "nghiên cứu",
        "giám định",
        "sản xuất",
        "vận chuyển",
        "tồn trữ",
        "bảo quản",
        "sử dụng",
        "nhập khẩu",
        "xuất khẩu",
        "tạm nhập",
        "tái xuất",
        "tạm xuất",
        "tái nhập",
        "quá cảnh"
      ],
      "similar": [
        "Các hành vi liên quan đến ma túy",
        "Các hoạt động về ma túy và tiền chất"
      ]
    },
    {
      "name": "Chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc",
      "meaning": "Các loại chất và thuốc được kiểm soát đặc biệt do có khả năng gây nghiện hoặc ảnh hưởng đến thần kinh, bao gồm cả nguyên liệu để sản xuất các loại thuốc này.",
      "attrs": [
        "chất ma túy",
        "tiền chất",
        "thuốc gây nghiện",
        "thuốc hướng thần",
        "thuốc tiền chất",
        "nguyên liệu làm thuốc",
        "dược chất gây nghiện",
        "dược chất hướng thần",
        "tiền chất dùng làm thuốc",
        "thuốc thú y có chứa chất ma túy",
        "tiền chất"
      ],
      "keyphrases": [
        "chất ma túy",
        "tiền chất",
        "thuốc gây nghiện",
        "thuốc hướng thần",
        "thuốc tiền chất",
        "nguyên liệu làm thuốc",
        "dược chất gây nghiện",
        "dược chất hướng thần",
        "tiền chất dùng làm thuốc",
        "thuốc thú y có chứa chất ma túy",
        "tiền chất"
      ],
      "similar": [
        "Các chất bị kiểm soát",
        "Các loại thuốc gây nghiện"
      ]
    },
    {
      "name": "Quy định của Chính phủ",
      "meaning": "Các văn bản pháp luật do Chính phủ ban hành để hướng dẫn và chi tiết hóa việc thực hiện các quy định về kiểm soát hoạt động hợp pháp liên quan đến ma túy.",
      "attrs": [
        "văn bản pháp luật",
        "Chính phủ ban hành",
        "hướng dẫn thực hiện"
      ],
      "keyphrases": [
        "quy định của Chính phủ"
      ],
      "similar": [
        "Văn bản quy phạm pháp luật của Chính phủ",
        "Hướng dẫn của Chính phủ"
      ]
    }
  ]
},
{
  "article_id": "article_20",
  "article_number": "20",
  "text": "Điều 20. Kiểm soát thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất vì mục đích sơ cứu, cấp cứu trong cuộc hành trình, du lịch quốc tế, điều trị bệnh cho bản thân người nhập cảnh, xuất cảnh, quá cảnh\n1. Việc mang theo thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất dự phòng cho việc sơ cứu, cấp cứu trên tàu thủy, tàu bay, tàu hỏa, ô tô hoặc các phương tiện vận tải khác trong cuộc hành trình, du lịch quốc tế không bị coi là mang hàng xuất khẩu, nhập khẩu, quá cảnh lãnh thổ Việt Nam.\nNgười chỉ huy, người điều khiển phương tiện vận tải có trách nhiệm khai báo với cơ quan Hải quan của Việt Nam, giải trình về số lượng thuốc đã sử dụng, áp dụng các biện pháp an toàn thích hợp để ngăn chặn việc sử dụng không đúng mục đích hoặc vận chuyển trái phép các thuốc đó và chịu sự kiểm soát của cơ quan có thẩm quyền của Việt Nam.\n2. Việc mang theo thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất để điều trị bệnh cho bản thân người nhập cảnh, xuất cảnh hoặc quá cảnh lãnh thổ Việt Nam thực hiện theo quy định của Chính phủ và chịu sự kiểm soát của cơ quan có thẩm quyền của Việt Nam.",
  "concepts": [
    {
      "name": "Thuốc gây nghiện",
      "meaning": "Loại thuốc có khả năng gây nghiện cho người sử dụng, thuộc danh mục kiểm soát đặc biệt.",
      "attrs": [],
      "keyphrases": [
        "thuốc gây nghiện"
      ],
      "similar": []
    },
    {
      "name": "Thuốc hướng thần",
      "meaning": "Loại thuốc tác động lên hệ thần kinh trung ương, có thể gây ra ảo giác, thay đổi tâm trạng, hành vi và thuộc danh mục kiểm soát đặc biệt.",
      "attrs": [],
      "keyphrases": [
        "thuốc hướng thần"
      ],
      "similar": []
    },
    {
      "name": "Thuốc tiền chất",
      "meaning": "Loại hóa chất được sử dụng làm nguyên liệu để sản xuất thuốc gây nghiện, thuốc hướng thần và thuộc danh mục kiểm soát đặc biệt.",
      "attrs": [],
      "keyphrases": [
        "thuốc tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Sơ cứu, cấp cứu",
      "meaning": "Các biện pháp y tế ban đầu nhằm xử lý tình trạng khẩn cấp về sức khỏe, tính mạng.",
      "attrs": [],
      "keyphrases": [
        "sơ cứu",
        "cấp cứu"
      ],
      "similar": []
    },
    {
      "name": "Hành trình, du lịch quốc tế",
      "meaning": "Việc di chuyển, đi lại giữa các quốc gia khác nhau.",
      "attrs": [],
      "keyphrases": [
        "cuộc hành trình",
        "du lịch quốc tế"
      ],
      "similar": []
    },
    {
      "name": "Nhập cảnh",
      "meaning": "Việc một người nước ngoài hoặc người không có quốc tịch được phép vào lãnh thổ Việt Nam.",
      "attrs": [],
      "keyphrases": [
        "nhập cảnh"
      ],
      "similar": []
    },
    {
      "name": "Xuất cảnh",
      "meaning": "Việc một người Việt Nam hoặc người nước ngoài được phép rời khỏi lãnh thổ Việt Nam.",
      "attrs": [],
      "keyphrases": [
        "xuất cảnh"
      ],
      "similar": []
    },
    {
      "name": "Quá cảnh",
      "meaning": "Việc một người hoặc hàng hóa đi qua lãnh thổ Việt Nam để đến một quốc gia khác.",
      "attrs": [],
      "keyphrases": [
        "quá cảnh"
      ],
      "similar": []
    },
    {
      "name": "Phương tiện vận tải",
      "meaning": "Các loại phương tiện được sử dụng để vận chuyển người hoặc hàng hóa.",
      "attrs": [],
      "keyphrases": [
        "tàu thủy",
        "tàu bay",
        "tàu hỏa",
        "ô tô",
        "phương tiện vận tải"
      ],
      "similar": []
    },
    {
      "name": "Người chỉ huy, người điều khiển phương tiện vận tải",
      "meaning": "Cá nhân chịu trách nhiệm điều hành và kiểm soát phương tiện vận tải.",
      "attrs": [],
      "keyphrases": [
        "người chỉ huy",
        "người điều khiển phương tiện vận tải"
      ],
      "similar": []
    },
    {
      "name": "Cơ quan Hải quan của Việt Nam",
      "meaning": "Cơ quan nhà nước có thẩm quyền kiểm tra, giám sát hàng hóa, phương tiện vận tải xuất nhập khẩu, quá cảnh.",
      "attrs": [],
      "keyphrases": [
        "cơ quan Hải quan của Việt Nam"
      ],
      "similar": []
    },
    {
      "name": "Kiểm soát của cơ quan có thẩm quyền",
      "meaning": "Việc các cơ quan nhà nước có thẩm quyền thực hiện các biện pháp giám sát, kiểm tra để đảm bảo tuân thủ quy định pháp luật.",
      "attrs": [],
      "keyphrases": [
        "kiểm soát của cơ quan có thẩm quyền của Việt Nam"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_21",
  "article_number": "21",
  "text": "Điều 21. Xử lý chất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc, thuốc thú y có chứa chất ma túy, tiền chất thu giữ trong vụ việc vi phạm pháp luật\nChất ma túy, tiền chất, thuốc gây nghiện, thuốc hướng thần, thuốc tiền chất, nguyên liệu làm thuốc là dược chất gây nghiện, dược chất hướng thần, tiền chất dùng làm thuốc, thuốc thú y có chứa chất ma túy, tiền chất bị thu giữ trong các vụ án hình sự, vụ việc vi phạm hành chính được xử lý theo quy định của pháp luật về tố tụng hình sự, pháp luật về xử lý vi phạm hành chính.\nChương IV\nQUẢN LÝ NGƯỜI SỬ DỤNG TRÁI PHÉP CHẤT MA TÚY",
  "concepts": [
    {
      "name": "Chất ma túy",
      "meaning": "Các chất gây nghiện, bị cấm hoặc hạn chế sử dụng theo quy định của pháp luật.",
      "attrs": [],
      "keyphrases": [
        "chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Tiền chất",
      "meaning": "Các hóa chất được sử dụng để sản xuất chất ma túy.",
      "attrs": [],
      "keyphrases": [
        "tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Thuốc gây nghiện",
      "meaning": "Các loại thuốc có chứa chất gây nghiện, được kiểm soát chặt chẽ.",
      "attrs": [],
      "keyphrases": [
        "thuốc gây nghiện"
      ],
      "similar": []
    },
    {
      "name": "Thuốc hướng thần",
      "meaning": "Các loại thuốc tác động lên hệ thần kinh, có thể gây ra ảo giác hoặc thay đổi tâm trạng.",
      "attrs": [],
      "keyphrases": [
        "thuốc hướng thần"
      ],
      "similar": []
    },
    {
      "name": "Thuốc tiền chất",
      "meaning": "Các loại thuốc có chứa tiền chất, được kiểm soát chặt chẽ.",
      "attrs": [],
      "keyphrases": [
        "thuốc tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Nguyên liệu làm thuốc là dược chất gây nghiện",
      "meaning": "Các dược chất có khả năng gây nghiện được sử dụng làm nguyên liệu sản xuất thuốc.",
      "attrs": [],
      "keyphrases": [
        "nguyên liệu làm thuốc là dược chất gây nghiện"
      ],
      "similar": []
    },
    {
      "name": "Dược chất hướng thần",
      "meaning": "Các dược chất có tác động lên hệ thần kinh, có thể gây ra ảo giác hoặc thay đổi tâm trạng.",
      "attrs": [],
      "keyphrases": [
        "dược chất hướng thần"
      ],
      "similar": []
    },
    {
      "name": "Tiền chất dùng làm thuốc",
      "meaning": "Các tiền chất được sử dụng trong quá trình sản xuất thuốc.",
      "attrs": [],
      "keyphrases": [
        "tiền chất dùng làm thuốc"
      ],
      "similar": []
    },
    {
      "name": "Thuốc thú y có chứa chất ma túy, tiền chất",
      "meaning": "Các loại thuốc dùng cho động vật có chứa chất ma túy hoặc tiền chất.",
      "attrs": [],
      "keyphrases": [
        "thuốc thú y có chứa chất ma túy, tiền chất"
      ],
      "similar": []
    },
    {
      "name": "Vụ án hình sự",
      "meaning": "Các vụ việc vi phạm pháp luật hình sự, được xử lý theo quy định của pháp luật tố tụng hình sự.",
      "attrs": [],
      "keyphrases": [
        "vụ án hình sự"
      ],
      "similar": []
    },
    {
      "name": "Vụ việc vi phạm hành chính",
      "meaning": "Các vụ việc vi phạm các quy định của pháp luật hành chính, được xử lý theo quy định của pháp luật về xử lý vi phạm hành chính.",
      "attrs": [],
      "keyphrases": [
        "vụ việc vi phạm hành chính"
      ],
      "similar": []
    },
    {
      "name": "Xử lý theo quy định của pháp luật",
      "meaning": "Việc giải quyết, xử lý các đối tượng (chất ma túy, tiền chất,...) phải tuân thủ các quy định hiện hành của pháp luật.",
      "attrs": [],
      "keyphrases": [
        "xử lý theo quy định của pháp luật"
      ],
      "similar": []
    },
    {
      "name": "Pháp luật về tố tụng hình sự",
      "meaning": "Hệ thống các quy định pháp luật điều chỉnh trình tự, thủ tục giải quyết vụ án hình sự.",
      "attrs": [],
      "keyphrases": [
        "pháp luật về tố tụng hình sự"
      ],
      "similar": []
    },
    {
      "name": "Pháp luật về xử lý vi phạm hành chính",
      "meaning": "Hệ thống các quy định pháp luật điều chỉnh trình tự, thủ tục xử lý các hành vi vi phạm hành chính.",
      "attrs": [],
      "keyphrases": [
        "pháp luật về xử lý vi phạm hành chính"
      ],
      "similar": []
    },
    {
      "name": "Người sử dụng trái phép chất ma túy",
      "meaning": "Cá nhân sử dụng chất ma túy mà không được phép của pháp luật.",
      "attrs": [],
      "keyphrases": [
        "người sử dụng trái phép chất ma túy"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_22",
  "article_number": "22",
  "text": "Điều 22. Xét nghiệm chất ma túy trong cơ thể\n1. Xét nghiệm chất ma túy trong cơ thể được thực hiện đối với người thuộc trường hợp sau đây:\na) Người bị phát hiện sử dụng trái phép chất ma túy;\nb) Người mà cơ quan, người có thẩm quyền có căn cứ cho rằng có hành vi sử dụng trái phép chất ma túy;\nc) Người sử dụng trái phép chất ma túy đang trong thời hạn quản lý;\nd) Người đang trong thời gian bị áp dụng biện pháp xử lý hành chính giáo dục tại xã, phường, thị trấn do có hành vi sử dụng trái phép chất ma túy; đang cai nghiện ma túy; đang điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế; đang trong thời hạn quản lý sau cai nghiện ma túy.\n2. Người đứng đầu cơ sở cai nghiện ma túy, cơ sở điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế; người có thẩm quyền xử phạt vi phạm hành chính đối với hành vi sử dụng trái phép chất ma túy tiến hành xét nghiệm chất ma túy theo thẩm quyền hoặc đề nghị cơ quan, người có chuyên môn xét nghiệm chất ma túy trong cơ thể đối với các trường hợp quy định tại khoản 1 Điều này.\nTrường hợp có kết quả xét nghiệm dương tính thì gửi ngay kết quả đến Chủ tịch Ủy ban nhân dân cấp xã nơi người có kết quả xét nghiệm dương tính cư trú, trừ trường hợp người đó đang cai nghiện ma túy bắt buộc.\n3. Nhà nước bảo đảm kinh phí xét nghiệm chất ma túy trong cơ thể đối với các trường hợp quy định tại khoản 1 Điều này.",
  "concepts": [
    {
      "name": "Xét nghiệm chất ma túy trong cơ thể",
      "meaning": "Việc kiểm tra sự hiện diện của chất ma túy trong cơ thể người thông qua các phương pháp khoa học.",
      "attrs": [
        "Mục đích: Phát hiện người sử dụng trái phép chất ma túy",
        "Đối tượng: Người thuộc các trường hợp quy định tại khoản 1 Điều 22",
        "Thẩm quyền: Người đứng đầu cơ sở cai nghiện, cơ sở điều trị nghiện, người có thẩm quyền xử phạt vi phạm hành chính",
        "Kinh phí: Do Nhà nước bảo đảm"
      ],
      "keyphrases": [
        "Xét nghiệm chất ma túy trong cơ thể",
        "kết quả xét nghiệm dương tính"
      ],
      "similar": [
        "Kiểm tra ma túy",
        "Test ma túy"
      ]
    },
    {
      "name": "Người sử dụng trái phép chất ma túy",
      "meaning": "Người có hành vi sử dụng chất ma túy mà không được pháp luật cho phép.",
      "attrs": [
        "Đối tượng bị xét nghiệm chất ma túy",
        "Có thể đang trong thời hạn quản lý",
        "Có thể đang bị áp dụng biện pháp xử lý hành chính",
        "Có thể đang cai nghiện ma túy",
        "Có thể đang điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
        "Có thể đang trong thời hạn quản lý sau cai nghiện ma túy"
      ],
      "keyphrases": [
        "Người sử dụng trái phép chất ma túy",
        "hành vi sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "Người nghiện ma túy",
        "Người lạm dụng chất ma túy"
      ]
    },
    {
      "name": "Cơ sở cai nghiện ma túy",
      "meaning": "Cơ sở được thành lập để thực hiện việc cai nghiện ma túy cho người nghiện.",
      "attrs": [
        "Có người đứng đầu",
        "Thực hiện xét nghiệm chất ma túy theo thẩm quyền"
      ],
      "keyphrases": [
        "cơ sở cai nghiện ma túy"
      ],
      "similar": [
        "Trung tâm cai nghiện",
        "Cơ sở điều trị nghiện"
      ]
    },
    {
      "name": "Cơ sở điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
      "meaning": "Cơ sở y tế được phép sử dụng thuốc thay thế để điều trị cho người nghiện các chất dạng thuốc phiện.",
      "attrs": [
        "Có người đứng đầu",
        "Thực hiện xét nghiệm chất ma túy theo thẩm quyền"
      ],
      "keyphrases": [
        "cơ sở điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế"
      ],
      "similar": [
        "Cơ sở điều trị Methadone"
      ]
    },
    {
      "name": "Người có thẩm quyền xử phạt vi phạm hành chính đối với hành vi sử dụng trái phép chất ma túy",
      "meaning": "Cá nhân có quyền theo quy định của pháp luật để xử phạt các hành vi vi phạm hành chính liên quan đến việc sử dụng trái phép chất ma túy.",
      "attrs": [
        "Thực hiện xét nghiệm chất ma túy theo thẩm quyền"
      ],
      "keyphrases": [
        "người có thẩm quyền xử phạt vi phạm hành chính đối với hành vi sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "Người có thẩm quyền xử phạt hành chính về ma túy"
      ]
    },
    {
      "name": "Chủ tịch Ủy ban nhân dân cấp xã",
      "meaning": "Người đứng đầu Ủy ban nhân dân cấp xã, có trách nhiệm quản lý hành chính trên địa bàn xã.",
      "attrs": [
        "Nhận kết quả xét nghiệm dương tính (trừ trường hợp người đó đang cai nghiện ma túy bắt buộc)"
      ],
      "keyphrases": [
        "Chủ tịch Ủy ban nhân dân cấp xã"
      ],
      "similar": [
        "Chủ tịch UBND xã",
        "Người đứng đầu chính quyền cấp xã"
      ]
    }
  ]
},
{
  "article_id": "article_23",
  "article_number": "23",
  "text": "Điều 23. Quản lý người sử dụng trái phép chất ma túy\n1. Quản lý người sử dụng trái phép chất ma túy là biện pháp phòng ngừa nhằm giúp người sử dụng trái phép chất ma túy không tiếp tục sử dụng trái phép chất ma túy, phòng ngừa các hành vi vi phạm pháp luật của họ.\nQuản lý người sử dụng trái phép chất ma túy không phải là biện pháp xử lý hành chính.\n2. Thời hạn quản lý người sử dụng trái phép chất ma túy là 01 năm kể từ ngày Chủ tịch Ủy ban nhân dân cấp xã ra quyết định quản lý.\n3. Nội dung quản lý người sử dụng trái phép chất ma túy bao gồm:\na) Tư vấn, động viên, giáo dục, giúp đỡ người sử dụng trái phép chất ma túy để họ không tiếp tục sử dụng trái phép chất ma túy;\nb) Xét nghiệm chất ma túy trong cơ thể;\nc) Ngăn chặn người sử dụng trái phép chất ma túy có hành vi gây mất trật tự, an toàn xã hội.\n4. Trong thời hạn 03 ngày làm việc kể từ ngày nhận được kết quả xét nghiệm dương tính của người cư trú tại địa phương, Chủ tịch Ủy ban nhân dân cấp xã có trách nhiệm ra quyết định và tổ chức quản lý người sử dụng trái phép chất ma túy cư trú tại địa phương.\n5. Trong thời hạn quản lý, Chủ tịch Ủy ban nhân dân cấp xã ra quyết định dừng quản lý người sử dụng trái phép chất ma túy trong các trường hợp sau đây:\na) Người sử dụng trái phép chất ma túy được xác định là người nghiện ma túy;\nb) Người sử dụng trái phép chất ma túy bị áp dụng biện pháp xử lý hành chính giáo dục tại xã, phường, thị trấn do có hành vi sử dụng trái phép chất ma túy;\nc) Người sử dụng trái phép chất ma túy bị áp dụng biện pháp xử lý hành chính đưa vào cơ sở giáo dục bắt buộc, đưa vào trường giáo dưỡng;\nd) Người sử dụng trái phép chất ma túy phải thi hành án phạt tù;\nđ) Người sử dụng trái phép chất ma túy trong danh sách quản lý chết, bị Tòa án tuyên bố là mất tích.\n6. Chính phủ quy định chi tiết Điều này.",
  "concepts": [
    {
      "name": "Quản lý người sử dụng trái phép chất ma túy",
      "meaning": "Biện pháp phòng ngừa nhằm giúp người sử dụng trái phép chất ma túy không tiếp tục sử dụng trái phép chất ma túy và phòng ngừa các hành vi vi phạm pháp luật của họ.",
      "attrs": [
        "Biện pháp phòng ngừa",
        "Không phải biện pháp xử lý hành chính",
        "Mục đích: giúp người sử dụng trái phép chất ma túy không tiếp tục sử dụng",
        "Mục đích: phòng ngừa các hành vi vi phạm pháp luật"
      ],
      "keyphrases": [
        "Quản lý người sử dụng trái phép chất ma túy",
        "biện pháp phòng ngừa",
        "sử dụng trái phép chất ma túy",
        "hành vi vi phạm pháp luật",
        "không phải là biện pháp xử lý hành chính"
      ],
      "similar": []
    },
    {
      "name": "Thời hạn quản lý người sử dụng trái phép chất ma túy",
      "meaning": "Khoảng thời gian mà người sử dụng trái phép chất ma túy chịu sự quản lý theo quy định của pháp luật.",
      "attrs": [
        "01 năm",
        "Tính từ ngày Chủ tịch Ủy ban nhân dân cấp xã ra quyết định quản lý"
      ],
      "keyphrases": [
        "Thời hạn quản lý",
        "01 năm",
        "Chủ tịch Ủy ban nhân dân cấp xã",
        "quyết định quản lý"
      ],
      "similar": []
    },
    {
      "name": "Nội dung quản lý người sử dụng trái phép chất ma túy",
      "meaning": "Các hoạt động và biện pháp cụ thể được thực hiện trong quá trình quản lý người sử dụng trái phép chất ma túy.",
      "attrs": [
        "Tư vấn, động viên, giáo dục, giúp đỡ",
        "Xét nghiệm chất ma túy trong cơ thể",
        "Ngăn chặn hành vi gây mất trật tự, an toàn xã hội"
      ],
      "keyphrases": [
        "Nội dung quản lý",
        "Tư vấn",
        "động viên",
        "giáo dục",
        "giúp đỡ",
        "Xét nghiệm chất ma túy",
        "Ngăn chặn hành vi gây mất trật tự, an toàn xã hội"
      ],
      "similar": []
    },
    {
      "name": "Quyết định quản lý người sử dụng trái phép chất ma túy",
      "meaning": "Văn bản pháp lý do Chủ tịch Ủy ban nhân dân cấp xã ban hành để áp dụng biện pháp quản lý đối với người sử dụng trái phép chất ma túy.",
      "attrs": [
        "Do Chủ tịch Ủy ban nhân dân cấp xã ban hành",
        "Thời hạn ban hành: 03 ngày làm việc kể từ ngày nhận kết quả xét nghiệm dương tính",
        "Đối tượng: người cư trú tại địa phương"
      ],
      "keyphrases": [
        "quyết định",
        "Chủ tịch Ủy ban nhân dân cấp xã",
        "03 ngày làm việc",
        "kết quả xét nghiệm dương tính",
        "người cư trú tại địa phương"
      ],
      "similar": []
    },
    {
      "name": "Quyết định dừng quản lý người sử dụng trái phép chất ma túy",
      "meaning": "Văn bản pháp lý do Chủ tịch Ủy ban nhân dân cấp xã ban hành để chấm dứt việc áp dụng biện pháp quản lý đối với người sử dụng trái phép chất ma túy.",
      "attrs": [
        "Do Chủ tịch Ủy ban nhân dân cấp xã ban hành",
        "Ban hành trong thời hạn quản lý",
        "Các trường hợp dừng quản lý được quy định cụ thể"
      ],
      "keyphrases": [
        "quyết định dừng quản lý",
        "Chủ tịch Ủy ban nhân dân cấp xã",
        "trong thời hạn quản lý"
      ],
      "similar": []
    },
    {
      "name": "Người nghiện ma túy",
      "meaning": "Người sử dụng chất ma túy và bị lệ thuộc vào chất ma túy.",
      "attrs": [
        "Được xác định là người nghiện ma túy",
        "Là một trong các căn cứ để dừng quản lý người sử dụng trái phép chất ma túy"
      ],
      "keyphrases": [
        "người nghiện ma túy",
        "xác định là người nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Biện pháp xử lý hành chính giáo dục tại xã, phường, thị trấn",
      "meaning": "Một hình thức xử phạt hành chính áp dụng cho người có hành vi vi phạm pháp luật, được thực hiện tại cấp xã, phường, thị trấn.",
      "attrs": [
        "Áp dụng do có hành vi sử dụng trái phép chất ma túy",
        "Là một trong các căn cứ để dừng quản lý người sử dụng trái phép chất ma túy"
      ],
      "keyphrases": [
        "biện pháp xử lý hành chính giáo dục tại xã, phường, thị trấn",
        "hành vi sử dụng trái phép chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Biện pháp xử lý hành chính đưa vào cơ sở giáo dục bắt buộc, đưa vào trường giáo dưỡng",
      "meaning": "Các biện pháp xử lý hành chính áp dụng cho người vi phạm pháp luật, bằng cách đưa họ vào các cơ sở giáo dục bắt buộc hoặc trường giáo dưỡng.",
      "attrs": [
        "Là một trong các căn cứ để dừng quản lý người sử dụng trái phép chất ma túy"
      ],
      "keyphrases": [
        "biện pháp xử lý hành chính đưa vào cơ sở giáo dục bắt buộc",
        "biện pháp xử lý hành chính đưa vào trường giáo dưỡng"
      ],
      "similar": []
    },
    {
      "name": "Thi hành án phạt tù",
      "meaning": "Việc thực hiện bản án phạt tù đã có hiệu lực pháp luật đối với người phạm tội.",
      "attrs": [
        "Là một trong các căn cứ để dừng quản lý người sử dụng trái phép chất ma túy"
      ],
      "keyphrases": [
        "thi hành án phạt tù"
      ],
      "similar": []
    },
    {
      "name": "Tuyên bố mất tích",
      "meaning": "Việc Tòa án ra quyết định tuyên bố một người mất tích theo quy định của pháp luật.",
      "attrs": [
        "Do Tòa án tuyên bố",
        "Là một trong các căn cứ để dừng quản lý người sử dụng trái phép chất ma túy"
      ],
      "keyphrases": [
        "Tòa án tuyên bố là mất tích"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_24",
  "article_number": "24",
  "text": "Điều 24. Trách nhiệm của người sử dụng trái phép chất ma túy\n1. Cung cấp đầy đủ, chính xác thông tin về hành vi sử dụng trái phép chất ma túy của mình cho công an cấp xã nơi cư trú.\n2. Chấp hành việc quản lý của Ủy ban nhân dân cấp xã.",
  "concepts": [
    {
      "name": "Người sử dụng trái phép chất ma túy",
      "meaning": "Cá nhân thực hiện hành vi sử dụng chất ma túy mà không được pháp luật cho phép.",
      "attrs": [
        "Thực hiện hành vi sử dụng trái phép chất ma túy",
        "Cư trú tại một địa phương"
      ],
      "keyphrases": [
        "người sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "người nghiện ma túy (trong một số trường hợp)",
        "đối tượng sử dụng ma túy trái phép"
      ]
    },
    {
      "name": "Trách nhiệm cung cấp thông tin",
      "meaning": "Nghĩa vụ của người sử dụng trái phép chất ma túy phải khai báo đầy đủ và chính xác thông tin liên quan đến hành vi sử dụng trái phép chất ma túy của mình.",
      "attrs": [
        "Đầy đủ thông tin",
        "Chính xác thông tin",
        "Liên quan đến hành vi sử dụng trái phép chất ma túy"
      ],
      "keyphrases": [
        "cung cấp đầy đủ, chính xác thông tin",
        "hành vi sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "khai báo thông tin",
        "báo cáo hành vi sử dụng ma túy"
      ]
    },
    {
      "name": "Công an cấp xã nơi cư trú",
      "meaning": "Cơ quan công an có thẩm quyền quản lý hành chính trên địa bàn cấp xã nơi người sử dụng trái phép chất ma túy sinh sống.",
      "attrs": [
        "Cơ quan nhà nước",
        "Thuộc lực lượng công an",
        "Cấp hành chính: xã",
        "Địa bàn quản lý: nơi cư trú của người vi phạm"
      ],
      "keyphrases": [
        "công an cấp xã nơi cư trú"
      ],
      "similar": [
        "công an xã",
        "công an phường",
        "công an thị trấn"
      ]
    },
    {
      "name": "Trách nhiệm chấp hành quản lý",
      "meaning": "Nghĩa vụ của người sử dụng trái phép chất ma túy phải tuân thủ các biện pháp quản lý do Ủy ban nhân dân cấp xã áp dụng.",
      "attrs": [
        "Tuân thủ",
        "Chấp hành",
        "Biện pháp quản lý"
      ],
      "keyphrases": [
        "chấp hành việc quản lý"
      ],
      "similar": [
        "tuân thủ quản lý",
        "thực hiện các biện pháp quản lý"
      ]
    },
    {
      "name": "Ủy ban nhân dân cấp xã",
      "meaning": "Cơ quan hành chính nhà nước ở cấp xã, có thẩm quyền quản lý nhà nước trên địa bàn.",
      "attrs": [
        "Cơ quan nhà nước",
        "Cấp hành chính: xã",
        "Thẩm quyền quản lý nhà nước"
      ],
      "keyphrases": [
        "Ủy ban nhân dân cấp xã"
      ],
      "similar": [
        "UBND xã",
        "UBND phường",
        "UBND thị trấn"
      ]
    }
  ]
},
{
  "article_id": "article_25",
  "article_number": "25",
  "text": "Điều 25. Trách nhiệm của gia đình, cơ quan, tổ chức, cộng đồng trong quản lý người sử dụng trái phép chất ma túy\n1. Gia đình người sử dụng trái phép chất ma túy có trách nhiệm sau đây:\na) Quản lý, giáo dục người sử dụng trái phép chất ma túy; ngăn chặn hành vi sử dụng trái phép chất ma túy;\nb) Cung cấp thông tin về hành vi sử dụng trái phép chất ma túy của người sử dụng trái phép chất ma túy cho công an cấp xã nơi người đó cư trú;\nc) Ngăn chặn người sử dụng trái phép chất ma túy có hành vi gây mất trật tự, an toàn xã hội;\nd) Phối hợp với cơ quan có thẩm quyền đưa người sử dụng trái phép chất ma túy đi xét nghiệm chất ma túy trong cơ thể.\n2. Cơ quan, tổ chức nơi người sử dụng trái phép chất ma túy làm việc, cộng đồng nơi người sử dụng trái phép chất ma túy sinh sống có trách nhiệm sau đây:\na) Động viên, giúp đỡ, giáo dục người sử dụng trái phép chất ma túy; ngăn chặn hành vi sử dụng trái phép chất ma túy;\nb) Phối hợp với gia đình, cơ quan có thẩm quyền đưa người sử dụng trái phép chất ma túy đi xét nghiệm chất ma túy trong cơ thể.",
  "concepts": [
    {
      "name": "Người sử dụng trái phép chất ma túy",
      "meaning": "Chỉ cá nhân thực hiện hành vi sử dụng chất ma túy mà không được pháp luật cho phép.",
      "attrs": [],
      "keyphrases": [
        "người sử dụng trái phép chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Trách nhiệm của gia đình",
      "meaning": "Nghĩa vụ pháp lý mà gia đình của người sử dụng trái phép chất ma túy phải thực hiện để quản lý, giáo dục và ngăn chặn hành vi sử dụng trái phép chất ma túy.",
      "attrs": [
        "quản lý",
        "giáo dục",
        "ngăn chặn",
        "cung cấp thông tin",
        "phối hợp xét nghiệm"
      ],
      "keyphrases": [
        "trách nhiệm của gia đình",
        "quản lý, giáo dục người sử dụng trái phép chất ma túy",
        "ngăn chặn hành vi sử dụng trái phép chất ma túy",
        "cung cấp thông tin",
        "phối hợp với cơ quan có thẩm quyền đưa người sử dụng trái phép chất ma túy đi xét nghiệm chất ma túy trong cơ thể"
      ],
      "similar": []
    },
    {
      "name": "Trách nhiệm của cơ quan, tổ chức, cộng đồng",
      "meaning": "Nghĩa vụ pháp lý mà cơ quan, tổ chức nơi người sử dụng trái phép chất ma túy làm việc và cộng đồng nơi người đó sinh sống phải thực hiện để động viên, giúp đỡ, giáo dục và ngăn chặn hành vi sử dụng trái phép chất ma túy.",
      "attrs": [
        "động viên",
        "giúp đỡ",
        "giáo dục",
        "ngăn chặn",
        "phối hợp xét nghiệm"
      ],
      "keyphrases": [
        "trách nhiệm của cơ quan, tổ chức",
        "trách nhiệm của cộng đồng",
        "động viên, giúp đỡ, giáo dục người sử dụng trái phép chất ma túy",
        "ngăn chặn hành vi sử dụng trái phép chất ma túy",
        "phối hợp với gia đình, cơ quan có thẩm quyền đưa người sử dụng trái phép chất ma túy đi xét nghiệm chất ma túy trong cơ thể"
      ],
      "similar": []
    },
    {
      "name": "Công an cấp xã",
      "meaning": "Lực lượng công an hoạt động tại cấp xã, có thẩm quyền trong việc quản lý địa bàn và tiếp nhận thông tin liên quan đến người sử dụng trái phép chất ma túy.",
      "attrs": [],
      "keyphrases": [
        "công an cấp xã"
      ],
      "similar": []
    },
    {
      "name": "Xét nghiệm chất ma túy trong cơ thể",
      "meaning": "Thủ tục kiểm tra y tế để xác định sự hiện diện của chất ma túy trong cơ thể người.",
      "attrs": [],
      "keyphrases": [
        "xét nghiệm chất ma túy trong cơ thể"
      ],
      "similar": []
    },
    {
      "name": "Gây mất trật tự, an toàn xã hội",
      "meaning": "Hành vi của người sử dụng trái phép chất ma túy gây ảnh hưởng xấu đến trật tự công cộng và an toàn của xã hội.",
      "attrs": [],
      "keyphrases": [
        "gây mất trật tự, an toàn xã hội"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_26",
  "article_number": "26",
  "text": "Điều 26. Lập danh sách người sử dụng trái phép chất ma túy\n1. Công an cấp xã giúp Ủy ban nhân dân cùng cấp lập danh sách người sử dụng trái phép chất ma túy cư trú tại địa phương.\n2. Khi người sử dụng trái phép chất ma túy thay đổi nơi cư trú thì công an cấp xã nơi chuyển đi có trách nhiệm thông báo cho công an cấp xã nơi chuyển đến trong thời hạn 05 ngày làm việc kể từ ngày người đó chuyển khỏi địa phương để đưa vào danh sách và tiếp tục quản lý.\n3. Công an cấp xã giúp Ủy ban nhân dân cùng cấp đưa ra khỏi danh sách người sử dụng trái phép chất ma túy trong các trường hợp sau đây:\na) Người sử dụng trái phép chất ma túy không có hành vi sử dụng trái phép chất ma túy trong thời gian quản lý quy định tại khoản 2",
  "concepts": [
    {
      "name": "Danh sách người sử dụng trái phép chất ma túy",
      "meaning": "Danh sách bao gồm những cá nhân cư trú tại địa phương có hành vi sử dụng trái phép chất ma túy, được lập và quản lý bởi cơ quan có thẩm quyền.",
      "attrs": [
        "được lập bởi Công an cấp xã giúp Ủy ban nhân dân cùng cấp",
        "chứa thông tin người sử dụng trái phép chất ma túy",
        "được cập nhật khi người sử dụng thay đổi nơi cư trú",
        "được loại bỏ khi người sử dụng không có hành vi sử dụng trái phép chất ma túy trong thời gian quản lý"
      ],
      "keyphrases": [
        "danh sách người sử dụng trái phép chất ma túy",
        "lập danh sách",
        "đưa vào danh sách",
        "đưa ra khỏi danh sách"
      ],
      "similar": []
    },
    {
      "name": "Người sử dụng trái phép chất ma túy",
      "meaning": "Cá nhân có hành vi sử dụng chất ma túy mà không được pháp luật cho phép.",
      "attrs": [
        "cư trú tại địa phương",
        "có hành vi sử dụng trái phép chất ma túy",
        "được đưa vào danh sách",
        "được quản lý"
      ],
      "keyphrases": [
        "người sử dụng trái phép chất ma túy",
        "sử dụng trái phép chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Công an cấp xã",
      "meaning": "Cơ quan công an hoạt động tại cấp xã, có trách nhiệm hỗ trợ Ủy ban nhân dân cùng cấp trong việc quản lý người sử dụng trái phép chất ma túy.",
      "attrs": [
        "giúp Ủy ban nhân dân cùng cấp",
        "lập danh sách",
        "thông báo khi người sử dụng thay đổi nơi cư trú",
        "đưa ra khỏi danh sách"
      ],
      "keyphrases": [
        "Công an cấp xã"
      ],
      "similar": []
    },
    {
      "name": "Ủy ban nhân dân cấp xã",
      "meaning": "Cơ quan hành chính nhà nước ở cấp xã, có trách nhiệm quản lý người sử dụng trái phép chất ma túy trên địa bàn.",
      "attrs": [
        "cùng cấp với Công an cấp xã",
        "được Công an cấp xã giúp đỡ",
        "lập danh sách",
        "đưa ra khỏi danh sách"
      ],
      "keyphrases": [
        "Ủy ban nhân dân cùng cấp"
      ],
      "similar": []
    },
    {
      "name": "Nơi cư trú",
      "meaning": "Địa điểm mà một người sinh sống và làm việc thường xuyên.",
      "attrs": [
        "thay đổi nơi cư trú",
        "nơi chuyển đi",
        "nơi chuyển đến"
      ],
      "keyphrases": [
        "nơi cư trú",
        "nơi chuyển đi",
        "nơi chuyển đến"
      ],
      "similar": []
    },
    {
      "name": "Thời hạn thông báo",
      "meaning": "Khoảng thời gian quy định để công an cấp xã nơi chuyển đi thông báo cho công an cấp xã nơi chuyển đến về việc người sử dụng trái phép chất ma túy thay đổi nơi cư trú.",
      "attrs": [
        "05 ngày làm việc",
        "kể từ ngày người đó chuyển khỏi địa phương"
      ],
      "keyphrases": [
        "thời hạn 05 ngày làm việc"
      ],
      "similar": []
    },
    {
      "name": "Quản lý người sử dụng trái phép chất ma túy",
      "meaning": "Các biện pháp được thực hiện để theo dõi, giám sát và hỗ trợ người sử dụng trái phép chất ma túy nhằm giúp họ từ bỏ việc sử dụng chất ma túy.",
      "attrs": [
        "tiếp tục quản lý",
        "thời gian quản lý"
      ],
      "keyphrases": [
        "tiếp tục quản lý",
        "thời gian quản lý"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_23",
  "article_number": "23",
  "text": "Điều 23 của Luật này;\nb) Người sử dụng trái phép chất ma túy thuộc trường hợp dừng quản lý quy định tại khoản 5",
  "concepts": [
    {
      "name": "Luật",
      "meaning": "Một hệ thống các quy tắc và quy định được thiết lập và thực thi bởi một cơ quan có thẩm quyền để điều chỉnh hành vi của các cá nhân và tổ chức trong một xã hội.",
      "attrs": [],
      "keyphrases": [
        "Luật này"
      ],
      "similar": []
    },
    {
      "name": "Người sử dụng trái phép chất ma túy",
      "meaning": "Cá nhân sử dụng chất ma túy mà không được phép theo quy định của pháp luật.",
      "attrs": [
        "Sử dụng chất ma túy",
        "Không được phép"
      ],
      "keyphrases": [
        "Người sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "Người nghiện ma túy (có thể)",
        "Đối tượng sử dụng ma túy"
      ]
    },
    {
      "name": "Quản lý người sử dụng trái phép chất ma túy",
      "meaning": "Các biện pháp hành chính hoặc hình sự áp dụng đối với người sử dụng trái phép chất ma túy nhằm kiểm soát và hỗ trợ họ cai nghiện.",
      "attrs": [
        "Biện pháp hành chính",
        "Biện pháp hình sự",
        "Kiểm soát",
        "Hỗ trợ cai nghiện"
      ],
      "keyphrases": [
        "quản lý"
      ],
      "similar": [
        "Theo dõi người sử dụng ma túy",
        "Giám sát người nghiện ma túy"
      ]
    },
    {
      "name": "Dừng quản lý",
      "meaning": "Việc chấm dứt áp dụng các biện pháp quản lý đối với người sử dụng trái phép chất ma túy khi đáp ứng các điều kiện nhất định.",
      "attrs": [
        "Chấm dứt biện pháp quản lý",
        "Đáp ứng điều kiện"
      ],
      "keyphrases": [
        "dừng quản lý"
      ],
      "similar": [
        "Miễn quản lý",
        "Kết thúc quản lý"
      ]
    },
    {
      "name": "Khoản 5",
      "meaning": "Một phần cụ thể trong một điều luật, thường quy định chi tiết hoặc ngoại lệ cho quy định chung của điều luật đó.",
      "attrs": [
        "Vị trí trong văn bản luật",
        "Quy định chi tiết"
      ],
      "keyphrases": [
        "khoản 5"
      ],
      "similar": [
        "Điểm",
        "Điều"
      ]
    }
  ]
},
{
  "article_id": "article_23",
  "article_number": "23",
  "text": "Điều 23 của Luật này;\nc) Người sử dụng trái phép chất ma túy chuyển đến cư trú ở địa phương khác.\nChương V\nCAI NGHIỆN MA TÚY",
  "concepts": [
    {
      "name": "Luật",
      "meaning": "Một hệ thống các quy tắc và quy định được thiết lập và thực thi bởi một cơ quan có thẩm quyền để điều chỉnh hành vi của các cá nhân và tổ chức trong một xã hội.",
      "attrs": [],
      "keyphrases": [
        "Luật này"
      ],
      "similar": []
    },
    {
      "name": "Người sử dụng trái phép chất ma túy",
      "meaning": "Cá nhân sử dụng chất ma túy mà không được phép của pháp luật.",
      "attrs": [
        "Sử dụng chất ma túy",
        "Không được phép của pháp luật"
      ],
      "keyphrases": [
        "Người sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "Người nghiện ma túy (trong một số ngữ cảnh)"
      ]
    },
    {
      "name": "Cư trú",
      "meaning": "Việc một người sinh sống và có mặt thường xuyên tại một địa điểm cụ thể.",
      "attrs": [
        "Địa điểm sinh sống",
        "Tính thường xuyên"
      ],
      "keyphrases": [
        "cư trú"
      ],
      "similar": [
        "Nơi ở",
        "Thường trú"
      ]
    },
    {
      "name": "Địa phương khác",
      "meaning": "Một khu vực hành chính hoặc địa lý khác với nơi người đó đang cư trú.",
      "attrs": [
        "Khu vực hành chính",
        "Địa lý"
      ],
      "keyphrases": [
        "địa phương khác"
      ],
      "similar": [
        "Vùng khác",
        "Tỉnh/Thành phố khác"
      ]
    },
    {
      "name": "Cai nghiện ma túy",
      "meaning": "Quá trình điều trị và phục hồi cho người nghiện ma túy, nhằm giúp họ từ bỏ việc sử dụng chất ma túy.",
      "attrs": [
        "Điều trị",
        "Phục hồi",
        "Từ bỏ sử dụng ma túy"
      ],
      "keyphrases": [
        "CAI NGHIỆN MA TÚY"
      ],
      "similar": [
        "Chữa trị nghiện ma túy",
        "Phục hồi chức năng cho người nghiện ma túy"
      ]
    }
  ]
},
{
  "article_id": "article_27",
  "article_number": "27",
  "text": "Điều 27. Xác định tình trạng nghiện ma túy\n1. Xác định tình trạng nghiện ma túy được thực hiện đối với người thuộc trường hợp sau đây:\na) Người sử dụng trái phép chất ma túy đang trong thời gian quản lý bị phát hiện sử dụng trái phép chất ma túy;\nb) Người sử dụng trái phép chất ma túy không có nơi cư trú ổn định;\nc) Người đang trong thời gian bị áp dụng biện pháp xử lý hành chính giáo dục tại xã, phường, thị trấn do có hành vi sử dụng trái phép chất ma túy hoặc trong thời hạn 01 năm kể từ ngày chấp hành xong biện pháp xử lý hành chính giáo dục tại xã, phường, thị trấn do có hành vi sử dụng trái phép chất ma túy mà bị phát hiện sử dụng trái phép chất ma túy;\nd) Người đang trong thời gian quản lý sau cai nghiện ma túy bị phát hiện sử dụng trái phép chất ma túy;\nđ) Người tự nguyện xác định tình trạng nghiện ma túy.\n2. Công an cấp xã nơi phát hiện người thuộc trường hợp quy định tại các điểm a, b, c và d khoản 1 Điều này lập hồ sơ đề nghị cơ sở y tế có thẩm quyền xác định tình trạng nghiện ma túy.\n3. Trường hợp công an cấp huyện, công an cấp tỉnh trực tiếp phát hiện hoặc trong quá trình điều tra, thụ lý các vụ việc vi phạm pháp luật mà phát hiện trường hợp quy định tại các điểm a, b, c và d khoản 1 Điều này thì cơ quan công an đang thụ lý lập hồ sơ đề nghị cơ sở y tế có thẩm quyền xác định tình trạng nghiện ma túy.\n4. Khi có kết quả xác định tình trạng nghiện ma túy, cơ sở y tế có trách nhiệm gửi ngay kết quả đến cơ quan đề nghị, người được xác định tình trạng nghiện ma túy.\n5. Người được đề nghị xác định tình trạng nghiện ma túy có quyền và trách nhiệm sau đây:\na) Được bảo đảm danh dự, nhân phẩm; hỗ trợ đi lại, ăn ở, điều trị hội chứng cai và các bệnh kèm theo trong thời gian xác định tình trạng nghiện ma túy;\nb) Chấp hành nội quy, quy chế của cơ sở xác định tình trạng nghiện ma túy; khai báo trung thực với nhân viên y tế về tiền sử sử dụng ma túy, các biểu hiện của việc sử dụng ma túy;\nc) Người từ đủ 18 tuổi trở lên hoặc cha, mẹ, người giám hộ hoặc người đại diện hợp pháp của người từ đủ 12 tuổi đến dưới 18 tuổi quy định tại các điểm a, b, c và đ khoản 1 Điều này khi nhận được kết quả xác định là nghiện ma túy có trách nhiệm đăng ký cai nghiện ma túy tự nguyện theo quy định tại",
  "concepts": [
    {
      "name": "Xác định tình trạng nghiện ma túy",
      "meaning": "Quy trình pháp lý để xác định một người có nghiện ma túy hay không, dựa trên các dấu hiệu và tiêu chí nhất định.",
      "attrs": [
        "Được thực hiện đối với người sử dụng trái phép chất ma túy trong các trường hợp cụ thể",
        "Do cơ sở y tế có thẩm quyền thực hiện",
        "Dựa trên hồ sơ đề nghị từ cơ quan công an hoặc người tự nguyện"
      ],
      "keyphrases": [
        "xác định tình trạng nghiện ma túy",
        "người sử dụng trái phép chất ma túy",
        "cơ sở y tế có thẩm quyền",
        "hồ sơ đề nghị"
      ],
      "similar": [
        "đánh giá tình trạng nghiện",
        "giám định nghiện ma túy"
      ]
    },
    {
      "name": "Người sử dụng trái phép chất ma túy",
      "meaning": "Người sử dụng các chất ma túy mà không được pháp luật cho phép.",
      "attrs": [
        "Đang trong thời gian quản lý",
        "Không có nơi cư trú ổn định",
        "Đang trong thời gian áp dụng biện pháp xử lý hành chính",
        "Đang trong thời gian quản lý sau cai nghiện"
      ],
      "keyphrases": [
        "người sử dụng trái phép chất ma túy",
        "sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "người nghiện ma túy",
        "người lạm dụng ma túy"
      ]
    },
    {
      "name": "Hồ sơ đề nghị xác định tình trạng nghiện ma túy",
      "meaning": "Tập hợp các tài liệu cần thiết để yêu cầu cơ sở y tế có thẩm quyền tiến hành xác định tình trạng nghiện ma túy.",
      "attrs": [
        "Do công an cấp xã, huyện, tỉnh lập",
        "Chứa thông tin về người sử dụng trái phép chất ma túy"
      ],
      "keyphrases": [
        "hồ sơ đề nghị",
        "lập hồ sơ"
      ],
      "similar": [
        "tài liệu yêu cầu xác định nghiện",
        "hồ sơ giám định nghiện"
      ]
    },
    {
      "name": "Cơ sở y tế có thẩm quyền",
      "meaning": "Cơ sở y tế được pháp luật cho phép thực hiện việc xác định tình trạng nghiện ma túy.",
      "attrs": [
        "Có trách nhiệm xác định tình trạng nghiện ma túy",
        "Gửi kết quả đến cơ quan đề nghị và người được xác định"
      ],
      "keyphrases": [
        "cơ sở y tế có thẩm quyền",
        "kết quả xác định tình trạng nghiện ma túy"
      ],
      "similar": [
        "cơ sở giám định nghiện",
        "trung tâm y tế được phép xác định nghiện"
      ]
    },
    {
      "name": "Quản lý sau cai nghiện ma túy",
      "meaning": "Giai đoạn sau khi người nghiện ma túy đã hoàn thành quá trình cai nghiện, nhằm giúp họ duy trì trạng thái không sử dụng ma túy và tái hòa nhập cộng đồng.",
      "attrs": [
        "Thời gian quản lý sau cai nghiện",
        "Phát hiện sử dụng trái phép chất ma túy trong thời gian này"
      ],
      "keyphrases": [
        "quản lý sau cai nghiện ma túy"
      ],
      "similar": [
        "giai đoạn hậu cai nghiện",
        "tái hòa nhập cộng đồng sau cai nghiện"
      ]
    },
    {
      "name": "Đăng ký cai nghiện ma túy tự nguyện",
      "meaning": "Việc người nghiện ma túy hoặc người đại diện hợp pháp của họ đăng ký tham gia chương trình cai nghiện một cách tự nguyện.",
      "attrs": [
        "Trách nhiệm của người nghiện hoặc người đại diện khi nhận được kết quả xác định là nghiện ma túy",
        "Thực hiện theo quy định của pháp luật"
      ],
      "keyphrases": [
        "đăng ký cai nghiện ma túy tự nguyện"
      ],
      "similar": [
        "tự nguyện tham gia cai nghiện",
        "đăng ký điều trị nghiện tự nguyện"
      ]
    }
  ]
},
{
  "article_id": "article_28",
  "article_number": "28",
  "text": "Điều 28 của Luật này hoặc đăng ký điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế trong trường hợp nghiện các chất dạng thuốc phiện với Ủy ban nhân dân cấp xã nơi cư trú.\n6. Chính phủ quy định cơ sở y tế đủ điều kiện xác định tình trạng nghiện ma túy; hồ sơ, trình tự, thủ tục xác định tình trạng nghiện ma túy.\n7. Bộ trưởng Bộ Y tế quy định tiêu chuẩn chẩn đoán và quy trình chuyên môn để xác định tình trạng nghiện ma túy.\n8. Nhà nước bảo đảm kinh phí xác định tình trạng nghiện ma túy đối với trường hợp quy định tại các điểm a, b, c và d khoản 1 Điều này.",
  "concepts": [
    {
      "name": "Đăng ký điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
      "meaning": "Việc cá nhân nghiện các chất dạng thuốc phiện đăng ký để được điều trị bằng thuốc thay thế tại cơ quan có thẩm quyền.",
      "attrs": [
        "Đối tượng: Người nghiện các chất dạng thuốc phiện",
        "Hình thức: Điều trị bằng thuốc thay thế",
        "Địa điểm đăng ký: Ủy ban nhân dân cấp xã nơi cư trú"
      ],
      "keyphrases": [
        "đăng ký điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
        "nghiện các chất dạng thuốc phiện",
        "Ủy ban nhân dân cấp xã nơi cư trú"
      ],
      "similar": [
        "Điều trị thay thế nghiện chất dạng thuốc phiện"
      ]
    },
    {
      "name": "Cơ sở y tế đủ điều kiện xác định tình trạng nghiện ma túy",
      "meaning": "Các cơ sở y tế đáp ứng các tiêu chuẩn do Chính phủ quy định để thực hiện việc xác định tình trạng nghiện ma túy.",
      "attrs": [
        "Tiêu chuẩn: Do Chính phủ quy định",
        "Chức năng: Xác định tình trạng nghiện ma túy"
      ],
      "keyphrases": [
        "cơ sở y tế đủ điều kiện xác định tình trạng nghiện ma túy"
      ],
      "similar": [
        "Cơ sở xác định nghiện ma túy"
      ]
    },
    {
      "name": "Hồ sơ, trình tự, thủ tục xác định tình trạng nghiện ma túy",
      "meaning": "Quy trình và các giấy tờ cần thiết để thực hiện việc xác định tình trạng nghiện ma túy, do Chính phủ quy định.",
      "attrs": [
        "Quy định: Do Chính phủ quy định",
        "Nội dung: Hồ sơ, trình tự, thủ tục"
      ],
      "keyphrases": [
        "hồ sơ, trình tự, thủ tục xác định tình trạng nghiện ma túy"
      ],
      "similar": [
        "Quy trình xác định nghiện ma túy"
      ]
    },
    {
      "name": "Tiêu chuẩn chẩn đoán và quy trình chuyên môn để xác định tình trạng nghiện ma túy",
      "meaning": "Các tiêu chí và quy trình chuyên môn do Bộ trưởng Bộ Y tế quy định để chẩn đoán và xác định tình trạng nghiện ma túy.",
      "attrs": [
        "Quy định: Do Bộ trưởng Bộ Y tế quy định",
        "Nội dung: Tiêu chuẩn chẩn đoán, quy trình chuyên môn"
      ],
      "keyphrases": [
        "tiêu chuẩn chẩn đoán",
        "quy trình chuyên môn",
        "xác định tình trạng nghiện ma túy"
      ],
      "similar": [
        "Quy trình chẩn đoán nghiện ma túy"
      ]
    },
    {
      "name": "Kinh phí xác định tình trạng nghiện ma túy",
      "meaning": "Nguồn tài chính do Nhà nước đảm bảo để chi trả cho việc xác định tình trạng nghiện ma túy trong một số trường hợp cụ thể.",
      "attrs": [
        "Nguồn: Nhà nước bảo đảm",
        "Mục đích: Chi trả cho việc xác định tình trạng nghiện ma túy",
        "Đối tượng: Các trường hợp quy định tại các điểm a, b, c và d khoản 1 Điều này"
      ],
      "keyphrases": [
        "kinh phí xác định tình trạng nghiện ma túy",
        "Nhà nước bảo đảm"
      ],
      "similar": [
        "Ngân sách cho xác định nghiện ma túy"
      ]
    }
  ]
},
{
  "article_id": "article_28",
  "article_number": "28",
  "text": "Điều 28. Các biện pháp cai nghiện ma túy\n1. Biện pháp cai nghiện ma túy bao gồm:\na) Cai nghiện ma túy tự nguyện;\nb) Cai nghiện ma túy bắt buộc.\n2. Biện pháp cai nghiện ma túy tự nguyện được thực hiện tại gia đình, cộng đồng hoặc tại cơ sở cai nghiện ma túy; biện pháp cai nghiện ma túy bắt buộc được thực hiện tại cơ sở cai nghiện ma túy công lập.",
  "concepts": [
    {
      "name": "Biện pháp cai nghiện ma túy",
      "meaning": "Các phương thức được pháp luật quy định để giúp người nghiện ma túy phục hồi và từ bỏ việc sử dụng ma túy.",
      "attrs": [
        "Tính chất (tự nguyện hoặc bắt buộc)",
        "Địa điểm thực hiện (gia đình, cộng đồng, cơ sở cai nghiện)"
      ],
      "keyphrases": [
        "biện pháp cai nghiện ma túy"
      ],
      "similar": [
        "phương pháp cai nghiện ma túy",
        "hình thức cai nghiện ma túy"
      ]
    },
    {
      "name": "Cai nghiện ma túy tự nguyện",
      "meaning": "Hình thức cai nghiện mà người nghiện ma túy tự nguyện tham gia, không bị ép buộc.",
      "attrs": [
        "Tính tự nguyện",
        "Địa điểm thực hiện (gia đình, cộng đồng, cơ sở cai nghiện ma túy)"
      ],
      "keyphrases": [
        "cai nghiện ma túy tự nguyện"
      ],
      "similar": [
        "cai nghiện tự nguyện"
      ]
    },
    {
      "name": "Cai nghiện ma túy bắt buộc",
      "meaning": "Hình thức cai nghiện mà người nghiện ma túy phải tham gia theo quyết định của cơ quan nhà nước có thẩm quyền.",
      "attrs": [
        "Tính bắt buộc",
        "Địa điểm thực hiện (cơ sở cai nghiện ma túy công lập)"
      ],
      "keyphrases": [
        "cai nghiện ma túy bắt buộc"
      ],
      "similar": [
        "cai nghiện bắt buộc"
      ]
    },
    {
      "name": "Cơ sở cai nghiện ma túy",
      "meaning": "Địa điểm được thành lập để thực hiện các hoạt động cai nghiện ma túy.",
      "attrs": [
        "Địa điểm thực hiện cai nghiện",
        "Có thể là công lập hoặc không"
      ],
      "keyphrases": [
        "cơ sở cai nghiện ma túy"
      ],
      "similar": [
        "trung tâm cai nghiện",
        "cơ sở điều trị nghiện"
      ]
    },
    {
      "name": "Cơ sở cai nghiện ma túy công lập",
      "meaning": "Cơ sở cai nghiện ma túy do nhà nước quản lý và điều hành.",
      "attrs": [
        "Thuộc sở hữu nhà nước",
        "Thực hiện cai nghiện bắt buộc"
      ],
      "keyphrases": [
        "cơ sở cai nghiện ma túy công lập"
      ],
      "similar": [
        "trung tâm cai nghiện nhà nước"
      ]
    },
    {
      "name": "Gia đình",
      "meaning": "Môi trường sống của người nghiện, có thể thực hiện cai nghiện tự nguyện.",
      "attrs": [
        "Môi trường sống",
        "Thực hiện cai nghiện tự nguyện"
      ],
      "keyphrases": [
        "gia đình"
      ],
      "similar": []
    },
    {
      "name": "Cộng đồng",
      "meaning": "Môi trường xã hội nơi người nghiện sinh sống, có thể thực hiện cai nghiện tự nguyện.",
      "attrs": [
        "Môi trường xã hội",
        "Thực hiện cai nghiện tự nguyện"
      ],
      "keyphrases": [
        "cộng đồng"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_29",
  "article_number": "29",
  "text": "Điều 29. Quy trình cai nghiện ma túy\n1. Quy trình cai nghiện ma túy bao gồm các giai đoạn sau đây:\na) Tiếp nhận, phân loại;\nb) Điều trị cắt cơn, giải độc, điều trị các rối loạn tâm thần, điều trị các bệnh lý khác;\nc) Giáo dục, tư vấn, phục hồi hành vi, nhân cách;\nd) Lao động trị liệu, học nghề;\nđ) Chuẩn bị tái hòa nhập cộng đồng.\n2. Việc cai nghiện ma túy bắt buộc phải bảo đảm đầy đủ các giai đoạn quy định tại khoản 1 Điều này; việc cai nghiện ma túy tự nguyện phải bảo đảm hoàn thành đủ 03 giai đoạn quy định tại các điểm a, b và c khoản 1 Điều này.\n3. Chính phủ quy định chi tiết Điều này.",
  "concepts": [
    {
      "name": "Quy trình cai nghiện ma túy",
      "meaning": "Trình tự các bước được thực hiện để giúp người nghiện ma túy phục hồi và tái hòa nhập cộng đồng.",
      "attrs": [
        "Các giai đoạn",
        "Tính bắt buộc/tự nguyện",
        "Sự tuân thủ các giai đoạn"
      ],
      "keyphrases": [
        "Quy trình cai nghiện ma túy",
        "các giai đoạn sau đây"
      ],
      "similar": [
        "Trình tự cai nghiện",
        "Các bước cai nghiện"
      ]
    },
    {
      "name": "Giai đoạn cai nghiện",
      "meaning": "Một bước cụ thể trong quy trình cai nghiện ma túy, có mục tiêu và hoạt động riêng.",
      "attrs": [
        "Tiếp nhận, phân loại",
        "Điều trị cắt cơn, giải độc, điều trị các rối loạn tâm thần, điều trị các bệnh lý khác",
        "Giáo dục, tư vấn, phục hồi hành vi, nhân cách",
        "Lao động trị liệu, học nghề",
        "Chuẩn bị tái hòa nhập cộng đồng"
      ],
      "keyphrases": [
        "Tiếp nhận, phân loại",
        "Điều trị cắt cơn, giải độc",
        "Giáo dục, tư vấn",
        "Lao động trị liệu",
        "Chuẩn bị tái hòa nhập cộng đồng",
        "các giai đoạn"
      ],
      "similar": [
        "Bước cai nghiện",
        "Công đoạn cai nghiện"
      ]
    },
    {
      "name": "Cai nghiện ma túy bắt buộc",
      "meaning": "Hình thức cai nghiện mà người nghiện ma túy phải tuân thủ theo quy định của pháp luật.",
      "attrs": [
        "Tuân thủ đầy đủ các giai đoạn",
        "Tính cưỡng chế"
      ],
      "keyphrases": [
        "cai nghiện ma túy bắt buộc",
        "đầy đủ các giai đoạn"
      ],
      "similar": [
        "Cai nghiện cưỡng bức",
        "Cai nghiện theo luật định"
      ]
    },
    {
      "name": "Cai nghiện ma túy tự nguyện",
      "meaning": "Hình thức cai nghiện mà người nghiện ma túy tự nguyện tham gia.",
      "attrs": [
        "Hoàn thành đủ 03 giai đoạn (a, b, c)",
        "Tính tự nguyện"
      ],
      "keyphrases": [
        "cai nghiện ma túy tự nguyện",
        "hoàn thành đủ 03 giai đoạn"
      ],
      "similar": [
        "Cai nghiện tự giác",
        "Cai nghiện theo yêu cầu"
      ]
    },
    {
      "name": "Tái hòa nhập cộng đồng",
      "meaning": "Quá trình người đã cai nghiện ma túy trở lại cuộc sống bình thường và tham gia vào các hoạt động xã hội.",
      "attrs": [
        "Giai đoạn cuối của quy trình cai nghiện",
        "Hỗ trợ xã hội",
        "Phục hồi chức năng xã hội"
      ],
      "keyphrases": [
        "tái hòa nhập cộng đồng",
        "Chuẩn bị tái hòa nhập cộng đồng"
      ],
      "similar": [
        "Hòa nhập xã hội",
        "Trở lại cộng đồng"
      ]
    }
  ]
},
{
  "article_id": "article_30",
  "article_number": "30",
  "text": "Điều 30. Cai nghiện ma túy tự nguyện tại gia đình, cộng đồng\n1. Cai nghiện ma túy tự nguyện tại gia đình, cộng đồng là việc người nghiện ma túy thực hiện cai nghiện tự nguyện tại gia đình, cộng đồng với sự hỗ trợ chuyên môn của tổ chức, cá nhân cung cấp dịch vụ cai nghiện ma túy, sự phối hợp, trợ giúp của gia đình, cộng đồng và chịu sự quản lý của Ủy ban nhân dân cấp xã.\n2. Thời hạn cai nghiện ma túy tự nguyện tại gia đình, cộng đồng là từ đủ 06 tháng đến 12 tháng.\n3. Người cai nghiện ma túy tự nguyện tại gia đình, cộng đồng khi hoàn thành ít nhất 03 giai đoạn quy định tại các điểm a, b và c khoản 1",
  "concepts": [
    {
      "name": "Cai nghiện ma túy tự nguyện tại gia đình, cộng đồng",
      "meaning": "Hình thức cai nghiện ma túy do người nghiện tự nguyện thực hiện tại gia đình hoặc cộng đồng, có sự hỗ trợ chuyên môn và quản lý của các bên liên quan.",
      "attrs": [
        "tự nguyện",
        "tại gia đình",
        "tại cộng đồng",
        "hỗ trợ chuyên môn",
        "phối hợp, trợ giúp của gia đình, cộng đồng",
        "quản lý của Ủy ban nhân dân cấp xã"
      ],
      "keyphrases": [
        "cai nghiện ma túy tự nguyện tại gia đình, cộng đồng",
        "người nghiện ma túy thực hiện cai nghiện tự nguyện",
        "tổ chức, cá nhân cung cấp dịch vụ cai nghiện ma túy",
        "sự phối hợp, trợ giúp của gia đình, cộng đồng",
        "Ủy ban nhân dân cấp xã"
      ],
      "similar": []
    },
    {
      "name": "Thời hạn cai nghiện ma túy tự nguyện tại gia đình, cộng đồng",
      "meaning": "Khoảng thời gian mà người nghiện ma túy tự nguyện thực hiện cai nghiện tại gia đình hoặc cộng đồng.",
      "attrs": [
        "từ đủ 06 tháng",
        "đến 12 tháng"
      ],
      "keyphrases": [
        "thời hạn cai nghiện ma túy tự nguyện tại gia đình, cộng đồng",
        "06 tháng",
        "12 tháng"
      ],
      "similar": []
    },
    {
      "name": "Giai đoạn cai nghiện",
      "meaning": "Các bước hoặc giai đoạn trong quá trình cai nghiện ma túy tự nguyện tại gia đình, cộng đồng.",
      "attrs": [
        "ít nhất 03 giai đoạn",
        "quy định tại các điểm a, b và c khoản 1"
      ],
      "keyphrases": [
        "giai đoạn quy định tại các điểm a, b và c khoản 1",
        "hoàn thành ít nhất 03 giai đoạn"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_29",
  "article_number": "29",
  "text": "Điều 29 của Luật này được hỗ trợ kinh phí.\n4. Người cai nghiện ma túy tự nguyện tại gia đình, cộng đồng có trách nhiệm sau đây:\na) Thực hiện đúng, đầy đủ các quy định về cai nghiện ma túy tự nguyện và tuân thủ hướng dẫn của cơ quan chuyên môn;\nb) Nộp chi phí liên quan đến cai nghiện ma túy theo quy định.\n5. Chủ tịch Ủy ban nhân dân cấp xã có trách nhiệm sau đây:\na) Tiếp nhận đăng ký cai nghiện ma túy tự nguyện tại gia đình, cộng đồng;\nb) Hướng dẫn, quản lý người cai nghiện ma túy tự nguyện tại gia đình, cộng đồng;\nc) Cấp giấy xác nhận hoàn thành cai nghiện ma túy tự nguyện tại gia đình, cộng đồng.\n6. Chủ tịch Ủy ban nhân dân cấp huyện có trách nhiệm sau đây:\na) Giao nhiệm vụ cho các đơn vị sự nghiệp công lập thuộc thẩm quyền trên địa bàn cung cấp dịch vụ cai nghiện ma túy tự nguyện tại gia đình, cộng đồng;\nb) Tiếp nhận đăng ký và công bố danh sách tổ chức, cá nhân đủ điều kiện cung cấp dịch vụ cai nghiện ma túy tự nguyện tại gia đình, cộng đồng;\nc) Thông báo cho Ủy ban nhân dân cấp xã danh sách tổ chức, cá nhân cung cấp dịch vụ cai nghiện ma túy tự nguyện tại gia đình, cộng đồng;\nd) Bố trí kinh phí hỗ trợ công tác cai nghiện ma túy tự nguyện tại gia đình, cộng đồng;\nđ) Chỉ đạo, hướng dẫn, kiểm tra công tác cai nghiện ma túy tự nguyện tại gia đình, cộng đồng.\n7. Cơ sở cai nghiện ma túy, tổ chức, cá nhân đủ điều kiện cung cấp một hoặc nhiều hoạt động cai nghiện theo quy trình cai nghiện ma túy quy định tại khoản 1",
  "concepts": [
    {
      "name": "Cai nghiện ma túy tự nguyện",
      "meaning": "Việc người nghiện ma túy tự nguyện tham gia vào quá trình điều trị và phục hồi tại gia đình hoặc cộng đồng.",
      "attrs": [
        "tự nguyện",
        "tại gia đình",
        "tại cộng đồng",
        "tuân thủ quy định",
        "tuân thủ hướng dẫn của cơ quan chuyên môn"
      ],
      "keyphrases": [
        "cai nghiện ma túy tự nguyện",
        "cai nghiện ma túy tự nguyện tại gia đình",
        "cai nghiện ma túy tự nguyện tại cộng đồng"
      ],
      "similar": [
        "điều trị nghiện ma túy tự nguyện"
      ]
    },
    {
      "name": "Người cai nghiện ma túy tự nguyện",
      "meaning": "Cá nhân tự nguyện tham gia vào quá trình cai nghiện ma túy tại gia đình hoặc cộng đồng.",
      "attrs": [
        "tự nguyện",
        "trách nhiệm",
        "tuân thủ quy định",
        "nộp chi phí"
      ],
      "keyphrases": [
        "người cai nghiện ma túy tự nguyện"
      ],
      "similar": [
        "người nghiện ma túy tự nguyện cai nghiện"
      ]
    },
    {
      "name": "Chi phí cai nghiện ma túy",
      "meaning": "Các khoản tiền mà người cai nghiện ma túy tự nguyện phải trả để chi trả cho các dịch vụ và hoạt động liên quan đến quá trình cai nghiện.",
      "attrs": [
        "liên quan đến cai nghiện",
        "theo quy định"
      ],
      "keyphrases": [
        "chi phí liên quan đến cai nghiện ma túy"
      ],
      "similar": [
        "lệ phí cai nghiện",
        "kinh phí cai nghiện"
      ]
    },
    {
      "name": "Ủy ban nhân dân cấp xã",
      "meaning": "Cơ quan hành chính nhà nước ở cấp xã, có trách nhiệm quản lý và hỗ trợ công tác cai nghiện ma túy tự nguyện tại địa phương.",
      "attrs": [
        "tiếp nhận đăng ký",
        "hướng dẫn",
        "quản lý",
        "cấp giấy xác nhận"
      ],
      "keyphrases": [
        "Ủy ban nhân dân cấp xã"
      ],
      "similar": [
        "UBND cấp xã"
      ]
    },
    {
      "name": "Ủy ban nhân dân cấp huyện",
      "meaning": "Cơ quan hành chính nhà nước ở cấp huyện, có trách nhiệm quản lý và hỗ trợ công tác cai nghiện ma túy tự nguyện tại địa phương.",
      "attrs": [
        "giao nhiệm vụ",
        "tiếp nhận đăng ký",
        "công bố danh sách",
        "thông báo",
        "bố trí kinh phí",
        "chỉ đạo",
        "hướng dẫn",
        "kiểm tra"
      ],
      "keyphrases": [
        "Ủy ban nhân dân cấp huyện"
      ],
      "similar": [
        "UBND cấp huyện"
      ]
    },
    {
      "name": "Dịch vụ cai nghiện ma túy tự nguyện",
      "meaning": "Các hoạt động và chương trình được cung cấp để hỗ trợ người nghiện ma túy tự nguyện trong quá trình cai nghiện.",
      "attrs": [
        "cung cấp dịch vụ",
        "tại gia đình",
        "tại cộng đồng",
        "đủ điều kiện"
      ],
      "keyphrases": [
        "dịch vụ cai nghiện ma túy tự nguyện"
      ],
      "similar": [
        "hoạt động cai nghiện tự nguyện"
      ]
    },
    {
      "name": "Cơ sở cai nghiện ma túy",
      "meaning": "Tổ chức hoặc địa điểm được cấp phép để cung cấp dịch vụ cai nghiện ma túy.",
      "attrs": [
        "cung cấp hoạt động cai nghiện",
        "theo quy trình"
      ],
      "keyphrases": [
        "cơ sở cai nghiện ma túy"
      ],
      "similar": [
        "trung tâm cai nghiện"
      ]
    }
  ]
},
{
  "article_id": "article_29",
  "article_number": "29",
  "text": "Điều 29 của Luật này được cung cấp dịch vụ cai nghiện ma túy tự nguyện tại gia đình, cộng đồng và có trách nhiệm sau đây:\na) Tiếp nhận và tổ chức thực hiện cung cấp dịch vụ cai nghiện ma túy tự nguyện tại gia đình, cộng đồng;\nb) Thực hiện đúng quy trình chuyên môn nghiệp vụ theo quy định của cơ quan có thẩm quyền;\nc) Trong thời hạn 05 ngày làm việc kể từ ngày người cai nghiện ma túy sử dụng dịch vụ hoặc tự ý chấm dứt việc sử dụng dịch vụ hoặc hoàn thành dịch vụ phải thông báo cho Ủy ban nhân dân cấp xã nơi người đó đăng ký cai nghiện ma túy tự nguyện tại gia đình, cộng đồng.\n8. Tổ chức, cá nhân có đủ điều kiện thì được đăng ký cung cấp dịch vụ cai nghiện ma túy tự nguyện tại gia đình, cộng đồng với Chủ tịch Ủy ban nhân dân cấp huyện.\n9. Chính phủ quy định chi tiết Điều này.",
  "concepts": [
    {
      "name": "Dịch vụ cai nghiện ma túy tự nguyện",
      "meaning": "Hoạt động cung cấp các biện pháp hỗ trợ, điều trị cho người nghiện ma túy một cách tự nguyện tại môi trường gia đình hoặc cộng đồng.",
      "attrs": [
        "Tính tự nguyện",
        "Địa điểm: gia đình, cộng đồng",
        "Quy trình chuyên môn nghiệp vụ",
        "Thông báo cho UBND cấp xã"
      ],
      "keyphrases": [
        "dịch vụ cai nghiện ma túy tự nguyện",
        "tại gia đình",
        "tại cộng đồng"
      ],
      "similar": [
        "cai nghiện tự nguyện",
        "điều trị nghiện ma túy tự nguyện"
      ]
    },
    {
      "name": "Tổ chức, cá nhân cung cấp dịch vụ cai nghiện",
      "meaning": "Các chủ thể có đủ điều kiện pháp lý và chuyên môn để thực hiện việc cung cấp dịch vụ cai nghiện ma túy tự nguyện tại gia đình và cộng đồng.",
      "attrs": [
        "Đủ điều kiện",
        "Đăng ký với Chủ tịch UBND cấp huyện",
        "Trách nhiệm thông báo"
      ],
      "keyphrases": [
        "tổ chức",
        "cá nhân",
        "cung cấp dịch vụ cai nghiện ma túy tự nguyện",
        "đăng ký",
        "Chủ tịch Ủy ban nhân dân cấp huyện"
      ],
      "similar": [
        "nhà cung cấp dịch vụ cai nghiện",
        "đơn vị cung cấp dịch vụ cai nghiện"
      ]
    },
    {
      "name": "Trách nhiệm thông báo",
      "meaning": "Nghĩa vụ của tổ chức, cá nhân cung cấp dịch vụ cai nghiện ma túy tự nguyện phải thông báo cho Ủy ban nhân dân cấp xã về tình trạng sử dụng dịch vụ của người cai nghiện.",
      "attrs": [
        "Thời hạn: 05 ngày làm việc",
        "Đối tượng thông báo: UBND cấp xã",
        "Nội dung thông báo: sử dụng dịch vụ, tự ý chấm dứt, hoàn thành dịch vụ"
      ],
      "keyphrases": [
        "thông báo",
        "Ủy ban nhân dân cấp xã",
        "người cai nghiện ma túy sử dụng dịch vụ",
        "tự ý chấm dứt việc sử dụng dịch vụ",
        "hoàn thành dịch vụ"
      ],
      "similar": [
        "báo cáo",
        "cung cấp thông tin"
      ]
    },
    {
      "name": "Ủy ban nhân dân cấp xã",
      "meaning": "Cơ quan hành chính nhà nước ở cấp xã, có thẩm quyền quản lý và theo dõi hoạt động cai nghiện ma túy tự nguyện trên địa bàn.",
      "attrs": [
        "Cấp xã",
        "Quản lý địa bàn",
        "Tiếp nhận thông báo"
      ],
      "keyphrases": [
        "Ủy ban nhân dân cấp xã",
        "nơi người đó đăng ký cai nghiện ma túy tự nguyện tại gia đình, cộng đồng"
      ],
      "similar": [
        "UBND xã",
        "chính quyền cấp xã"
      ]
    }
  ]
},
{
  "article_id": "article_31",
  "article_number": "31",
  "text": "Điều 31. Cai nghiện ma túy tự nguyện tại cơ sở cai nghiện ma túy\n1. Thời hạn cai nghiện ma túy tự nguyện tại cơ sở cai nghiện ma túy là từ đủ 06 tháng đến 12 tháng.\n2. Người cai nghiện ma túy tự nguyện tại cơ sở cai nghiện ma túy khi hoàn thành ít nhất 03 giai đoạn quy định tại các điểm a, b và c khoản 1",
  "concepts": [
    {
      "name": "Cai nghiện ma túy tự nguyện",
      "meaning": "Việc người nghiện ma túy tự nguyện tham gia vào quá trình điều trị và phục hồi tại một cơ sở cai nghiện ma túy.",
      "attrs": [
        "Tính tự nguyện",
        "Thực hiện tại cơ sở cai nghiện ma túy"
      ],
      "keyphrases": [
        "cai nghiện ma túy tự nguyện",
        "cơ sở cai nghiện ma túy"
      ],
      "similar": [
        "Điều trị nghiện ma túy tự nguyện"
      ]
    },
    {
      "name": "Thời hạn cai nghiện ma túy tự nguyện",
      "meaning": "Khoảng thời gian mà người nghiện ma túy tự nguyện phải ở lại và tham gia các hoạt động cai nghiện tại cơ sở cai nghiện ma túy.",
      "attrs": [
        "Thời gian tối thiểu: 06 tháng",
        "Thời gian tối đa: 12 tháng"
      ],
      "keyphrases": [
        "Thời hạn cai nghiện ma túy tự nguyện",
        "từ đủ 06 tháng đến 12 tháng"
      ],
      "similar": [
        "Thời gian điều trị nghiện ma túy tự nguyện"
      ]
    },
    {
      "name": "Giai đoạn cai nghiện ma túy",
      "meaning": "Các bước hoặc giai đoạn khác nhau trong quá trình cai nghiện ma túy, được thực hiện tuần tự để giúp người nghiện phục hồi.",
      "attrs": [
        "Ít nhất 03 giai đoạn",
        "Giai đoạn a",
        "Giai đoạn b",
        "Giai đoạn c",
        "Khoản 1"
      ],
      "keyphrases": [
        "giai đoạn quy định tại các điểm a, b và c khoản 1"
      ],
      "similar": [
        "Bước cai nghiện",
        "Quá trình cai nghiện"
      ]
    }
  ]
},
{
  "article_id": "article_29",
  "article_number": "29",
  "text": "Điều 29 của Luật này được hỗ trợ kinh phí.\n3. Người cai nghiện ma túy tự nguyện tại cơ sở cai nghiện ma túy có trách nhiệm sau đây:\na) Thực hiện đúng, đầy đủ các quy định về cai nghiện ma túy tự nguyện và tuân thủ hướng dẫn của cơ quan chuyên môn;\nb) Nộp chi phí liên quan đến cai nghiện ma túy theo quy định.\nTrường hợp người cai nghiện ma túy tự nguyện tại cơ sở cai nghiện ma túy công lập mà có hoàn cảnh khó khăn được xét giảm hoặc miễn chi phí phải nộp.\n4. Cơ sở cai nghiện ma túy có trách nhiệm cấp giấy xác nhận hoàn thành cai nghiện ma túy tự nguyện cho người cai nghiện ma túy.\n5. Chính phủ quy định chi tiết Điều này.",
  "concepts": [
    {
      "name": "Hỗ trợ kinh phí",
      "meaning": "Việc cung cấp nguồn tài chính để thực hiện các hoạt động liên quan đến Điều 29 của Luật (Luật nào không được nêu rõ trong đoạn văn bản này).",
      "attrs": [],
      "keyphrases": [
        "được hỗ trợ kinh phí"
      ],
      "similar": [
        "cấp kinh phí",
        "tài trợ kinh phí"
      ]
    },
    {
      "name": "Người cai nghiện ma túy tự nguyện",
      "meaning": "Cá nhân tự nguyện tham gia vào quá trình cai nghiện ma túy tại một cơ sở cai nghiện.",
      "attrs": [
        "tự nguyện",
        "cai nghiện ma túy",
        "tại cơ sở cai nghiện ma túy"
      ],
      "keyphrases": [
        "người cai nghiện ma túy tự nguyện"
      ],
      "similar": [
        "người tự nguyện cai nghiện ma túy"
      ]
    },
    {
      "name": "Cơ sở cai nghiện ma túy",
      "meaning": "Tổ chức hoặc địa điểm được phép thực hiện các hoạt động cai nghiện ma túy.",
      "attrs": [],
      "keyphrases": [
        "cơ sở cai nghiện ma túy"
      ],
      "similar": [
        "trung tâm cai nghiện",
        "cơ sở điều trị nghiện"
      ]
    },
    {
      "name": "Quy định về cai nghiện ma túy tự nguyện",
      "meaning": "Các quy tắc, điều lệ, và hướng dẫn pháp lý liên quan đến quá trình cai nghiện ma túy tự nguyện.",
      "attrs": [
        "cai nghiện ma túy tự nguyện"
      ],
      "keyphrases": [
        "quy định về cai nghiện ma túy tự nguyện"
      ],
      "similar": [
        "điều lệ cai nghiện tự nguyện",
        "quy tắc cai nghiện tự nguyện"
      ]
    },
    {
      "name": "Chi phí cai nghiện ma túy",
      "meaning": "Các khoản tiền mà người cai nghiện ma túy tự nguyện phải trả để trang trải cho quá trình cai nghiện.",
      "attrs": [
        "liên quan đến cai nghiện ma túy"
      ],
      "keyphrases": [
        "chi phí liên quan đến cai nghiện ma túy",
        "chi phí phải nộp"
      ],
      "similar": [
        "lệ phí cai nghiện",
        "phí cai nghiện"
      ]
    },
    {
      "name": "Cơ sở cai nghiện ma túy công lập",
      "meaning": "Cơ sở cai nghiện ma túy do nhà nước quản lý và điều hành.",
      "attrs": [
        "công lập"
      ],
      "keyphrases": [
        "cơ sở cai nghiện ma túy công lập"
      ],
      "similar": [
        "trung tâm cai nghiện nhà nước"
      ]
    },
    {
      "name": "Giảm hoặc miễn chi phí",
      "meaning": "Việc được hưởng ưu đãi về tài chính, không phải trả hoặc trả ít hơn chi phí cai nghiện ma túy.",
      "attrs": [
        "hoàn cảnh khó khăn"
      ],
      "keyphrases": [
        "giảm hoặc miễn chi phí"
      ],
      "similar": [
        "hỗ trợ chi phí",
        "miễn giảm học phí"
      ]
    },
    {
      "name": "Giấy xác nhận hoàn thành cai nghiện ma túy tự nguyện",
      "meaning": "Văn bản chứng nhận việc một người đã hoàn thành quá trình cai nghiện ma túy tự nguyện tại một cơ sở cai nghiện.",
      "attrs": [
        "hoàn thành cai nghiện ma túy tự nguyện"
      ],
      "keyphrases": [
        "giấy xác nhận hoàn thành cai nghiện ma túy tự nguyện"
      ],
      "similar": [
        "chứng nhận cai nghiện thành công"
      ]
    },
    {
      "name": "Quy định chi tiết",
      "meaning": "Việc Chính phủ ban hành các văn bản hướng dẫn cụ thể để thực thi Điều luật này.",
      "attrs": [],
      "keyphrases": [
        "quy định chi tiết"
      ],
      "similar": [
        "hướng dẫn thi hành",
        "thông tư hướng dẫn"
      ]
    }
  ]
},
{
  "article_id": "article_32",
  "article_number": "32",
  "text": "Điều 32. Đối tượng bị áp dụng biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc\nNgười nghiện ma túy từ đủ 18 tuổi trở lên bị áp dụng biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc theo quy định của Luật Xử lý vi phạm hành chính khi thuộc một trong các trường hợp sau đây:\n1. Không đăng ký, không thực hiện hoặc tự ý chấm dứt cai nghiện ma túy tự nguyện;\n2. Trong thời gian cai nghiện ma túy tự nguyện bị phát hiện sử dụng trái phép chất ma túy;\n3. Người nghiện ma túy các chất dạng thuốc phiện không đăng ký, không thực hiện hoặc tự ý chấm dứt điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế hoặc bị chấm dứt điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế do vi phạm quy định về điều trị nghiện;\n4. Trong thời gian quản lý sau cai nghiện ma túy mà tái nghiện.",
  "concepts": [
    {
      "name": "Người nghiện ma túy",
      "meaning": "Cá nhân sử dụng trái phép chất ma túy và bị lệ thuộc vào các chất này, cần được cai nghiện.",
      "attrs": [
        "Từ đủ 18 tuổi trở lên"
      ],
      "keyphrases": [
        "Người nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc",
      "meaning": "Một biện pháp cưỡng chế do cơ quan nhà nước có thẩm quyền áp dụng đối với người nghiện ma túy nhằm mục đích cai nghiện và phục hồi.",
      "attrs": [
        "Áp dụng theo quy định của Luật Xử lý vi phạm hành chính"
      ],
      "keyphrases": [
        "biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc"
      ],
      "similar": [
        "Cai nghiện bắt buộc"
      ]
    },
    {
      "name": "Cai nghiện ma túy tự nguyện",
      "meaning": "Hình thức cai nghiện do người nghiện tự nguyện đăng ký và thực hiện tại các cơ sở cai nghiện hoặc tại cộng đồng.",
      "attrs": [],
      "keyphrases": [
        "cai nghiện ma túy tự nguyện"
      ],
      "similar": []
    },
    {
      "name": "Sử dụng trái phép chất ma túy",
      "meaning": "Hành vi sử dụng các chất ma túy không được pháp luật cho phép.",
      "attrs": [],
      "keyphrases": [
        "sử dụng trái phép chất ma túy"
      ],
      "similar": []
    },
    {
      "name": "Điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
      "meaning": "Phương pháp điều trị nghiện sử dụng các loại thuốc thay thế có tác dụng tương tự như thuốc phiện nhưng ít gây nghiện hơn, nhằm giảm dần sự lệ thuộc vào thuốc phiện.",
      "attrs": [],
      "keyphrases": [
        "điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế"
      ],
      "similar": [
        "Điều trị thay thế nghiện chất dạng thuốc phiện"
      ]
    },
    {
      "name": "Quản lý sau cai nghiện ma túy",
      "meaning": "Giai đoạn tiếp theo sau khi người nghiện đã hoàn thành quá trình cai nghiện, nhằm giúp họ duy trì trạng thái không sử dụng ma túy và tái hòa nhập cộng đồng.",
      "attrs": [],
      "keyphrases": [
        "quản lý sau cai nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Tái nghiện",
      "meaning": "Việc người đã cai nghiện ma túy quay trở lại sử dụng ma túy.",
      "attrs": [],
      "keyphrases": [
        "tái nghiện"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_33",
  "article_number": "33",
  "text": "Điều 33. Cai nghiện ma túy cho người từ đủ 12 tuổi đến dưới 18 tuổi\n1. Người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi bị đưa vào cơ sở cai nghiện bắt buộc khi thuộc một trong các trường hợp sau đây:\na) Không đăng ký, không thực hiện hoặc tự ý chấm dứt cai nghiện ma túy tự nguyện;\nb) Trong thời gian cai nghiện ma túy tự nguyện bị phát hiện sử dụng trái phép chất ma túy;\nc) Người nghiện ma túy các chất dạng thuốc phiện không đăng ký, không thực hiện hoặc tự ý chấm dứt điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế hoặc bị chấm dứt điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế do vi phạm quy định về điều trị nghiện.\n2. Người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi bị đưa vào cơ sở cai nghiện bắt buộc có trách nhiệm sau đây:\na) Tuân thủ các quy định về cai nghiện ma túy bắt buộc, nội quy, quy chế và chịu sự quản lý, giáo dục, điều trị của cơ sở cai nghiện bắt buộc;\nb) Tham gia các hoạt động điều trị, chữa bệnh, giáo dục, tư vấn, học văn hóa, học nghề, lao động trị liệu và các hoạt động phục hồi hành vi, nhân cách.\n3. Thời hạn cai nghiện ma túy bắt buộc đối với người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi là từ đủ 06 tháng đến 12 tháng.\n4. Việc đưa người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi vào cơ sở cai nghiện bắt buộc do Tòa án nhân dân cấp huyện quyết định và không phải là biện pháp xử lý hành chính.\n5. Ủy ban Thường vụ Quốc hội quy định trình tự, thủ tục Tòa án nhân dân xem xét, quyết định việc đưa người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi vào cơ sở cai nghiện bắt buộc.",
  "concepts": [
    {
      "name": "Người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi",
      "meaning": "Chỉ đối tượng người nghiện ma túy nằm trong độ tuổi từ 12 đến dưới 18 tuổi, được điều chỉnh bởi các quy định đặc biệt về cai nghiện.",
      "attrs": [
        "Độ tuổi: từ đủ 12 tuổi đến dưới 18 tuổi",
        "Tình trạng: nghiện ma túy"
      ],
      "keyphrases": [
        "người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi"
      ],
      "similar": [
        "người chưa thành niên nghiện ma túy"
      ]
    },
    {
      "name": "Cai nghiện ma túy bắt buộc",
      "meaning": "Hình thức cai nghiện ma túy mà người nghiện phải thực hiện theo quyết định của cơ quan nhà nước có thẩm quyền.",
      "attrs": [
        "Tính chất: bắt buộc",
        "Địa điểm: cơ sở cai nghiện bắt buộc",
        "Thời hạn: từ đủ 06 tháng đến 12 tháng (đối với người từ 12 đến dưới 18 tuổi)"
      ],
      "keyphrases": [
        "cai nghiện ma túy bắt buộc",
        "cơ sở cai nghiện bắt buộc"
      ],
      "similar": [
        "cai nghiện cưỡng bức"
      ]
    },
    {
      "name": "Cai nghiện ma túy tự nguyện",
      "meaning": "Hình thức cai nghiện ma túy mà người nghiện tự nguyện đăng ký và thực hiện.",
      "attrs": [
        "Tính chất: tự nguyện",
        "Điều kiện chấm dứt: tự ý chấm dứt, phát hiện sử dụng trái phép chất ma túy"
      ],
      "keyphrases": [
        "cai nghiện ma túy tự nguyện"
      ],
      "similar": [
        "tự cai nghiện"
      ]
    },
    {
      "name": "Điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
      "meaning": "Phương pháp điều trị nghiện ma túy bằng cách sử dụng các loại thuốc thay thế để giảm hoặc loại bỏ sự phụ thuộc vào các chất dạng thuốc phiện.",
      "attrs": [
        "Đối tượng: người nghiện các chất dạng thuốc phiện",
        "Phương pháp: sử dụng thuốc thay thế",
        "Điều kiện chấm dứt: vi phạm quy định về điều trị nghiện"
      ],
      "keyphrases": [
        "điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế"
      ],
      "similar": [
        "điều trị thay thế nghiện opioid"
      ]
    },
    {
      "name": "Quyết định đưa vào cơ sở cai nghiện bắt buộc",
      "meaning": "Quyết định của Tòa án nhân dân cấp huyện về việc đưa người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi vào cơ sở cai nghiện bắt buộc.",
      "attrs": [
        "Thẩm quyền: Tòa án nhân dân cấp huyện",
        "Đối tượng: người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi",
        "Tính chất: không phải là biện pháp xử lý hành chính"
      ],
      "keyphrases": [
        "đưa người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi vào cơ sở cai nghiện bắt buộc",
        "Tòa án nhân dân cấp huyện quyết định"
      ],
      "similar": [
        "quyết định cưỡng chế cai nghiện"
      ]
    }
  ]
},
{
  "article_id": "article_34",
  "article_number": "34",
  "text": "Điều 34. Lập hồ sơ đề nghị đưa vào cơ sở cai nghiện bắt buộc đối với người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi\n1. Việc lập hồ sơ đề nghị đưa vào cơ sở cai nghiện bắt buộc đối với người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi được thực hiện như sau:\na) Chủ tịch Ủy ban nhân dân cấp xã nơi người đó cư trú hoặc có hành vi vi phạm trong trường hợp không xác định được nơi cư trú lập hồ sơ đề nghị đưa vào cơ sở cai nghiện bắt buộc;\nb) Trường hợp người nghiện ma túy do công an cấp huyện hoặc công an cấp tỉnh phát hiện hoặc trong quá trình điều tra, thụ lý các vụ việc vi phạm pháp luật mà đối tượng là người từ đủ 12 tuổi đến dưới 18 tuổi thuộc diện đưa vào cơ sở cai nghiện bắt buộc thì cơ quan công an đang thụ lý vụ việc tiến hành xác minh, thu thập tài liệu và lập hồ sơ đề nghị đưa vào cơ sở cai nghiện bắt buộc đối với người đó;\nc) Hồ sơ đề nghị bao gồm biên bản vi phạm, bản tóm tắt lý lịch, tài liệu chứng minh tình trạng nghiện ma túy hiện tại của người đó, bản tường trình của người nghiện ma túy hoặc của người đại diện hợp pháp của họ, ý kiến của cha, mẹ, người giám hộ hoặc người đại diện hợp pháp;\nd) Công an cấp xã có trách nhiệm giúp Chủ tịch Ủy ban nhân dân cùng cấp thu thập các tài liệu và lập hồ sơ đề nghị quy định tại điểm a khoản 1 Điều này.\n2. Cơ quan, người lập hồ sơ đề nghị quy định tại khoản 1 Điều này phải chịu trách nhiệm về tính pháp lý của hồ sơ đề nghị. Sau khi hoàn thành việc lập hồ sơ đề nghị, cơ quan, người lập hồ sơ phải thông báo bằng văn bản cho người bị đề nghị áp dụng biện pháp đưa vào cơ sở cai nghiện bắt buộc, cha, mẹ, người giám hộ hoặc người đại diện hợp pháp của họ về việc lập hồ sơ. Những người này có quyền đọc hồ sơ và ghi ý kiến về việc lập hồ sơ trong thời hạn 03 ngày làm việc kể từ ngày nhận được thông báo.\n3. Trong thời hạn 01 ngày làm việc kể từ ngày hết thời hạn đọc hồ sơ, cơ quan, người đã lập hồ sơ gửi hồ sơ cho Trưởng phòng Phòng Lao động - Thương binh và Xã hội cấp huyện nơi người bị đề nghị cư trú hoặc có hành vi vi phạm trong trường hợp không xác định được nơi cư trú. Trong thời hạn 02 ngày làm việc kể từ ngày nhận được hồ sơ, Trưởng phòng Phòng Lao động - Thương binh và Xã hội cấp huyện quyết định chuyển hồ sơ đề nghị Tòa án nhân dân cấp huyện quyết định đưa vào cơ sở cai nghiện bắt buộc. Trường hợp hồ sơ chưa đầy đủ thì Trưởng phòng Phòng Lao động - Thương binh và Xã hội cấp huyện chuyển lại cơ quan, người đã lập hồ sơ để bổ sung hồ sơ, thời hạn bổ sung là 02 ngày làm việc kể từ ngày nhận lại hồ sơ. Trong thời hạn 02 ngày làm việc kể từ ngày nhận được hồ sơ bổ sung, Trưởng phòng Phòng Lao động - Thương binh và Xã hội cấp huyện quyết định việc chuyển hồ sơ đề nghị Tòa án nhân dân cấp huyện quyết định đưa vào cơ sở cai nghiện bắt buộc.\n4. Hồ sơ đề nghị Tòa án nhân dân cấp huyện xem xét, quyết định đưa vào cơ sở cai nghiện bắt buộc bao gồm:\na) Hồ sơ đề nghị đưa vào cơ sở cai nghiện bắt buộc quy định tại điểm c khoản 1 Điều này;\nb) Văn bản của Trưởng phòng Phòng Lao động - Thương binh và Xã hội cấp huyện về việc đề nghị xem xét đưa vào cơ sở cai nghiện bắt buộc.\nTrong nội dung văn bản của Trưởng phòng Phòng Lao động - Thương binh và Xã hội phải nêu ý kiến về bảo vệ quyền trẻ em.\n5. Hồ sơ đề nghị đưa vào cơ sở cai nghiện bắt buộc đối với người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi phải được đánh bút lục và được lưu trữ theo quy định của pháp luật về lưu trữ.\n6. Chính phủ quy định chi tiết việc lập hồ sơ đề nghị đưa người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi vào cơ sở cai nghiện bắt buộc; chế độ cai nghiện ma túy áp dụng đối với người từ đủ 12 tuổi đến dưới 18 tuổi.",
  "concepts": [
    {
      "name": "Hồ sơ đề nghị đưa vào cơ sở cai nghiện bắt buộc",
      "meaning": "Tập hợp các tài liệu, chứng cứ pháp lý chứng minh một người nghiện ma túy từ 12 đến dưới 18 tuổi cần được đưa vào cơ sở cai nghiện bắt buộc.",
      "attrs": [
        "Biên bản vi phạm",
        "Bản tóm tắt lý lịch",
        "Tài liệu chứng minh tình trạng nghiện ma túy",
        "Bản tường trình của người nghiện hoặc người đại diện hợp pháp",
        "Ý kiến của cha, mẹ, người giám hộ hoặc người đại diện hợp pháp"
      ],
      "keyphrases": [
        "hồ sơ đề nghị đưa vào cơ sở cai nghiện bắt buộc",
        "biên bản vi phạm",
        "bản tóm tắt lý lịch",
        "tài liệu chứng minh tình trạng nghiện ma túy",
        "bản tường trình",
        "ý kiến của cha, mẹ, người giám hộ"
      ],
      "similar": [
        "hồ sơ đề nghị",
        "hồ sơ"
      ]
    },
    {
      "name": "Người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi",
      "meaning": "Đối tượng là người có hành vi sử dụng trái phép chất ma túy và bị nghiện, nằm trong độ tuổi từ 12 đến dưới 18 tuổi, thuộc diện xem xét đưa vào cơ sở cai nghiện bắt buộc.",
      "attrs": [
        "Độ tuổi: từ đủ 12 tuổi đến dưới 18 tuổi",
        "Tình trạng: nghiện ma túy"
      ],
      "keyphrases": [
        "người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi",
        "người nghiện ma túy"
      ],
      "similar": [
        "trẻ em nghiện ma túy",
        "người chưa thành niên nghiện ma túy"
      ]
    },
    {
      "name": "Cơ sở cai nghiện bắt buộc",
      "meaning": "Cơ sở do nhà nước thành lập để thực hiện việc cai nghiện ma túy bắt buộc đối với các đối tượng nghiện ma túy theo quyết định của Tòa án.",
      "attrs": [
        "Tính chất: bắt buộc",
        "Mục đích: cai nghiện ma túy"
      ],
      "keyphrases": [
        "cơ sở cai nghiện bắt buộc"
      ],
      "similar": [
        "trung tâm cai nghiện bắt buộc"
      ]
    },
    {
      "name": "Chủ tịch Ủy ban nhân dân cấp xã",
      "meaning": "Người đứng đầu Ủy ban nhân dân cấp xã, có thẩm quyền lập hồ sơ đề nghị đưa người nghiện ma túy vào cơ sở cai nghiện bắt buộc.",
      "attrs": [
        "Cấp hành chính: cấp xã",
        "Thẩm quyền: lập hồ sơ đề nghị"
      ],
      "keyphrases": [
        "Chủ tịch Ủy ban nhân dân cấp xã"
      ],
      "similar": []
    },
    {
      "name": "Công an cấp huyện/tỉnh",
      "meaning": "Cơ quan công an cấp huyện hoặc cấp tỉnh, có trách nhiệm xác minh, thu thập tài liệu và lập hồ sơ đề nghị đưa người nghiện ma túy vào cơ sở cai nghiện bắt buộc trong quá trình điều tra, thụ lý vụ việc.",
      "attrs": [
        "Cấp hành chính: cấp huyện, cấp tỉnh",
        "Trách nhiệm: xác minh, thu thập tài liệu, lập hồ sơ đề nghị"
      ],
      "keyphrases": [
        "công an cấp huyện",
        "công an cấp tỉnh"
      ],
      "similar": []
    },
    {
      "name": "Người đại diện hợp pháp",
      "meaning": "Người được pháp luật công nhận có quyền đại diện cho người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi, bao gồm cha, mẹ, người giám hộ.",
      "attrs": [
        "Cha",
        "Mẹ",
        "Người giám hộ"
      ],
      "keyphrases": [
        "người đại diện hợp pháp",
        "cha, mẹ, người giám hộ"
      ],
      "similar": []
    },
    {
      "name": "Trưởng phòng Phòng Lao động - Thương binh và Xã hội cấp huyện",
      "meaning": "Người đứng đầu Phòng Lao động - Thương binh và Xã hội cấp huyện, có trách nhiệm xem xét hồ sơ và quyết định chuyển hồ sơ đề nghị Tòa án nhân dân cấp huyện quyết định đưa vào cơ sở cai nghiện bắt buộc.",
      "attrs": [
        "Cấp hành chính: cấp huyện",
        "Trách nhiệm: xem xét hồ sơ, chuyển hồ sơ đề nghị"
      ],
      "keyphrases": [
        "Trưởng phòng Phòng Lao động - Thương binh và Xã hội cấp huyện"
      ],
      "similar": []
    },
    {
      "name": "Tòa án nhân dân cấp huyện",
      "meaning": "Cơ quan xét xử có thẩm quyền ra quyết định đưa người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi vào cơ sở cai nghiện bắt buộc.",
      "attrs": [
        "Cấp xét xử: cấp huyện",
        "Thẩm quyền: ra quyết định đưa vào cơ sở cai nghiện bắt buộc"
      ],
      "keyphrases": [
        "Tòa án nhân dân cấp huyện"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_35",
  "article_number": "35",
  "text": "Điều 35. Cơ sở cai nghiện ma túy công lập\n1. Cơ sở cai nghiện ma túy công lập do Chủ tịch Ủy ban nhân dân cấp tỉnh quyết định thành lập.\n2. Cơ sở cai nghiện ma túy công lập phải bố trí các khu sau đây:\na) Khu lưu trú tạm thời đối với người được đề nghị xác định tình trạng nghiện ma túy và người trong thời gian lập hồ sơ đề nghị áp dụng biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc;\nb) Khu cai nghiện ma túy bắt buộc;\nc) Khu cai nghiện ma túy tự nguyện;\nd) Khu cai nghiện cho người từ đủ 12 tuổi đến dưới 18 tuổi;\nđ) Khu cai nghiện cho người mắc bệnh truyền nhiễm nhóm A, nhóm B theo quy định của Luật Phòng, chống bệnh truyền nhiễm;\ne) Khu cai nghiện cho người có hành vi gây rối trật tự, vi phạm nội quy, quy chế của cơ sở cai nghiện ma túy.\n3. Trong các khu quy định tại khoản 2 Điều này phải bố trí khu riêng cho nam giới và khu riêng cho nữ giới. Người có sự khác nhau giữa thực thể và giới tính ghi trong hồ sơ, lý lịch được quản lý tại phòng riêng trong khu vực theo giới tính biểu hiện trên thực thể học viên.\n4. Hoạt động của cơ sở cai nghiện ma túy công lập bao gồm:\na) Tiếp nhận và tổ chức thực hiện cai nghiện ma túy cho người nghiện ma túy bị đưa vào cơ sở cai nghiện bắt buộc và người nghiện ma túy tự nguyện cai nghiện;\nb) Thực hiện việc xác định tình trạng nghiện ma túy;\nc) Tiếp nhận, quản lý, giáo dục, tư vấn, điều trị hội chứng cai, điều trị rối loạn tâm thần và các bệnh khác đối với người đang trong thời gian lập hồ sơ đề nghị đưa vào cơ sở cai nghiện bắt buộc.\n5. Cơ sở cai nghiện ma túy công lập có quyền sau đây:\na) Tiếp nhận người nghiện ma túy vào cai nghiện ma túy tự nguyện phù hợp với khả năng tiếp nhận của cơ sở cai nghiện;\nb) Người đứng đầu cơ sở cai nghiện ma túy công lập được quyết định áp dụng các biện pháp phù hợp để quản lý, giáo dục, chữa trị cho người cai nghiện ma túy.\n6. Cơ sở cai nghiện ma túy công lập có trách nhiệm sau đây:\na) Tuân thủ các quy định về xác định tình trạng nghiện ma túy, quy trình cai nghiện ma túy, quản lý người đang trong thời gian lập hồ sơ đề nghị đưa vào cơ sở cai nghiện bắt buộc;\nb) Tôn trọng tính mạng, sức khỏe, danh dự, nhân phẩm, tài sản của người cai nghiện ma túy, người được đề nghị xác định tình trạng nghiện ma túy và người đang trong thời gian lập hồ sơ đề nghị đưa vào cơ sở cai nghiện bắt buộc;\nc) Bảo đảm quyền của người nghiện ma túy trong thời gian cai nghiện và cấp giấy xác nhận hoàn thành cai nghiện ma túy bắt buộc cho người từ đủ 12 tuổi đến dưới 18 tuổi;\nd) Người đứng đầu cơ sở cai nghiện ma túy công lập có trách nhiệm bảo đảm điều kiện hoạt động của cơ sở cai nghiện ma túy; niêm yết công khai chi phí cai nghiện ma túy tại cơ sở theo quy định của pháp luật;\nđ) Phòng, chống thẩm lậu ma túy vào cơ sở;\ne) Trong thời hạn 05 ngày làm việc kể từ ngày người cai nghiện ma túy tự nguyện được tiếp nhận hoặc tự ý chấm dứt việc sử dụng dịch vụ hoặc hoàn thành quy trình cai nghiện ma túy phải thông báo cho Ủy ban nhân dân cấp xã nơi người đó đăng ký cai nghiện ma túy tự nguyện.\n7. Chính phủ quy định điều kiện về cơ sở vật chất, trang thiết bị, nhân sự của cơ sở cai nghiện ma túy công lập và chế độ quản lý tại cơ sở cai nghiện ma túy công lập.",
  "concepts": [
    {
      "name": "Cơ sở cai nghiện ma túy công lập",
      "meaning": "Cơ sở do Nhà nước thành lập để thực hiện các hoạt động cai nghiện ma túy bắt buộc và tự nguyện.",
      "attrs": [
        "Do Chủ tịch Ủy ban nhân dân cấp tỉnh quyết định thành lập",
        "Phải bố trí các khu chức năng riêng biệt",
        "Có quyền tiếp nhận người nghiện ma túy tự nguyện",
        "Có trách nhiệm tuân thủ quy trình cai nghiện, bảo vệ quyền của người cai nghiện"
      ],
      "keyphrases": [
        "Cơ sở cai nghiện ma túy công lập",
        "quyết định thành lập",
        "khả năng tiếp nhận",
        "điều kiện hoạt động"
      ],
      "similar": [
        "Trung tâm cai nghiện công lập"
      ]
    },
    {
      "name": "Khu lưu trú tạm thời",
      "meaning": "Khu vực dành cho người được đề nghị xác định tình trạng nghiện ma túy và người trong thời gian lập hồ sơ đề nghị áp dụng biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc.",
      "attrs": [
        "Dành cho người được đề nghị xác định tình trạng nghiện ma túy",
        "Dành cho người trong thời gian lập hồ sơ đề nghị áp dụng biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc"
      ],
      "keyphrases": [
        "Khu lưu trú tạm thời",
        "người được đề nghị xác định tình trạng nghiện ma túy",
        "thời gian lập hồ sơ đề nghị áp dụng biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc"
      ],
      "similar": []
    },
    {
      "name": "Khu cai nghiện ma túy bắt buộc",
      "meaning": "Khu vực dành cho người nghiện ma túy bị đưa vào cơ sở cai nghiện theo quyết định của cơ quan có thẩm quyền.",
      "attrs": [
        "Dành cho người nghiện ma túy bị đưa vào cơ sở cai nghiện bắt buộc"
      ],
      "keyphrases": [
        "Khu cai nghiện ma túy bắt buộc"
      ],
      "similar": []
    },
    {
      "name": "Khu cai nghiện ma túy tự nguyện",
      "meaning": "Khu vực dành cho người nghiện ma túy tự nguyện tham gia cai nghiện.",
      "attrs": [
        "Dành cho người nghiện ma túy tự nguyện cai nghiện"
      ],
      "keyphrases": [
        "Khu cai nghiện ma túy tự nguyện"
      ],
      "similar": []
    },
    {
      "name": "Xác định tình trạng nghiện ma túy",
      "meaning": "Quy trình để xác định một người có nghiện ma túy hay không.",
      "attrs": [
        "Thực hiện bởi cơ sở cai nghiện ma túy công lập",
        "Tuân thủ các quy định pháp luật"
      ],
      "keyphrases": [
        "xác định tình trạng nghiện ma túy"
      ],
      "similar": [
        "đánh giá nghiện ma túy"
      ]
    },
    {
      "name": "Cai nghiện ma túy bắt buộc",
      "meaning": "Biện pháp cai nghiện áp dụng đối với người nghiện ma túy theo quyết định của cơ quan nhà nước có thẩm quyền.",
      "attrs": [
        "Áp dụng theo quyết định của cơ quan có thẩm quyền",
        "Thực hiện tại cơ sở cai nghiện ma túy công lập"
      ],
      "keyphrases": [
        "cai nghiện ma túy bắt buộc"
      ],
      "similar": []
    },
    {
      "name": "Cai nghiện ma túy tự nguyện",
      "meaning": "Việc người nghiện ma túy tự nguyện tham gia vào quá trình cai nghiện tại các cơ sở được phép.",
      "attrs": [
        "Người nghiện tự nguyện tham gia",
        "Thực hiện tại cơ sở cai nghiện ma túy công lập hoặc tư nhân"
      ],
      "keyphrases": [
        "cai nghiện ma túy tự nguyện"
      ],
      "similar": []
    },
    {
      "name": "Người đứng đầu cơ sở cai nghiện ma túy công lập",
      "meaning": "Người chịu trách nhiệm quản lý và điều hành hoạt động của cơ sở cai nghiện ma túy công lập.",
      "attrs": [
        "Có quyền quyết định các biện pháp quản lý, giáo dục, chữa trị",
        "Có trách nhiệm bảo đảm điều kiện hoạt động của cơ sở"
      ],
      "keyphrases": [
        "Người đứng đầu cơ sở cai nghiện ma túy công lập"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_36",
  "article_number": "36",
  "text": "Điều 36. Cơ sở cai nghiện ma túy tự nguyện\n1. Cơ sở cai nghiện ma túy tự nguyện do cá nhân, tổ chức kinh doanh dịch vụ cai nghiện ma túy thành lập. Chính phủ quy định điều kiện và thẩm quyền, trình tự, thủ tục cấp, thu hồi giấy phép hoạt động của cơ sở cai nghiện ma túy tự nguyện.\n2. Cơ sở cai nghiện ma túy tự nguyện có quyền sau đây:\na) Tiếp nhận người nghiện ma túy vào cai nghiện ma túy tự nguyện phù hợp với khả năng tiếp nhận của cơ sở cai nghiện;\nb) Được thu các khoản chi phí liên quan đến cai nghiện ma túy;\nc) Được hưởng chế độ ưu đãi theo quy định của pháp luật.\n3. Cơ sở cai nghiện ma túy tự nguyện có trách nhiệm sau đây:\na) Tuân thủ quy trình cai nghiện ma túy;\nb) Tôn trọng tính mạng, sức khỏe, danh dự, nhân phẩm, tài sản của người cai nghiện ma túy;\nc) Bảo đảm quyền của người nghiện ma túy từ đủ 12 tuổi đến dưới 18 tuổi trong thời gian cai nghiện ma túy;\nd) Người đứng đầu cơ sở cai nghiện ma túy có trách nhiệm bảo đảm điều kiện hoạt động của cơ sở cai nghiện ma túy; niêm yết công khai chi phí liên quan đến cai nghiện ma túy tại cơ sở theo quy định của pháp luật;\nđ) Phòng, chống thẩm lậu ma túy vào cơ sở;\ne) Bố trí các khu hoặc phòng riêng khi tiếp nhận các đối tượng là người từ đủ 12 tuổi đến dưới 18 tuổi, người mắc bệnh truyền nhiễm nhóm A, nhóm B theo quy định của Luật Phòng, chống bệnh truyền nhiễm, nữ giới; người có sự khác nhau giữa thực thể và giới tính ghi trong hồ sơ, lý lịch được quản lý tại phòng riêng trong khu vực theo giới tính biểu hiện trên thực thể học viên;\ng) Trong thời hạn 05 ngày làm việc kể từ ngày người cai nghiện ma túy được tiếp nhận hoặc tự ý chấm dứt việc sử dụng dịch vụ hoặc hoàn thành quy trình cai nghiện ma túy phải thông báo cho Ủy ban nhân dân cấp xã nơi người đó đăng ký cai nghiện ma túy tự nguyện.",
  "concepts": [
    {
      "name": "Cơ sở cai nghiện ma túy tự nguyện",
      "meaning": "Cơ sở do cá nhân, tổ chức kinh doanh dịch vụ cai nghiện ma túy thành lập, hoạt động dựa trên sự tự nguyện của người nghiện ma túy.",
      "attrs": [
        "Do cá nhân, tổ chức thành lập",
        "Kinh doanh dịch vụ cai nghiện ma túy",
        "Hoạt động dựa trên sự tự nguyện"
      ],
      "keyphrases": [
        "cơ sở cai nghiện ma túy tự nguyện",
        "cá nhân, tổ chức kinh doanh dịch vụ cai nghiện ma túy",
        "thành lập",
        "giấy phép hoạt động"
      ],
      "similar": []
    },
    {
      "name": "Quyền của cơ sở cai nghiện ma túy tự nguyện",
      "meaning": "Các quyền mà cơ sở cai nghiện ma túy tự nguyện được pháp luật cho phép thực hiện.",
      "attrs": [
        "Tiếp nhận người nghiện ma túy",
        "Thu chi phí cai nghiện",
        "Hưởng chế độ ưu đãi"
      ],
      "keyphrases": [
        "quyền",
        "tiếp nhận người nghiện ma túy",
        "khả năng tiếp nhận",
        "thu các khoản chi phí",
        "chế độ ưu đãi"
      ],
      "similar": []
    },
    {
      "name": "Trách nhiệm của cơ sở cai nghiện ma túy tự nguyện",
      "meaning": "Các nghĩa vụ mà cơ sở cai nghiện ma túy tự nguyện phải thực hiện theo quy định của pháp luật.",
      "attrs": [
        "Tuân thủ quy trình cai nghiện",
        "Tôn trọng người cai nghiện",
        "Bảo đảm quyền của người nghiện ma túy dưới 18 tuổi",
        "Đảm bảo điều kiện hoạt động",
        "Phòng chống thẩm lậu ma túy",
        "Bố trí khu vực riêng cho các đối tượng đặc biệt",
        "Thông báo cho UBND cấp xã"
      ],
      "keyphrases": [
        "trách nhiệm",
        "tuân thủ quy trình cai nghiện ma túy",
        "tôn trọng tính mạng, sức khỏe, danh dự, nhân phẩm, tài sản",
        "bảo đảm quyền của người nghiện ma túy",
        "điều kiện hoạt động",
        "niêm yết công khai chi phí",
        "phòng, chống thẩm lậu ma túy",
        "khu hoặc phòng riêng",
        "thông báo cho Ủy ban nhân dân cấp xã"
      ],
      "similar": []
    },
    {
      "name": "Người nghiện ma túy",
      "meaning": "Người sử dụng chất ma túy và bị lệ thuộc vào các chất này.",
      "attrs": [
        "Sử dụng ma túy",
        "Lệ thuộc vào ma túy",
        "Được tiếp nhận vào cơ sở cai nghiện"
      ],
      "keyphrases": [
        "người nghiện ma túy",
        "tiếp nhận người nghiện ma túy",
        "cai nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Quy trình cai nghiện ma túy",
      "meaning": "Các bước và thủ tục được thực hiện để giúp người nghiện ma túy phục hồi và từ bỏ việc sử dụng ma túy.",
      "attrs": [
        "Các bước cụ thể",
        "Thủ tục thực hiện",
        "Mục tiêu phục hồi"
      ],
      "keyphrases": [
        "quy trình cai nghiện ma túy",
        "tuân thủ quy trình cai nghiện ma túy",
        "hoàn thành quy trình cai nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Ủy ban nhân dân cấp xã",
      "meaning": "Cơ quan hành chính nhà nước ở cấp xã.",
      "attrs": [
        "Cơ quan hành chính",
        "Cấp xã",
        "Nhận thông báo về người cai nghiện"
      ],
      "keyphrases": [
        "Ủy ban nhân dân cấp xã",
        "thông báo cho Ủy ban nhân dân cấp xã"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_37",
  "article_number": "37",
  "text": "Điều 37. Áp dụng biện pháp cai nghiện ma túy cho người Việt Nam bị nước ngoài trục xuất về nước do có hành vi sử dụng trái phép chất ma túy, nghiện ma túy; người nước ngoài nghiện ma túy sinh sống tại Việt Nam\n1. Người Việt Nam bị nước ngoài trục xuất về Việt Nam do có hành vi sử dụng trái phép chất ma túy, nghiện ma túy khi về nước phải tiến hành xác định tình trạng nghiện ma túy. Trường hợp được xác định là nghiện ma túy thì người đó phải thực hiện các biện pháp cai nghiện ma túy theo quy định của Luật này.\n2. Người nước ngoài nghiện ma túy sinh sống tại Việt Nam có trách nhiệm đăng ký thực hiện cai nghiện ma túy tự nguyện tại cơ sở cai nghiện ma túy theo quy định của Luật này và phải chi trả toàn bộ các khoản chi phí liên quan đến cai nghiện. Trường hợp không thực hiện cai nghiện ma túy tự nguyện thì người đó bị xử lý theo quy định của pháp luật.",
  "concepts": [
    {
      "name": "Biện pháp cai nghiện ma túy",
      "meaning": "Các phương pháp và quy trình được áp dụng để giúp người nghiện ma túy từ bỏ việc sử dụng chất ma túy.",
      "attrs": [],
      "keyphrases": [
        "biện pháp cai nghiện ma túy"
      ],
      "similar": [
        "cai nghiện ma túy"
      ]
    },
    {
      "name": "Người Việt Nam bị nước ngoài trục xuất",
      "meaning": "Công dân Việt Nam bị chính quyền nước ngoài buộc phải rời khỏi lãnh thổ nước đó vì vi phạm pháp luật liên quan đến ma túy.",
      "attrs": [
        "bị trục xuất về nước",
        "có hành vi sử dụng trái phép chất ma túy, nghiện ma túy"
      ],
      "keyphrases": [
        "người Việt Nam bị nước ngoài trục xuất về nước"
      ],
      "similar": [
        "người Việt Nam bị trục xuất"
      ]
    },
    {
      "name": "Hành vi sử dụng trái phép chất ma túy",
      "meaning": "Việc sử dụng các chất ma túy mà không được pháp luật cho phép.",
      "attrs": [
        "trái phép",
        "chất ma túy"
      ],
      "keyphrases": [
        "hành vi sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "sử dụng ma túy trái phép"
      ]
    },
    {
      "name": "Nghiện ma túy",
      "meaning": "Tình trạng lệ thuộc vào chất ma túy, gây ra những ảnh hưởng tiêu cực đến sức khỏe thể chất và tinh thần.",
      "attrs": [],
      "keyphrases": [
        "nghiện ma túy"
      ],
      "similar": [
        "tình trạng nghiện ma túy"
      ]
    },
    {
      "name": "Xác định tình trạng nghiện ma túy",
      "meaning": "Quy trình đánh giá và kết luận về việc một người có nghiện ma túy hay không.",
      "attrs": [],
      "keyphrases": [
        "xác định tình trạng nghiện ma túy"
      ],
      "similar": [
        "đánh giá nghiện ma túy"
      ]
    },
    {
      "name": "Người nước ngoài nghiện ma túy sinh sống tại Việt Nam",
      "meaning": "Công dân nước ngoài đang cư trú tại Việt Nam và bị nghiện ma túy.",
      "attrs": [
        "người nước ngoài",
        "nghiện ma túy",
        "sinh sống tại Việt Nam"
      ],
      "keyphrases": [
        "người nước ngoài nghiện ma túy sinh sống tại Việt Nam"
      ],
      "similar": [
        "người nước ngoài nghiện ma túy"
      ]
    },
    {
      "name": "Cai nghiện ma túy tự nguyện",
      "meaning": "Việc người nghiện ma túy tự nguyện tham gia vào các chương trình cai nghiện.",
      "attrs": [
        "tự nguyện",
        "cơ sở cai nghiện ma túy"
      ],
      "keyphrases": [
        "cai nghiện ma túy tự nguyện"
      ],
      "similar": [
        "tự nguyện cai nghiện"
      ]
    },
    {
      "name": "Cơ sở cai nghiện ma túy",
      "meaning": "Các trung tâm hoặc tổ chức được cấp phép để thực hiện các hoạt động cai nghiện ma túy.",
      "attrs": [],
      "keyphrases": [
        "cơ sở cai nghiện ma túy"
      ],
      "similar": [
        "trung tâm cai nghiện"
      ]
    },
    {
      "name": "Chi phí liên quan đến cai nghiện",
      "meaning": "Các khoản tiền phải trả cho việc điều trị và phục hồi chức năng cho người nghiện ma túy.",
      "attrs": [],
      "keyphrases": [
        "chi phí liên quan đến cai nghiện"
      ],
      "similar": [
        "phí cai nghiện"
      ]
    },
    {
      "name": "Xử lý theo quy định của pháp luật",
      "meaning": "Việc áp dụng các biện pháp pháp lý đối với hành vi vi phạm pháp luật, trong trường hợp này là không thực hiện cai nghiện ma túy tự nguyện.",
      "attrs": [],
      "keyphrases": [
        "xử lý theo quy định của pháp luật"
      ],
      "similar": [
        "xử phạt vi phạm"
      ]
    }
  ]
},
{
  "article_id": "article_38",
  "article_number": "38",
  "text": "Điều 38. Cai nghiện ma túy cho người bị tạm giam, phạm nhân, trại viên cơ sở giáo dục bắt buộc, học sinh trường giáo dưỡng\n1. Nhà nước áp dụng biện pháp cai nghiện thích hợp đối với người nghiện ma túy là người bị tạm giam, phạm nhân, trại viên cơ sở giáo dục bắt buộc, học sinh trường giáo dưỡng.\n2. Giám thị trại giam, giám thị trại tạm giam, trưởng nhà tạm giữ, giám đốc cơ sở giáo dục bắt buộc, hiệu trưởng trường giáo dưỡng phối hợp chặt chẽ với cơ sở y tế tại địa phương để thực hiện quy định tại khoản 1 Điều này.",
  "concepts": [
    {
      "name": "Cai nghiện ma túy",
      "meaning": "Biện pháp do Nhà nước áp dụng để giúp người nghiện ma túy từ bỏ việc sử dụng ma túy.",
      "attrs": [
        "Tính chất: Biện pháp của Nhà nước",
        "Đối tượng: Người nghiện ma túy",
        "Mục đích: Từ bỏ việc sử dụng ma túy"
      ],
      "keyphrases": [
        "cai nghiện ma túy",
        "biện pháp cai nghiện thích hợp"
      ],
      "similar": [
        "điều trị nghiện ma túy",
        "chữa trị nghiện ma túy"
      ]
    },
    {
      "name": "Người nghiện ma túy",
      "meaning": "Người sử dụng chất ma túy và bị lệ thuộc vào chất ma túy đó.",
      "attrs": [
        "Hành vi: Sử dụng chất ma túy",
        "Trạng thái: Lệ thuộc vào chất ma túy"
      ],
      "keyphrases": [
        "người nghiện ma túy"
      ],
      "similar": [
        "con nghiện"
      ]
    },
    {
      "name": "Người bị tạm giam",
      "meaning": "Người đang bị áp dụng biện pháp tạm giam theo quy định của pháp luật tố tụng hình sự.",
      "attrs": [
        "Tình trạng pháp lý: Bị tạm giam",
        "Cơ sở pháp lý: Pháp luật tố tụng hình sự"
      ],
      "keyphrases": [
        "người bị tạm giam"
      ],
      "similar": [
        "bị can",
        "bị cáo đang bị tạm giam"
      ]
    },
    {
      "name": "Phạm nhân",
      "meaning": "Người đã bị tòa án kết tội và đang chấp hành hình phạt tù tại trại giam.",
      "attrs": [
        "Tình trạng pháp lý: Đã bị kết tội",
        "Hành vi: Chấp hành hình phạt tù"
      ],
      "keyphrases": [
        "phạm nhân"
      ],
      "similar": [
        "tù nhân"
      ]
    },
    {
      "name": "Trại viên cơ sở giáo dục bắt buộc",
      "meaning": "Người đang chấp hành quyết định đưa vào cơ sở giáo dục bắt buộc.",
      "attrs": [
        "Tình trạng pháp lý: Chấp hành quyết định đưa vào cơ sở giáo dục bắt buộc",
        "Địa điểm: Cơ sở giáo dục bắt buộc"
      ],
      "keyphrases": [
        "trại viên cơ sở giáo dục bắt buộc"
      ],
      "similar": []
    },
    {
      "name": "Học sinh trường giáo dưỡng",
      "meaning": "Người đang chấp hành quyết định đưa vào trường giáo dưỡng.",
      "attrs": [
        "Tình trạng pháp lý: Chấp hành quyết định đưa vào trường giáo dưỡng",
        "Địa điểm: Trường giáo dưỡng"
      ],
      "keyphrases": [
        "học sinh trường giáo dưỡng"
      ],
      "similar": []
    },
    {
      "name": "Giám thị trại giam",
      "meaning": "Người đứng đầu hoặc người có thẩm quyền quản lý trại giam.",
      "attrs": [
        "Chức vụ: Người đứng đầu/quản lý",
        "Địa điểm: Trại giam"
      ],
      "keyphrases": [
        "giám thị trại giam"
      ],
      "similar": []
    },
    {
      "name": "Giám thị trại tạm giam",
      "meaning": "Người đứng đầu hoặc người có thẩm quyền quản lý trại tạm giam.",
      "attrs": [
        "Chức vụ: Người đứng đầu/quản lý",
        "Địa điểm: Trại tạm giam"
      ],
      "keyphrases": [
        "giám thị trại tạm giam"
      ],
      "similar": []
    },
    {
      "name": "Trưởng nhà tạm giữ",
      "meaning": "Người đứng đầu hoặc người có thẩm quyền quản lý nhà tạm giữ.",
      "attrs": [
        "Chức vụ: Người đứng đầu/quản lý",
        "Địa điểm: Nhà tạm giữ"
      ],
      "keyphrases": [
        "trưởng nhà tạm giữ"
      ],
      "similar": []
    },
    {
      "name": "Giám đốc cơ sở giáo dục bắt buộc",
      "meaning": "Người đứng đầu hoặc người có thẩm quyền quản lý cơ sở giáo dục bắt buộc.",
      "attrs": [
        "Chức vụ: Người đứng đầu/quản lý",
        "Địa điểm: Cơ sở giáo dục bắt buộc"
      ],
      "keyphrases": [
        "giám đốc cơ sở giáo dục bắt buộc"
      ],
      "similar": []
    },
    {
      "name": "Hiệu trưởng trường giáo dưỡng",
      "meaning": "Người đứng đầu hoặc người có thẩm quyền quản lý trường giáo dưỡng.",
      "attrs": [
        "Chức vụ: Người đứng đầu/quản lý",
        "Địa điểm: Trường giáo dưỡng"
      ],
      "keyphrases": [
        "hiệu trưởng trường giáo dưỡng"
      ],
      "similar": []
    },
    {
      "name": "Cơ sở y tế tại địa phương",
      "meaning": "Các cơ sở khám chữa bệnh, chăm sóc sức khỏe nằm trên địa bàn nơi có các cơ sở giam giữ, giáo dục.",
      "attrs": [
        "Loại hình: Cơ sở khám chữa bệnh",
        "Vị trí: Địa phương"
      ],
      "keyphrases": [
        "cơ sở y tế tại địa phương"
      ],
      "similar": [
        "bệnh viện địa phương",
        "trung tâm y tế địa phương"
      ]
    }
  ]
},
{
  "article_id": "article_39",
  "article_number": "39",
  "text": "Điều 39. Miễn chấp hành thời gian còn lại trong quyết định đưa vào cơ sở cai nghiện bắt buộc đối với người từ đủ 14 tuổi đến dưới 18 tuổi đang cai nghiện ma túy bắt buộc\nNgười từ đủ 14 tuổi đến dưới 18 tuổi đang cai nghiện ma túy bắt buộc mà bị phát hiện thực hiện hành vi phạm tội trước hoặc trong thời gian chấp hành quyết định cai nghiện ma túy bắt buộc và bị Tòa án xử phạt tù nhưng không được hưởng án treo thì được miễn chấp hành thời gian còn lại trong quyết định đưa vào cơ sở cai nghiện bắt buộc.",
  "concepts": [
    {
      "name": "Miễn chấp hành thời gian còn lại",
      "meaning": "Việc không phải tiếp tục thực hiện phần thời gian còn lại của quyết định đưa vào cơ sở cai nghiện bắt buộc.",
      "attrs": [
        "Áp dụng cho người từ đủ 14 tuổi đến dưới 18 tuổi",
        "Đang cai nghiện ma túy bắt buộc",
        "Bị phát hiện thực hiện hành vi phạm tội",
        "Bị Tòa án xử phạt tù nhưng không được hưởng án treo"
      ],
      "keyphrases": [
        "miễn chấp hành thời gian còn lại",
        "quyết định đưa vào cơ sở cai nghiện bắt buộc"
      ],
      "similar": [
        "chấm dứt thi hành quyết định",
        "không tiếp tục chấp hành"
      ]
    },
    {
      "name": "Người từ đủ 14 tuổi đến dưới 18 tuổi đang cai nghiện ma túy bắt buộc",
      "meaning": "Chỉ đối tượng là người chưa thành niên, từ 14 đến dưới 18 tuổi, đang trong quá trình thực hiện biện pháp cai nghiện ma túy theo quyết định của cơ quan có thẩm quyền.",
      "attrs": [
        "Độ tuổi: từ đủ 14 tuổi đến dưới 18 tuổi",
        "Tình trạng: đang cai nghiện ma túy bắt buộc"
      ],
      "keyphrases": [
        "người từ đủ 14 tuổi đến dưới 18 tuổi",
        "cai nghiện ma túy bắt buộc"
      ],
      "similar": [
        "người chưa thành niên cai nghiện bắt buộc",
        "trẻ vị thành niên cai nghiện bắt buộc"
      ]
    },
    {
      "name": "Hành vi phạm tội",
      "meaning": "Hành vi vi phạm pháp luật hình sự, được quy định trong Bộ luật Hình sự.",
      "attrs": [
        "Vi phạm pháp luật hình sự",
        "Bị phát hiện trước hoặc trong thời gian chấp hành quyết định cai nghiện"
      ],
      "keyphrases": [
        "hành vi phạm tội"
      ],
      "similar": [
        "tội phạm",
        "vi phạm pháp luật hình sự"
      ]
    },
    {
      "name": "Xử phạt tù nhưng không được hưởng án treo",
      "meaning": "Hình phạt tù giam mà Tòa án áp dụng đối với người phạm tội, và không cho hưởng hình phạt án treo.",
      "attrs": [
        "Hình phạt: tù giam",
        "Không được hưởng án treo"
      ],
      "keyphrases": [
        "xử phạt tù",
        "không được hưởng án treo"
      ],
      "similar": [
        "phải chấp hành hình phạt tù",
        "không được hưởng sự khoan hồng của pháp luật"
      ]
    },
    {
      "name": "Quyết định đưa vào cơ sở cai nghiện bắt buộc",
      "meaning": "Văn bản pháp lý của cơ quan nhà nước có thẩm quyền, yêu cầu một người phải thực hiện cai nghiện ma túy tại một cơ sở cai nghiện được chỉ định.",
      "attrs": [
        "Do cơ quan có thẩm quyền ban hành",
        "Yêu cầu cai nghiện ma túy",
        "Thực hiện tại cơ sở cai nghiện"
      ],
      "keyphrases": [
        "quyết định đưa vào cơ sở cai nghiện bắt buộc"
      ],
      "similar": [
        "lệnh đưa vào trung tâm cai nghiện",
        "quyết định cai nghiện bắt buộc"
      ]
    }
  ]
},
{
  "article_id": "article_40",
  "article_number": "40",
  "text": "Điều 40. Quản lý sau cai nghiện ma túy tại nơi cư trú\n1. Người đã hoàn thành cai nghiện ma túy tự nguyện, người đã hoàn thành điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế, người từ đủ 12 tuổi đến dưới 18 tuổi đã chấp hành xong quyết định đưa vào cơ sở cai nghiện bắt buộc chịu sự quản lý sau cai nghiện ma túy trong thời hạn 01 năm kể từ ngày hoàn thành việc cai nghiện hoặc chấp hành xong quyết định.\n2. Người đã chấp hành xong quyết định áp dụng biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc chịu sự quản lý sau cai nghiện ma túy trong thời hạn 02 năm kể từ ngày chấp hành xong quyết định.\n3. Nội dung quản lý sau cai nghiện ma túy bao gồm:\na) Lập danh sách người bị quản lý sau cai nghiện ma túy;\nb) Tư vấn, giúp đỡ, phòng, chống tái nghiện ma túy;\nc) Theo dõi, phát hiện, ngăn chặn hành vi sử dụng trái phép chất ma túy.\n4. Hỗ trợ xã hội trong thời gian quản lý sau cai nghiện ma túy bao gồm:\na) Hỗ trợ học văn hóa đối với người từ đủ 12 tuổi đến dưới 18 tuổi;\nb) Hỗ trợ học nghề, vay vốn, tìm việc làm và tham gia các hoạt động xã hội để hòa nhập cộng đồng.\n5. Chủ tịch Ủy ban nhân dân cấp xã ra quyết định và tổ chức quản lý, hỗ trợ xã hội sau cai nghiện ma túy.\n6. Chính phủ quy định hồ sơ, trình tự, thủ tục, chế độ quản lý và chính sách hỗ trợ cho người bị quản lý sau cai nghiện ma túy.",
  "concepts": [
    {
      "name": "Quản lý sau cai nghiện ma túy",
      "meaning": "Hoạt động quản lý, theo dõi, hỗ trợ người đã hoàn thành cai nghiện ma túy nhằm phòng, chống tái nghiện và hòa nhập cộng đồng.",
      "attrs": [
        "Thời hạn quản lý (1 năm hoặc 2 năm)",
        "Nội dung quản lý (lập danh sách, tư vấn, theo dõi)",
        "Hỗ trợ xã hội (học văn hóa, học nghề, vay vốn, tìm việc làm)",
        "Chủ thể thực hiện (Chủ tịch UBND cấp xã)"
      ],
      "keyphrases": [
        "quản lý sau cai nghiện ma túy",
        "nội dung quản lý sau cai nghiện ma túy",
        "hỗ trợ xã hội trong thời gian quản lý sau cai nghiện ma túy"
      ],
      "similar": [
        "quản lý sau điều trị nghiện",
        "theo dõi sau cai nghiện"
      ]
    },
    {
      "name": "Người thuộc diện quản lý sau cai nghiện",
      "meaning": "Các đối tượng phải chịu sự quản lý sau khi hoàn thành quá trình cai nghiện ma túy.",
      "attrs": [
        "Người đã hoàn thành cai nghiện ma túy tự nguyện",
        "Người đã hoàn thành điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
        "Người từ đủ 12 tuổi đến dưới 18 tuổi đã chấp hành xong quyết định đưa vào cơ sở cai nghiện bắt buộc",
        "Người đã chấp hành xong quyết định áp dụng biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc"
      ],
      "keyphrases": [
        "người đã hoàn thành cai nghiện ma túy tự nguyện",
        "người đã hoàn thành điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
        "người từ đủ 12 tuổi đến dưới 18 tuổi đã chấp hành xong quyết định đưa vào cơ sở cai nghiện bắt buộc",
        "người đã chấp hành xong quyết định áp dụng biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc"
      ],
      "similar": [
        "đối tượng quản lý sau cai nghiện",
        "người bị quản lý sau cai nghiện ma túy"
      ]
    },
    {
      "name": "Hỗ trợ xã hội sau cai nghiện",
      "meaning": "Các biện pháp hỗ trợ về giáo dục, nghề nghiệp, tài chính và xã hội nhằm giúp người sau cai nghiện tái hòa nhập cộng đồng.",
      "attrs": [
        "Hỗ trợ học văn hóa",
        "Hỗ trợ học nghề",
        "Hỗ trợ vay vốn",
        "Hỗ trợ tìm việc làm",
        "Tham gia các hoạt động xã hội"
      ],
      "keyphrases": [
        "hỗ trợ xã hội trong thời gian quản lý sau cai nghiện ma túy",
        "hỗ trợ học văn hóa",
        "hỗ trợ học nghề",
        "hỗ trợ vay vốn",
        "hỗ trợ tìm việc làm",
        "tham gia các hoạt động xã hội"
      ],
      "similar": [
        "trợ giúp tái hòa nhập cộng đồng",
        "hỗ trợ tái hòa nhập xã hội"
      ]
    },
    {
      "name": "Cơ sở cai nghiện bắt buộc",
      "meaning": "Cơ sở do nhà nước thành lập để thực hiện việc cai nghiện ma túy bắt buộc theo quyết định của cơ quan có thẩm quyền.",
      "attrs": [],
      "keyphrases": [
        "cơ sở cai nghiện bắt buộc"
      ],
      "similar": []
    },
    {
      "name": "Ủy ban nhân dân cấp xã",
      "meaning": "Cơ quan hành chính nhà nước ở cấp xã, có thẩm quyền ra quyết định và tổ chức quản lý, hỗ trợ xã hội sau cai nghiện ma túy.",
      "attrs": [
        "Cấp xã",
        "Ra quyết định quản lý sau cai nghiện",
        "Tổ chức quản lý sau cai nghiện",
        "Tổ chức hỗ trợ xã hội sau cai nghiện"
      ],
      "keyphrases": [
        "Ủy ban nhân dân cấp xã"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_41",
  "article_number": "41",
  "text": "Điều 41. Biện pháp can thiệp giảm tác hại đối với người sử dụng trái phép chất ma túy và người nghiện ma túy\n1. Biện pháp can thiệp giảm tác hại đối với người sử dụng trái phép chất ma túy và người nghiện ma túy là biện pháp làm giảm tác hại liên quan đến hành vi sử dụng trái phép chất ma túy gây ra cho bản thân, gia đình và cộng đồng.\n2. Biện pháp can thiệp giảm tác hại đối với người sử dụng trái phép chất ma túy và người nghiện ma túy bao gồm:\na) Điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế;\nb) Các biện pháp khác theo quy định của Chính phủ.",
  "concepts": [
    {
      "name": "Biện pháp can thiệp giảm tác hại",
      "meaning": "Các hành động nhằm giảm thiểu những tác động tiêu cực do việc sử dụng trái phép chất ma túy gây ra cho cá nhân người sử dụng, gia đình và xã hội.",
      "attrs": [
        "Mục tiêu: giảm tác hại",
        "Đối tượng: người sử dụng trái phép chất ma túy, người nghiện ma túy",
        "Phạm vi: bản thân, gia đình, cộng đồng"
      ],
      "keyphrases": [
        "biện pháp can thiệp giảm tác hại",
        "giảm tác hại liên quan đến hành vi sử dụng trái phép chất ma túy",
        "người sử dụng trái phép chất ma túy",
        "người nghiện ma túy",
        "bản thân",
        "gia đình",
        "cộng đồng"
      ],
      "similar": [
        "giảm thiểu tác động tiêu cực",
        "hạn chế tác hại"
      ]
    },
    {
      "name": "Điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
      "meaning": "Một biện pháp can thiệp giảm tác hại cụ thể, sử dụng thuốc để thay thế các chất dạng thuốc phiện mà người nghiện đang sử dụng.",
      "attrs": [
        "Loại biện pháp: điều trị nghiện",
        "Đối tượng: người nghiện các chất dạng thuốc phiện",
        "Phương pháp: sử dụng thuốc thay thế"
      ],
      "keyphrases": [
        "điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế"
      ],
      "similar": [
        "điều trị thay thế",
        "sử dụng thuốc thay thế"
      ]
    },
    {
      "name": "Các biện pháp khác (theo quy định của Chính phủ)",
      "meaning": "Các biện pháp can thiệp giảm tác hại khác, ngoài điều trị nghiện bằng thuốc thay thế, được quy định cụ thể bởi Chính phủ.",
      "attrs": [
        "Loại biện pháp: can thiệp giảm tác hại",
        "Nguồn quy định: Chính phủ"
      ],
      "keyphrases": [
        "các biện pháp khác",
        "theo quy định của Chính phủ"
      ],
      "similar": [
        "biện pháp do Chính phủ quy định"
      ]
    }
  ]
},
{
  "article_id": "article_42",
  "article_number": "42",
  "text": "Điều 42. Trách nhiệm của gia đình người nghiện ma túy, cộng đồng\n1. Gia đình người nghiện ma túy có trách nhiệm sau đây:\na) Hỗ trợ người nghiện ma túy trong quá trình cai nghiện ma túy, sau cai nghiện ma túy và hòa nhập cộng đồng;\nb) Phối hợp với cơ quan, người có thẩm quyền trong việc lập hồ sơ áp dụng biện pháp cai nghiện ma túy bắt buộc; phối hợp với cơ quan, tổ chức, đơn vị có liên quan hỗ trợ người nghiện ma túy trong quá trình cai nghiện ma túy, quản lý sau cai nghiện ma túy và hòa nhập cộng đồng.\n2. Cộng đồng nơi người nghiện ma túy cư trú có trách nhiệm sau đây:\na) Động viên, giúp đỡ người nghiện ma túy;\nb) Phối hợp với cơ quan, tổ chức, đơn vị có liên quan hỗ trợ người nghiện ma túy trong quá trình cai nghiện ma túy, quản lý sau cai nghiện ma túy và hòa nhập cộng đồng.",
  "concepts": [
    {
      "name": "Gia đình người nghiện ma túy",
      "meaning": "Chủ thể có trách nhiệm hỗ trợ người nghiện ma túy trong quá trình cai nghiện, sau cai nghiện và hòa nhập cộng đồng, cũng như phối hợp với các cơ quan có thẩm quyền.",
      "attrs": [
        "Có người thân là người nghiện ma túy",
        "Có trách nhiệm hỗ trợ người nghiện",
        "Phối hợp với cơ quan chức năng"
      ],
      "keyphrases": [
        "gia đình người nghiện ma túy",
        "hỗ trợ người nghiện ma túy",
        "cai nghiện ma túy",
        "sau cai nghiện ma túy",
        "hòa nhập cộng đồng",
        "lập hồ sơ áp dụng biện pháp cai nghiện ma túy bắt buộc",
        "quản lý sau cai nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Cộng đồng nơi người nghiện ma túy cư trú",
      "meaning": "Tập thể những người sinh sống tại địa phương nơi người nghiện ma túy cư trú, có trách nhiệm động viên, giúp đỡ và phối hợp hỗ trợ người nghiện ma túy.",
      "attrs": [
        "Địa bàn cư trú của người nghiện ma túy",
        "Có trách nhiệm động viên, giúp đỡ",
        "Phối hợp với cơ quan chức năng"
      ],
      "keyphrases": [
        "cộng đồng nơi người nghiện ma túy cư trú",
        "động viên, giúp đỡ người nghiện ma túy",
        "cai nghiện ma túy",
        "quản lý sau cai nghiện ma túy",
        "hòa nhập cộng đồng"
      ],
      "similar": []
    },
    {
      "name": "Cai nghiện ma túy",
      "meaning": "Quá trình giúp người nghiện ma túy từ bỏ việc sử dụng chất ma túy.",
      "attrs": [
        "Quá trình từ bỏ ma túy",
        "Có thể tự nguyện hoặc bắt buộc",
        "Cần sự hỗ trợ của gia đình, cộng đồng và cơ quan chức năng"
      ],
      "keyphrases": [
        "cai nghiện ma túy",
        "biện pháp cai nghiện ma túy bắt buộc"
      ],
      "similar": [
        "chữa trị nghiện ma túy",
        "điều trị nghiện ma túy"
      ]
    },
    {
      "name": "Sau cai nghiện ma túy",
      "meaning": "Giai đoạn tiếp theo sau quá trình cai nghiện, tập trung vào việc duy trì trạng thái không sử dụng ma túy và tái hòa nhập cộng đồng.",
      "attrs": [
        "Giai đoạn sau cai nghiện",
        "Duy trì trạng thái không sử dụng ma túy",
        "Tái hòa nhập cộng đồng"
      ],
      "keyphrases": [
        "sau cai nghiện ma túy",
        "quản lý sau cai nghiện ma túy"
      ],
      "similar": [
        "giai đoạn hậu cai nghiện"
      ]
    },
    {
      "name": "Hòa nhập cộng đồng",
      "meaning": "Quá trình người nghiện ma túy tái hòa nhập vào các hoạt động xã hội, kinh tế và văn hóa sau khi cai nghiện.",
      "attrs": [
        "Tái hòa nhập xã hội",
        "Tham gia các hoạt động xã hội",
        "Phục hồi các mối quan hệ"
      ],
      "keyphrases": [
        "hòa nhập cộng đồng"
      ],
      "similar": [
        "tái hòa nhập xã hội"
      ]
    },
    {
      "name": "Hồ sơ áp dụng biện pháp cai nghiện ma túy bắt buộc",
      "meaning": "Tài liệu pháp lý cần thiết để thực hiện việc cai nghiện ma túy một cách cưỡng chế đối với người nghiện.",
      "attrs": [
        "Tài liệu pháp lý",
        "Cai nghiện bắt buộc",
        "Cần sự phối hợp của gia đình và cơ quan chức năng"
      ],
      "keyphrases": [
        "lập hồ sơ áp dụng biện pháp cai nghiện ma túy bắt buộc"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_43",
  "article_number": "43",
  "text": "Điều 43. Lập danh sách người nghiện ma túy, người bị quản lý sau cai nghiện ma túy\n1. Công an cấp xã giúp Ủy ban nhân dân cùng cấp lập danh sách người nghiện ma túy và người bị quản lý sau cai nghiện ma túy cư trú tại địa phương.\n2. Khi người nghiện ma túy, người bị quản lý sau cai nghiện ma túy thay đổi nơi cư trú thì công an cấp xã nơi chuyển đi có trách nhiệm thông báo cho công an cấp xã nơi chuyển đến trong thời hạn 05 ngày làm việc kể từ ngày người đó chuyển khỏi địa phương để đưa vào danh sách và phối hợp quản lý.\n3. Công an cấp xã giúp Ủy ban nhân dân cùng cấp đưa ra khỏi danh sách người nghiện ma túy, người bị quản lý sau cai nghiện ma túy đối với các trường hợp sau đây:\na) Trong thời hạn quản lý sau cai nghiện ma túy quy định tại khoản 1 và khoản 2",
  "concepts": [
    {
      "name": "Danh sách người nghiện ma túy",
      "meaning": "Danh sách bao gồm những cá nhân được xác định là nghiện ma túy và cư trú tại một địa phương cụ thể.",
      "attrs": [
        "được lập bởi Công an cấp xã giúp Ủy ban nhân dân cùng cấp",
        "chứa thông tin người nghiện ma túy cư trú tại địa phương"
      ],
      "keyphrases": [
        "danh sách người nghiện ma túy",
        "người nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Danh sách người bị quản lý sau cai nghiện ma túy",
      "meaning": "Danh sách bao gồm những cá nhân đang trong giai đoạn quản lý sau khi cai nghiện ma túy và cư trú tại một địa phương cụ thể.",
      "attrs": [
        "được lập bởi Công an cấp xã giúp Ủy ban nhân dân cùng cấp",
        "chứa thông tin người bị quản lý sau cai nghiện ma túy cư trú tại địa phương"
      ],
      "keyphrases": [
        "danh sách người bị quản lý sau cai nghiện ma túy",
        "người bị quản lý sau cai nghiện ma túy"
      ],
      "similar": []
    },
    {
      "name": "Công an cấp xã",
      "meaning": "Cơ quan công an tại cấp hành chính xã, có trách nhiệm hỗ trợ Ủy ban nhân dân cùng cấp trong việc quản lý người nghiện ma túy và người bị quản lý sau cai nghiện.",
      "attrs": [
        "giúp Ủy ban nhân dân cùng cấp lập danh sách",
        "thông báo khi có thay đổi nơi cư trú",
        "phối hợp quản lý"
      ],
      "keyphrases": [
        "Công an cấp xã"
      ],
      "similar": []
    },
    {
      "name": "Ủy ban nhân dân cấp xã",
      "meaning": "Cơ quan hành chính nhà nước ở cấp xã, có trách nhiệm quản lý người nghiện ma túy và người bị quản lý sau cai nghiện ma túy trên địa bàn.",
      "attrs": [
        "được Công an cấp xã giúp lập danh sách",
        "đưa ra khỏi danh sách"
      ],
      "keyphrases": [
        "Ủy ban nhân dân cùng cấp"
      ],
      "similar": []
    },
    {
      "name": "Thay đổi nơi cư trú",
      "meaning": "Việc người nghiện ma túy hoặc người bị quản lý sau cai nghiện ma túy chuyển từ địa phương này sang địa phương khác.",
      "attrs": [
        "thông báo cho công an cấp xã nơi chuyển đến",
        "thời hạn thông báo 05 ngày làm việc"
      ],
      "keyphrases": [
        "thay đổi nơi cư trú",
        "chuyển khỏi địa phương",
        "nơi chuyển đến"
      ],
      "similar": []
    },
    {
      "name": "Quản lý sau cai nghiện ma túy",
      "meaning": "Giai đoạn tiếp theo sau quá trình cai nghiện ma túy, trong đó người đã cai nghiện được theo dõi và hỗ trợ để duy trì trạng thái không sử dụng ma túy.",
      "attrs": [
        "thời hạn quản lý",
        "đưa ra khỏi danh sách khi hết thời hạn"
      ],
      "keyphrases": [
        "quản lý sau cai nghiện ma túy"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_40",
  "article_number": "40",
  "text": "Điều 40 của Luật này mà không phát hiện người đó sử dụng trái phép chất ma túy;\nb) Người nghiện ma túy, người bị quản lý sau cai nghiện ma túy phải thi hành án phạt tù;\nc) Người nghiện ma túy, người bị quản lý sau cai nghiện ma túy chuyển đến cư trú ở địa phương khác;\nd) Người nghiện ma túy, người bị quản lý sau cai nghiện ma túy chết, bị Tòa án tuyên bố mất tích.\nChương VI\nQUẢN LÝ NHÀ NƯỚC VỀ PHÒNG, CHỐNG MA TÚY",
  "concepts": [
    {
      "name": "Sử dụng trái phép chất ma túy",
      "meaning": "Hành vi sử dụng chất ma túy không được pháp luật cho phép.",
      "attrs": [
        "Tính trái phép",
        "Liên quan đến chất ma túy"
      ],
      "keyphrases": [
        "sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "nghiện ma túy",
        "lạm dụng ma túy"
      ]
    },
    {
      "name": "Người nghiện ma túy",
      "meaning": "Người lệ thuộc vào chất ma túy, có nhu cầu sử dụng thường xuyên và không thể kiểm soát được việc sử dụng.",
      "attrs": [
        "Lệ thuộc vào ma túy",
        "Mất kiểm soát",
        "Có nhu cầu sử dụng thường xuyên"
      ],
      "keyphrases": [
        "người nghiện ma túy"
      ],
      "similar": [
        "con nghiện"
      ]
    },
    {
      "name": "Quản lý sau cai nghiện ma túy",
      "meaning": "Biện pháp quản lý, hỗ trợ người đã cai nghiện ma túy để giúp họ tái hòa nhập cộng đồng và tránh tái nghiện.",
      "attrs": [
        "Sau cai nghiện",
        "Mục đích tái hòa nhập",
        "Phòng ngừa tái nghiện"
      ],
      "keyphrases": [
        "quản lý sau cai nghiện ma túy",
        "người bị quản lý sau cai nghiện ma túy"
      ],
      "similar": [
        "hỗ trợ sau cai nghiện"
      ]
    },
    {
      "name": "Thi hành án phạt tù",
      "meaning": "Việc thực hiện bản án phạt tù đã có hiệu lực pháp luật đối với người phạm tội.",
      "attrs": [
        "Bản án có hiệu lực",
        "Hình phạt tù",
        "Thực hiện theo quy định pháp luật"
      ],
      "keyphrases": [
        "thi hành án phạt tù"
      ],
      "similar": [
        "chấp hành án phạt tù"
      ]
    },
    {
      "name": "Cư trú ở địa phương khác",
      "meaning": "Việc chuyển đến sinh sống và làm việc tại một địa phương khác với nơi cư trú ban đầu.",
      "attrs": [
        "Thay đổi nơi ở",
        "Địa phương khác"
      ],
      "keyphrases": [
        "chuyển đến cư trú ở địa phương khác"
      ],
      "similar": [
        "thay đổi nơi cư trú"
      ]
    },
    {
      "name": "Tuyên bố mất tích",
      "meaning": "Quyết định của Tòa án công nhận một người mất tích theo quy định của pháp luật.",
      "attrs": [
        "Quyết định của Tòa án",
        "Người mất tích",
        "Căn cứ pháp luật"
      ],
      "keyphrases": [
        "Tòa án tuyên bố mất tích",
        "bị Tòa án tuyên bố mất tích"
      ],
      "similar": [
        "xác nhận mất tích"
      ]
    },
    {
      "name": "Quản lý nhà nước về phòng, chống ma túy",
      "meaning": "Hoạt động của Nhà nước nhằm kiểm soát, ngăn chặn và giảm thiểu tác hại của ma túy đối với xã hội.",
      "attrs": [
        "Hoạt động của Nhà nước",
        "Phòng ngừa",
        "Kiểm soát",
        "Giảm thiểu tác hại"
      ],
      "keyphrases": [
        "Quản lý nhà nước về phòng, chống ma túy"
      ],
      "similar": [
        "Công tác phòng, chống ma túy của Nhà nước"
      ]
    }
  ]
},
{
  "article_id": "article_44",
  "article_number": "44",
  "text": "Điều 44. Nội dung quản lý nhà nước về phòng, chống ma túy\n1. Xây dựng và tổ chức thực hiện chiến lược, chủ trương, chính sách, kế hoạch về phòng, chống ma túy.\n2. Ban hành và tổ chức thực hiện các văn bản quy phạm pháp luật về phòng, chống ma túy.\n3. Tổ chức bộ máy, đào tạo, bồi dưỡng người làm công tác phòng, chống ma túy.\n4. Kiểm soát các hoạt động hợp pháp liên quan đến ma túy.\n5. Thực hiện công tác cai nghiện ma túy và quản lý sau cai nghiện ma túy.\n6. Tổ chức đấu tranh phòng, chống ma túy.\n7. Thực hiện thống kê nhà nước về phòng, chống ma túy.\n8. Tổ chức nghiên cứu, ứng dụng tiến bộ khoa học và công nghệ về phòng, chống ma túy.\n9. Tổ chức tuyên truyền, giáo dục về phòng, chống ma túy.\n10. Hợp tác quốc tế về phòng, chống ma túy.\n11. Khen thưởng, kiểm tra, thanh tra, giải quyết khiếu nại, tố cáo và xử lý vi phạm pháp luật về phòng, chống ma túy.",
  "concepts": [
    {
      "name": "Quản lý nhà nước về phòng, chống ma túy",
      "meaning": "Các hoạt động của nhà nước nhằm đảm bảo hiệu quả công tác phòng, chống ma túy.",
      "attrs": [
        "Xây dựng và thực hiện chiến lược, chính sách",
        "Ban hành văn bản quy phạm pháp luật",
        "Tổ chức bộ máy và đào tạo nhân lực",
        "Kiểm soát hoạt động hợp pháp liên quan đến ma túy",
        "Thực hiện cai nghiện và quản lý sau cai",
        "Tổ chức đấu tranh phòng, chống ma túy",
        "Thống kê nhà nước",
        "Nghiên cứu và ứng dụng khoa học công nghệ",
        "Tuyên truyền, giáo dục",
        "Hợp tác quốc tế",
        "Khen thưởng, kiểm tra, thanh tra, giải quyết khiếu nại, tố cáo và xử lý vi phạm"
      ],
      "keyphrases": [
        "Nội dung quản lý nhà nước về phòng, chống ma túy"
      ],
      "similar": [
        "Hoạt động quản lý của nhà nước trong lĩnh vực phòng, chống ma túy"
      ]
    },
    {
      "name": "Chiến lược, chủ trương, chính sách, kế hoạch về phòng, chống ma túy",
      "meaning": "Các định hướng, giải pháp tổng thể và cụ thể của nhà nước nhằm phòng ngừa và đấu tranh với tệ nạn ma túy.",
      "attrs": [
        "Được xây dựng và tổ chức thực hiện bởi nhà nước",
        "Nhằm mục tiêu phòng, chống ma túy"
      ],
      "keyphrases": [
        "chiến lược",
        "chủ trương",
        "chính sách",
        "kế hoạch",
        "phòng, chống ma túy"
      ],
      "similar": [
        "Đường lối, biện pháp phòng, chống ma túy"
      ]
    },
    {
      "name": "Văn bản quy phạm pháp luật về phòng, chống ma túy",
      "meaning": "Các văn bản do cơ quan nhà nước có thẩm quyền ban hành, quy định về các vấn đề liên quan đến phòng, chống ma túy.",
      "attrs": [
        "Do cơ quan nhà nước ban hành",
        "Quy định về phòng, chống ma túy"
      ],
      "keyphrases": [
        "văn bản quy phạm pháp luật",
        "phòng, chống ma túy"
      ],
      "similar": [
        "Quy định pháp luật về ma túy"
      ]
    },
    {
      "name": "Công tác cai nghiện ma túy và quản lý sau cai nghiện ma túy",
      "meaning": "Các hoạt động hỗ trợ người nghiện ma túy phục hồi và tái hòa nhập cộng đồng, đồng thời ngăn ngừa tái nghiện.",
      "attrs": [
        "Cai nghiện ma túy",
        "Quản lý sau cai nghiện ma túy"
      ],
      "keyphrases": [
        "cai nghiện ma túy",
        "quản lý sau cai nghiện ma túy"
      ],
      "similar": [
        "Phục hồi và tái hòa nhập cho người nghiện ma túy"
      ]
    },
    {
      "name": "Kiểm soát các hoạt động hợp pháp liên quan đến ma túy",
      "meaning": "Việc nhà nước giám sát, quản lý chặt chẽ các hoạt động sản xuất, kinh doanh, sử dụng ma túy vào mục đích hợp pháp (ví dụ: y tế, nghiên cứu khoa học) để tránh bị lợi dụng vào mục đích bất hợp pháp.",
      "attrs": [
        "Hoạt động hợp pháp",
        "Liên quan đến ma túy",
        "Kiểm soát"
      ],
      "keyphrases": [
        "Kiểm soát",
        "hoạt động hợp pháp",
        "liên quan đến ma túy"
      ],
      "similar": [
        "Quản lý các hoạt động sử dụng ma túy hợp pháp"
      ]
    },
    {
      "name": "Đấu tranh phòng, chống ma túy",
      "meaning": "Các hoạt động điều tra, truy tố, xét xử các hành vi vi phạm pháp luật liên quan đến ma túy.",
      "attrs": [
        "Phòng, chống ma túy",
        "Đấu tranh"
      ],
      "keyphrases": [
        "đấu tranh",
        "phòng, chống ma túy"
      ],
      "similar": [
        "Chống tội phạm ma túy"
      ]
    },
    {
      "name": "Thống kê nhà nước về phòng, chống ma túy",
      "meaning": "Việc thu thập, xử lý, phân tích và công bố thông tin về tình hình ma túy trên phạm vi cả nước.",
      "attrs": [
        "Thống kê",
        "Nhà nước",
        "Phòng, chống ma túy"
      ],
      "keyphrases": [
        "thống kê nhà nước",
        "phòng, chống ma túy"
      ],
      "similar": [
        "Số liệu về tình hình ma túy"
      ]
    },
    {
      "name": "Hợp tác quốc tế về phòng, chống ma túy",
      "meaning": "Các hoạt động phối hợp với các quốc gia và tổ chức quốc tế trong việc phòng ngừa và đấu tranh với tệ nạn ma túy.",
      "attrs": [
        "Hợp tác",
        "Quốc tế",
        "Phòng, chống ma túy"
      ],
      "keyphrases": [
        "hợp tác quốc tế",
        "phòng, chống ma túy"
      ],
      "similar": [
        "Quan hệ quốc tế trong lĩnh vực ma túy"
      ]
    },
    {
      "name": "Xử lý vi phạm pháp luật về phòng, chống ma túy",
      "meaning": "Áp dụng các biện pháp xử lý theo quy định của pháp luật đối với các hành vi vi phạm pháp luật liên quan đến ma túy.",
      "attrs": [
        "Vi phạm pháp luật",
        "Phòng, chống ma túy",
        "Xử lý"
      ],
      "keyphrases": [
        "xử lý vi phạm pháp luật",
        "phòng, chống ma túy"
      ],
      "similar": [
        "Chế tài đối với hành vi vi phạm về ma túy"
      ]
    }
  ]
},
{
  "article_id": "article_45",
  "article_number": "45",
  "text": "Điều 45. Trách nhiệm quản lý nhà nước về phòng, chống ma túy\n1. Chính phủ thống nhất quản lý nhà nước về phòng, chống ma túy.\n2. Bộ Công an là cơ quan đầu mối giúp Chính phủ thực hiện quản lý nhà nước về phòng, chống ma túy.\n3. Các Bộ, cơ quan ngang Bộ, cơ quan thuộc Chính phủ, trong phạm vi nhiệm vụ, quyền hạn của mình, có trách nhiệm thực hiện và phối hợp với cơ quan, tổ chức có liên quan trong phòng, chống ma túy.\n4. Ủy ban nhân dân các cấp, trong phạm vi nhiệm vụ, quyền hạn của mình, thực hiện quản lý nhà nước về phòng, chống ma túy tại địa phương.",
  "concepts": [
    {
      "name": "Quản lý nhà nước về phòng, chống ma túy",
      "meaning": "Hoạt động quản lý của Nhà nước nhằm phòng ngừa, ngăn chặn và đấu tranh chống lại tệ nạn ma túy.",
      "attrs": [
        "Thống nhất quản lý",
        "Phạm vi nhiệm vụ, quyền hạn",
        "Thực hiện và phối hợp"
      ],
      "keyphrases": [
        "quản lý nhà nước về phòng, chống ma túy"
      ],
      "similar": [
        "Công tác phòng, chống ma túy",
        "Hoạt động phòng, chống ma túy"
      ]
    },
    {
      "name": "Chính phủ",
      "meaning": "Cơ quan hành chính nhà nước cao nhất của nước Cộng hòa xã hội chủ nghĩa Việt Nam, thực hiện quyền hành pháp.",
      "attrs": [
        "Thống nhất quản lý nhà nước về phòng, chống ma túy"
      ],
      "keyphrases": [
        "Chính phủ"
      ],
      "similar": [
        "Cơ quan hành chính nhà nước cao nhất"
      ]
    },
    {
      "name": "Bộ Công an",
      "meaning": "Cơ quan của Chính phủ, thực hiện chức năng quản lý nhà nước về an ninh quốc gia, trật tự, an toàn xã hội.",
      "attrs": [
        "Cơ quan đầu mối",
        "Giúp Chính phủ thực hiện quản lý nhà nước về phòng, chống ma túy"
      ],
      "keyphrases": [
        "Bộ Công an",
        "cơ quan đầu mối"
      ],
      "similar": []
    },
    {
      "name": "Các Bộ, cơ quan ngang Bộ, cơ quan thuộc Chính phủ",
      "meaning": "Các cơ quan thuộc hệ thống hành chính nhà nước, có chức năng quản lý nhà nước theo ngành, lĩnh vực.",
      "attrs": [
        "Phạm vi nhiệm vụ, quyền hạn",
        "Thực hiện và phối hợp với cơ quan, tổ chức có liên quan trong phòng, chống ma túy"
      ],
      "keyphrases": [
        "Bộ",
        "cơ quan ngang Bộ",
        "cơ quan thuộc Chính phủ"
      ],
      "similar": []
    },
    {
      "name": "Ủy ban nhân dân các cấp",
      "meaning": "Cơ quan hành chính nhà nước ở địa phương, chịu trách nhiệm quản lý nhà nước trên địa bàn.",
      "attrs": [
        "Phạm vi nhiệm vụ, quyền hạn",
        "Thực hiện quản lý nhà nước về phòng, chống ma túy tại địa phương"
      ],
      "keyphrases": [
        "Ủy ban nhân dân các cấp",
        "tại địa phương"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_46",
  "article_number": "46",
  "text": "Điều 46. Trách nhiệm của Bộ Công an\n1. Ban hành theo thẩm quyền hoặc trình cơ quan nhà nước có thẩm quyền ban hành văn bản quy phạm pháp luật về phòng, chống ma túy.\n2. Chủ trì, phối hợp với cơ quan, tổ chức có liên quan trong phòng, chống ma túy; tổ chức tiếp nhận và xử lý thông tin tội phạm về ma túy; kiểm soát các hoạt động hợp pháp liên quan đến ma túy theo thẩm quyền.\n3. Tổ chức công tác giám định chất ma túy và tiền chất.\n4. Đào tạo, bồi dưỡng người làm công tác điều tra, đấu tranh phòng, chống tội phạm về ma túy.\n5. Hướng dẫn việc lập danh sách người sử dụng trái phép chất ma túy, người nghiện ma túy, người bị quản lý sau cai nghiện ma túy.\n6. Chủ trì thực hiện thống kê nhà nước về phòng, chống ma túy; quản lý thông tin tội phạm về ma túy, người sử dụng trái phép chất ma túy, người nghiện ma túy, người bị quản lý sau cai nghiện ma túy và kết quả kiểm soát các hoạt động hợp pháp liên quan đến ma túy.\n7. Thực hiện hợp tác quốc tế về phòng, chống ma túy.",
  "concepts": [
    {
      "name": "Trách nhiệm của Bộ Công an",
      "meaning": "Các nghĩa vụ và quyền hạn mà Bộ Công an phải thực hiện trong lĩnh vực phòng, chống ma túy theo quy định của pháp luật.",
      "attrs": [
        "Ban hành văn bản quy phạm pháp luật",
        "Chủ trì, phối hợp phòng, chống ma túy",
        "Tiếp nhận và xử lý thông tin tội phạm về ma túy",
        "Kiểm soát các hoạt động hợp pháp liên quan đến ma túy",
        "Giám định chất ma túy và tiền chất",
        "Đào tạo, bồi dưỡng cán bộ",
        "Hướng dẫn lập danh sách người sử dụng trái phép, người nghiện, người bị quản lý sau cai",
        "Thống kê nhà nước về phòng, chống ma túy",
        "Quản lý thông tin liên quan đến ma túy",
        "Hợp tác quốc tế về phòng, chống ma túy"
      ],
      "keyphrases": [
        "Trách nhiệm của Bộ Công an",
        "Ban hành theo thẩm quyền",
        "phối hợp với cơ quan, tổ chức có liên quan",
        "tiếp nhận và xử lý thông tin tội phạm về ma túy",
        "kiểm soát các hoạt động hợp pháp liên quan đến ma túy",
        "giám định chất ma túy và tiền chất",
        "đào tạo, bồi dưỡng",
        "hướng dẫn việc lập danh sách",
        "thống kê nhà nước về phòng, chống ma túy",
        "quản lý thông tin",
        "hợp tác quốc tế về phòng, chống ma túy"
      ],
      "similar": [
        "Nghĩa vụ của Bộ Công an",
        "Quyền hạn của Bộ Công an trong phòng, chống ma túy"
      ]
    },
    {
      "name": "Văn bản quy phạm pháp luật về phòng, chống ma túy",
      "meaning": "Các văn bản do cơ quan nhà nước có thẩm quyền ban hành, quy định về các vấn đề liên quan đến phòng, chống ma túy.",
      "attrs": [
        "Do cơ quan nhà nước có thẩm quyền ban hành",
        "Quy định về phòng, chống ma túy"
      ],
      "keyphrases": [
        "văn bản quy phạm pháp luật về phòng, chống ma túy"
      ],
      "similar": [
        "Quy định pháp luật về phòng, chống ma túy",
        "Văn bản pháp luật về phòng, chống ma túy"
      ]
    },
    {
      "name": "Thông tin tội phạm về ma túy",
      "meaning": "Các dữ liệu, tin tức liên quan đến các hành vi vi phạm pháp luật trong lĩnh vực ma túy.",
      "attrs": [
        "Liên quan đến tội phạm ma túy",
        "Được tiếp nhận và xử lý"
      ],
      "keyphrases": [
        "thông tin tội phạm về ma túy"
      ],
      "similar": [
        "Tin tức về tội phạm ma túy",
        "Dữ liệu về tội phạm ma túy"
      ]
    },
    {
      "name": "Hoạt động hợp pháp liên quan đến ma túy",
      "meaning": "Các hoạt động được pháp luật cho phép liên quan đến ma túy, ví dụ như sản xuất, kinh doanh, sử dụng trong y tế, nghiên cứu khoa học.",
      "attrs": [
        "Được pháp luật cho phép",
        "Liên quan đến ma túy"
      ],
      "keyphrases": [
        "hoạt động hợp pháp liên quan đến ma túy"
      ],
      "similar": [
        "Hoạt động được phép liên quan đến ma túy"
      ]
    },
    {
      "name": "Giám định chất ma túy và tiền chất",
      "meaning": "Hoạt động xác định thành phần, hàm lượng của chất ma túy và tiền chất.",
      "attrs": [
        "Xác định thành phần, hàm lượng",
        "Liên quan đến chất ma túy và tiền chất"
      ],
      "keyphrases": [
        "giám định chất ma túy và tiền chất"
      ],
      "similar": [
        "Phân tích chất ma túy và tiền chất"
      ]
    },
    {
      "name": "Người sử dụng trái phép chất ma túy",
      "meaning": "Người sử dụng chất ma túy mà không được phép của pháp luật.",
      "attrs": [
        "Sử dụng chất ma túy",
        "Không được phép của pháp luật"
      ],
      "keyphrases": [
        "người sử dụng trái phép chất ma túy"
      ],
      "similar": [
        "Người dùng ma túy trái phép"
      ]
    },
    {
      "name": "Người nghiện ma túy",
      "meaning": "Người bị lệ thuộc vào chất ma túy về mặt thể chất và/hoặc tinh thần.",
      "attrs": [
        "Lệ thuộc vào chất ma túy"
      ],
      "keyphrases": [
        "người nghiện ma túy"
      ],
      "similar": [
        "Con nghiện"
      ]
    },
    {
      "name": "Người bị quản lý sau cai nghiện ma túy",
      "meaning": "Người đã hoàn thành quá trình cai nghiện ma túy và đang chịu sự quản lý của cơ quan nhà nước.",
      "attrs": [
        "Đã cai nghiện ma túy",
        "Đang bị quản lý"
      ],
      "keyphrases": [
        "người bị quản lý sau cai nghiện ma túy"
      ],
      "similar": [
        "Người sau cai nghiện"
      ]
    },
    {
      "name": "Thống kê nhà nước về phòng, chống ma túy",
      "meaning": "Hoạt động thu thập, xử lý, phân tích và công bố thông tin thống kê về tình hình phòng, chống ma túy trên phạm vi cả nước.",
      "attrs": [
        "Thu thập, xử lý, phân tích thông tin",
        "Về phòng, chống ma túy",
        "Trên phạm vi cả nước"
      ],
      "keyphrases": [
        "thống kê nhà nước về phòng, chống ma túy"
      ],
      "similar": [
        "Báo cáo thống kê về phòng, chống ma túy"
      ]
    }
  ]
},
{
  "article_id": "article_47",
  "article_number": "47",
  "text": "Điều 47. Trách nhiệm của Bộ Lao động - Thương binh và Xã hội\n1. Ban hành theo thẩm quyền hoặc trình cơ quan nhà nước có thẩm quyền ban hành văn bản quy phạm pháp luật về phòng, chống ma túy.\n2. Chủ trì, phối hợp với cơ quan, tổ chức có liên quan và chính quyền địa phương hướng dẫn việc tổ chức cai nghiện ma túy tự nguyện tại gia đình, cộng đồng, cai nghiện ma túy tại cơ sở cai nghiện ma túy và quản lý sau cai nghiện ma túy.\n3. Hướng dẫn việc thành lập, giải thể và tổ chức hoạt động của cơ sở cai nghiện ma túy công lập.\n4. Đào tạo, bồi dưỡng người làm công tác cai nghiện ma túy, quản lý sau cai nghiện ma túy.\n5. Hướng dẫn, chỉ đạo tổ chức thực hiện việc tuyên truyền, giáo dục về phòng, chống ma túy trong hệ thống cơ sở giáo dục nghề nghiệp.\n6. Thực hiện hợp tác quốc tế về cai nghiện ma túy.\n7. Thống kê người nghiện ma túy đang cai nghiện ma túy tự nguyện tại gia đình, cộng đồng, cai nghiện ma túy tại cơ sở cai nghiện ma túy.",
  "concepts": [
    {
      "name": "Ban hành văn bản quy phạm pháp luật về phòng, chống ma túy",
      "meaning": "Bộ Lao động - Thương binh và Xã hội có trách nhiệm ban hành hoặc trình cơ quan có thẩm quyền ban hành các văn bản pháp luật liên quan đến phòng, chống ma túy.",
      "attrs": [
        "thẩm quyền ban hành",
        "trình cơ quan nhà nước có thẩm quyền"
      ],
      "keyphrases": [
        "ban hành văn bản quy phạm pháp luật về phòng, chống ma túy",
        "cơ quan nhà nước có thẩm quyền"
      ],
      "similar": [
        "xây dựng pháp luật về phòng, chống ma túy"
      ]
    },
    {
      "name": "Hướng dẫn tổ chức cai nghiện ma túy",
      "meaning": "Bộ Lao động - Thương binh và Xã hội chịu trách nhiệm hướng dẫn việc tổ chức các hình thức cai nghiện ma túy khác nhau.",
      "attrs": [
        "cai nghiện tự nguyện tại gia đình",
        "cai nghiện tự nguyện tại cộng đồng",
        "cai nghiện tại cơ sở cai nghiện",
        "quản lý sau cai nghiện",
        "phối hợp với cơ quan, tổ chức liên quan",
        "phối hợp với chính quyền địa phương"
      ],
      "keyphrases": [
        "hướng dẫn việc tổ chức cai nghiện ma túy tự nguyện tại gia đình, cộng đồng",
        "cai nghiện ma túy tại cơ sở cai nghiện ma túy",
        "quản lý sau cai nghiện ma túy"
      ],
      "similar": [
        "chỉ đạo công tác cai nghiện ma túy"
      ]
    },
    {
      "name": "Hướng dẫn thành lập và hoạt động cơ sở cai nghiện công lập",
      "meaning": "Bộ Lao động - Thương binh và Xã hội có trách nhiệm hướng dẫn việc thành lập, giải thể và tổ chức hoạt động của các cơ sở cai nghiện ma túy thuộc sở hữu nhà nước.",
      "attrs": [
        "thành lập",
        "giải thể",
        "tổ chức hoạt động",
        "cơ sở cai nghiện ma túy công lập"
      ],
      "keyphrases": [
        "hướng dẫn việc thành lập, giải thể và tổ chức hoạt động của cơ sở cai nghiện ma túy công lập"
      ],
      "similar": [
        "quản lý cơ sở cai nghiện công lập"
      ]
    },
    {
      "name": "Đào tạo, bồi dưỡng người làm công tác cai nghiện",
      "meaning": "Bộ Lao động - Thương binh và Xã hội chịu trách nhiệm đào tạo và nâng cao trình độ chuyên môn cho những người làm việc trong lĩnh vực cai nghiện ma túy và quản lý sau cai.",
      "attrs": [
        "đào tạo",
        "bồi dưỡng",
        "người làm công tác cai nghiện ma túy",
        "người làm công tác quản lý sau cai nghiện ma túy"
      ],
      "keyphrases": [
        "đào tạo, bồi dưỡng người làm công tác cai nghiện ma túy, quản lý sau cai nghiện ma túy"
      ],
      "similar": [
        "nâng cao năng lực cho cán bộ cai nghiện"
      ]
    },
    {
      "name": "Tuyên truyền, giáo dục về phòng, chống ma túy trong cơ sở giáo dục nghề nghiệp",
      "meaning": "Bộ Lao động - Thương binh và Xã hội có trách nhiệm hướng dẫn và chỉ đạo việc thực hiện các hoạt động tuyên truyền, giáo dục về phòng, chống ma túy trong hệ thống các cơ sở giáo dục nghề nghiệp.",
      "attrs": [
        "tuyên truyền",
        "giáo dục",
        "phòng, chống ma túy",
        "cơ sở giáo dục nghề nghiệp"
      ],
      "keyphrases": [
        "tuyên truyền, giáo dục về phòng, chống ma túy trong hệ thống cơ sở giáo dục nghề nghiệp"
      ],
      "similar": [
        "nâng cao nhận thức về phòng, chống ma túy"
      ]
    },
    {
      "name": "Hợp tác quốc tế về cai nghiện ma túy",
      "meaning": "Bộ Lao động - Thương binh và Xã hội có trách nhiệm thực hiện các hoạt động hợp tác với các quốc gia và tổ chức quốc tế trong lĩnh vực cai nghiện ma túy.",
      "attrs": [
        "hợp tác quốc tế",
        "cai nghiện ma túy"
      ],
      "keyphrases": [
        "thực hiện hợp tác quốc tế về cai nghiện ma túy"
      ],
      "similar": [
        "mở rộng quan hệ quốc tế trong lĩnh vực cai nghiện"
      ]
    },
    {
      "name": "Thống kê người nghiện ma túy đang cai nghiện",
      "meaning": "Bộ Lao động - Thương binh và Xã hội có trách nhiệm thu thập và tổng hợp dữ liệu về số lượng người nghiện ma túy đang tham gia các hình thức cai nghiện khác nhau.",
      "attrs": [
        "thống kê",
        "người nghiện ma túy",
        "cai nghiện tự nguyện tại gia đình",
        "cai nghiện tự nguyện tại cộng đồng",
        "cai nghiện tại cơ sở cai nghiện"
      ],
      "keyphrases": [
        "thống kê người nghiện ma túy đang cai nghiện ma túy tự nguyện tại gia đình, cộng đồng, cai nghiện ma túy tại cơ sở cai nghiện ma túy"
      ],
      "similar": [
        "quản lý dữ liệu về người nghiện ma túy"
      ]
    }
  ]
},
{
  "article_id": "article_48",
  "article_number": "48",
  "text": "Điều 48. Trách nhiệm của Bộ Quốc phòng\n1. Ban hành theo thẩm quyền hoặc trình cơ quan nhà nước có thẩm quyền ban hành văn bản quy phạm pháp luật về phòng, chống ma túy.\n2. Tổ chức thực hiện kế hoạch phòng, chống ma túy ở khu vực biên giới trên đất liền, trên biển, vùng tiếp giáp lãnh hải, vùng đặc quyền kinh tế và thềm lục địa.\n3. Chỉ đạo lực lượng Bộ đội Biên phòng, Cảnh sát biển Việt Nam chủ trì, phối hợp với cơ quan, tổ chức có liên quan, lực lượng chức năng để tiếp nhận, xử lý thông tin tội phạm về ma túy, phát hiện, ngăn chặn, đấu tranh với các hành vi vi phạm pháp luật về ma túy, kiểm soát các hoạt động hợp pháp liên quan đến ma túy tại khu vực, địa bàn quy định tại khoản 2 Điều này theo quy định của Luật này và quy định khác của pháp luật có liên quan.\n4. Đào tạo, bồi dưỡng người làm công tác chuyên trách phòng, chống tội phạm về ma túy của Bộ đội Biên phòng và Cảnh sát biển Việt Nam.\n5. Thống kê người nghiện ma túy trong trại giam, trại tạm giam, nhà tạm giữ do Bộ Quốc phòng quản lý.",
  "concepts": [
    {
      "name": "Trách nhiệm của Bộ Quốc phòng",
      "meaning": "Các nghĩa vụ và quyền hạn của Bộ Quốc phòng trong công tác phòng, chống ma túy theo quy định của pháp luật.",
      "attrs": [
        "Ban hành văn bản quy phạm pháp luật",
        "Tổ chức thực hiện kế hoạch phòng, chống ma túy",
        "Chỉ đạo lực lượng chức năng",
        "Đào tạo, bồi dưỡng cán bộ",
        "Thống kê người nghiện ma túy"
      ],
      "keyphrases": [
        "Trách nhiệm của Bộ Quốc phòng",
        "Ban hành theo thẩm quyền",
        "Tổ chức thực hiện kế hoạch",
        "Chỉ đạo lực lượng",
        "Đào tạo, bồi dưỡng",
        "Thống kê người nghiện ma túy"
      ],
      "similar": [
        "Nghĩa vụ của Bộ Quốc phòng",
        "Quyền hạn của Bộ Quốc phòng"
      ]
    },
    {
      "name": "Văn bản quy phạm pháp luật về phòng, chống ma túy",
      "meaning": "Các văn bản do cơ quan nhà nước có thẩm quyền ban hành để điều chỉnh các hoạt động phòng, chống ma túy.",
      "attrs": [
        "Do cơ quan nhà nước có thẩm quyền ban hành",
        "Điều chỉnh hoạt động phòng, chống ma túy"
      ],
      "keyphrases": [
        "văn bản quy phạm pháp luật về phòng, chống ma túy",
        "ban hành theo thẩm quyền",
        "trình cơ quan nhà nước có thẩm quyền ban hành"
      ],
      "similar": [
        "Quy định pháp luật về phòng, chống ma túy",
        "Văn bản pháp luật về phòng, chống ma túy"
      ]
    },
    {
      "name": "Kế hoạch phòng, chống ma túy",
      "meaning": "Chương trình, biện pháp cụ thể được xây dựng và triển khai để phòng ngừa, ngăn chặn và đấu tranh với tội phạm ma túy.",
      "attrs": [
        "Được tổ chức thực hiện ở khu vực biên giới",
        "Được thực hiện trên đất liền, trên biển, vùng tiếp giáp lãnh hải, vùng đặc quyền kinh tế và thềm lục địa"
      ],
      "keyphrases": [
        "kế hoạch phòng, chống ma túy",
        "khu vực biên giới trên đất liền, trên biển, vùng tiếp giáp lãnh hải, vùng đặc quyền kinh tế và thềm lục địa"
      ],
      "similar": [
        "Chương trình phòng, chống ma túy",
        "Biện pháp phòng, chống ma túy"
      ]
    },
    {
      "name": "Lực lượng Bộ đội Biên phòng, Cảnh sát biển Việt Nam",
      "meaning": "Các lực lượng vũ trang thuộc Bộ Quốc phòng, có trách nhiệm chủ trì, phối hợp trong công tác phòng, chống ma túy.",
      "attrs": [
        "Chủ trì, phối hợp với cơ quan, tổ chức liên quan",
        "Tiếp nhận, xử lý thông tin tội phạm về ma túy",
        "Phát hiện, ngăn chặn, đấu tranh với hành vi vi phạm pháp luật về ma túy",
        "Kiểm soát các hoạt động hợp pháp liên quan đến ma túy"
      ],
      "keyphrases": [
        "lực lượng Bộ đội Biên phòng",
        "Cảnh sát biển Việt Nam",
        "chủ trì, phối hợp",
        "tiếp nhận, xử lý thông tin tội phạm về ma túy",
        "phát hiện, ngăn chặn, đấu tranh"
      ],
      "similar": [
        "Lực lượng chức năng phòng, chống ma túy",
        "Lực lượng vũ trang phòng, chống ma túy"
      ]
    },
    {
      "name": "Hoạt động hợp pháp liên quan đến ma túy",
      "meaning": "Các hoạt động được pháp luật cho phép liên quan đến ma túy, ví dụ như sử dụng trong y tế, nghiên cứu khoa học.",
      "attrs": [
        "Được pháp luật cho phép",
        "Liên quan đến ma túy"
      ],
      "keyphrases": [
        "hoạt động hợp pháp liên quan đến ma túy",
        "kiểm soát các hoạt động hợp pháp liên quan đến ma túy"
      ],
      "similar": [
        "Sử dụng ma túy hợp pháp",
        "Hoạt động được phép liên quan đến ma túy"
      ]
    },
    {
      "name": "Người nghiện ma túy trong trại giam, trại tạm giam, nhà tạm giữ",
      "meaning": "Những người bị giam giữ trong các cơ sở giam giữ do Bộ Quốc phòng quản lý và có dấu hiệu nghiện ma túy.",
      "attrs": [
        "Bị giam giữ",
        "Nghiện ma túy",
        "Do Bộ Quốc phòng quản lý"
      ],
      "keyphrases": [
        "người nghiện ma túy",
        "trại giam, trại tạm giam, nhà tạm giữ",
        "Bộ Quốc phòng quản lý",
        "thống kê người nghiện ma túy"
      ],
      "similar": [
        "Đối tượng nghiện ma túy bị giam giữ"
      ]
    }
  ]
},
{
  "article_id": "article_49",
  "article_number": "49",
  "text": "Điều 49. Trách nhiệm của Bộ Y tế\n1. Ban hành theo thẩm quyền hoặc trình cơ quan nhà nước có thẩm quyền ban hành văn bản quy phạm pháp luật về phòng, chống ma túy.\n2. Thực hiện việc nghiên cứu thuốc và phương pháp cai nghiện ma túy; cấp, thu hồi giấy phép lưu hành thuốc, phương pháp cai nghiện ma túy; hỗ trợ về người, chuyên môn kỹ thuật y tế để cai nghiện ma túy.\n3. Thống kê người đang tham gia điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế.",
  "concepts": [
    {
      "name": "Trách nhiệm của Bộ Y tế",
      "meaning": "Các nghĩa vụ và quyền hạn mà Bộ Y tế phải thực hiện trong lĩnh vực phòng, chống ma túy theo quy định của pháp luật.",
      "attrs": [
        "Ban hành văn bản quy phạm pháp luật",
        "Nghiên cứu thuốc và phương pháp cai nghiện",
        "Cấp, thu hồi giấy phép lưu hành thuốc, phương pháp cai nghiện",
        "Hỗ trợ về người, chuyên môn kỹ thuật y tế để cai nghiện",
        "Thống kê người điều trị nghiện bằng thuốc thay thế"
      ],
      "keyphrases": [
        "Trách nhiệm của Bộ Y tế"
      ],
      "similar": [
        "Nghĩa vụ của Bộ Y tế",
        "Quyền hạn của Bộ Y tế"
      ]
    },
    {
      "name": "Văn bản quy phạm pháp luật về phòng, chống ma túy",
      "meaning": "Các văn bản do cơ quan nhà nước có thẩm quyền ban hành, quy định về các vấn đề liên quan đến phòng ngừa, ngăn chặn và đấu tranh chống ma túy.",
      "attrs": [
        "Do Bộ Y tế ban hành hoặc trình ban hành",
        "Liên quan đến phòng, chống ma túy"
      ],
      "keyphrases": [
        "văn bản quy phạm pháp luật về phòng, chống ma túy"
      ],
      "similar": [
        "Quy định pháp luật về phòng, chống ma túy",
        "Văn bản pháp luật về phòng, chống ma túy"
      ]
    },
    {
      "name": "Nghiên cứu thuốc và phương pháp cai nghiện ma túy",
      "meaning": "Hoạt động nghiên cứu khoa học nhằm tìm ra các loại thuốc và phương pháp điều trị hiệu quả cho người nghiện ma túy.",
      "attrs": [
        "Do Bộ Y tế thực hiện",
        "Mục đích: tìm ra thuốc và phương pháp cai nghiện"
      ],
      "keyphrases": [
        "nghiên cứu thuốc và phương pháp cai nghiện ma túy"
      ],
      "similar": [
        "Nghiên cứu khoa học về cai nghiện ma túy",
        "Phát triển thuốc và phương pháp cai nghiện"
      ]
    },
    {
      "name": "Giấy phép lưu hành thuốc, phương pháp cai nghiện ma túy",
      "meaning": "Văn bản cho phép một loại thuốc hoặc phương pháp cai nghiện ma túy được phép sử dụng và lưu hành hợp pháp.",
      "attrs": [
        "Do Bộ Y tế cấp hoặc thu hồi",
        "Cho phép lưu hành thuốc và phương pháp cai nghiện"
      ],
      "keyphrases": [
        "giấy phép lưu hành thuốc, phương pháp cai nghiện ma túy"
      ],
      "similar": [
        "Giấy phép sử dụng thuốc cai nghiện",
        "Giấy phép lưu hành phương pháp điều trị nghiện"
      ]
    },
    {
      "name": "Hỗ trợ về người, chuyên môn kỹ thuật y tế để cai nghiện ma túy",
      "meaning": "Việc cung cấp nhân lực, kiến thức chuyên môn và kỹ thuật y tế để hỗ trợ quá trình cai nghiện ma túy.",
      "attrs": [
        "Do Bộ Y tế thực hiện",
        "Bao gồm hỗ trợ về nhân lực và chuyên môn"
      ],
      "keyphrases": [
        "hỗ trợ về người, chuyên môn kỹ thuật y tế để cai nghiện ma túy"
      ],
      "similar": [
        "Cung cấp nhân lực và chuyên môn y tế cho cai nghiện",
        "Viện trợ y tế cho cai nghiện"
      ]
    },
    {
      "name": "Điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế",
      "meaning": "Phương pháp điều trị nghiện bằng cách sử dụng các loại thuốc có tác dụng tương tự như chất gây nghiện nhưng ít gây hại hơn, nhằm giảm dần sự phụ thuộc vào chất gây nghiện.",
      "attrs": [
        "Sử dụng thuốc thay thế",
        "Điều trị nghiện các chất dạng thuốc phiện"
      ],
      "keyphrases": [
        "điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế"
      ],
      "similar": [
        "Điều trị thay thế nghiện chất dạng thuốc phiện",
        "Sử dụng thuốc thay thế trong điều trị nghiện"
      ]
    },
    {
      "name": "Thống kê người đang tham gia điều trị nghiện",
      "meaning": "Việc thu thập, tổng hợp và phân tích dữ liệu về số lượng người đang tham gia các chương trình điều trị nghiện các chất dạng thuốc phiện bằng thuốc thay thế.",
      "attrs": [
        "Do Bộ Y tế thực hiện",
        "Đối tượng: người điều trị nghiện bằng thuốc thay thế"
      ],
      "keyphrases": [
        "thống kê người đang tham gia điều trị nghiện"
      ],
      "similar": [
        "Báo cáo số liệu người điều trị nghiện",
        "Theo dõi số lượng người cai nghiện"
      ]
    }
  ]
},
{
  "article_id": "article_50",
  "article_number": "50",
  "text": "Điều 50. Trách nhiệm của Bộ Tài chính\nChỉ đạo cơ quan Hải quan thực hiện hoạt động phòng, chống ma túy theo quy định của Luật này và quy định khác của pháp luật có liên quan.\nChương VII\nHỢP TÁC QUỐC TẾ VỀ PHÒNG, CHỐNG MA TÚY",
  "concepts": [
    {
      "name": "Bộ Tài chính",
      "meaning": "Cơ quan nhà nước có trách nhiệm chỉ đạo cơ quan Hải quan thực hiện hoạt động phòng, chống ma túy.",
      "attrs": [
        "Cơ quan nhà nước",
        "Có thẩm quyền chỉ đạo"
      ],
      "keyphrases": [
        "Bộ Tài chính"
      ],
      "similar": []
    },
    {
      "name": "Cơ quan Hải quan",
      "meaning": "Cơ quan có trách nhiệm thực hiện hoạt động phòng, chống ma túy dưới sự chỉ đạo của Bộ Tài chính.",
      "attrs": [
        "Cơ quan nhà nước",
        "Chịu sự chỉ đạo của Bộ Tài chính",
        "Thực hiện phòng, chống ma túy"
      ],
      "keyphrases": [
        "cơ quan Hải quan"
      ],
      "similar": []
    },
    {
      "name": "Hoạt động phòng, chống ma túy",
      "meaning": "Các hoạt động nhằm ngăn chặn, phát hiện, điều tra, xử lý các hành vi liên quan đến ma túy.",
      "attrs": [
        "Ngăn chặn",
        "Phát hiện",
        "Điều tra",
        "Xử lý",
        "Liên quan đến ma túy"
      ],
      "keyphrases": [
        "hoạt động phòng, chống ma túy"
      ],
      "similar": [
        "phòng, chống ma túy"
      ]
    },
    {
      "name": "Luật này",
      "meaning": "Luật đang được đề cập đến trong văn bản, quy định về phòng, chống ma túy.",
      "attrs": [
        "Văn bản luật",
        "Quy định về phòng, chống ma túy"
      ],
      "keyphrases": [
        "Luật này"
      ],
      "similar": []
    },
    {
      "name": "Pháp luật có liên quan",
      "meaning": "Các văn bản pháp luật khác ngoài Luật này, có liên quan đến hoạt động phòng, chống ma túy.",
      "attrs": [
        "Văn bản pháp luật",
        "Liên quan đến phòng, chống ma túy"
      ],
      "keyphrases": [
        "quy định khác của pháp luật có liên quan"
      ],
      "similar": []
    },
    {
      "name": "Hợp tác quốc tế về phòng, chống ma túy",
      "meaning": "Sự phối hợp và hợp tác giữa các quốc gia trong việc phòng ngừa, ngăn chặn và đấu tranh chống lại các hoạt động liên quan đến ma túy.",
      "attrs": [
        "Phối hợp",
        "Hợp tác",
        "Giữa các quốc gia",
        "Phòng ngừa",
        "Ngăn chặn",
        "Đấu tranh",
        "Liên quan đến ma túy"
      ],
      "keyphrases": [
        "HỢP TÁC QUỐC TẾ VỀ PHÒNG, CHỐNG MA TÚY"
      ],
      "similar": []
    }
  ]
},
{
  "article_id": "article_51",
  "article_number": "51",
  "text": "Điều 51. Nguyên tắc trong hợp tác quốc tế về phòng, chống ma túy\n1. Nhà nước Việt Nam thực hiện điều ước quốc tế về phòng, chống ma túy và điều ước quốc tế khác có liên quan mà nước Cộng hòa xã hội chủ nghĩa Việt Nam là thành viên trên nguyên tắc tôn trọng độc lập, chủ quyền, toàn vẹn lãnh thổ và các bên cùng có lợi; hợp tác với các nước, tổ chức quốc tế, tổ chức, cá nhân nước ngoài trong hoạt động phòng, chống ma túy.\n2. Trên cơ sở điều ước quốc tế mà nước Cộng hòa xã hội chủ nghĩa Việt Nam là thành viên, quy định của Luật này và quy định khác của pháp luật có liên quan, thỏa thuận quốc tế đã ký kết, cơ quan có thẩm quyền của Việt Nam thực hiện chương trình hợp tác về phòng, chống ma túy với cơ quan có liên quan của các nước, tổ chức quốc tế, tổ chức, cá nhân nước ngoài.",
  "concepts": [
    {
      "name": "Hợp tác quốc tế về phòng, chống ma túy",
      "meaning": "Sự phối hợp và tương trợ giữa Việt Nam và các quốc gia, tổ chức quốc tế, tổ chức, cá nhân nước ngoài trong việc ngăn chặn và đấu tranh chống lại tệ nạn ma túy.",
      "attrs": [
        "Nguyên tắc tôn trọng độc lập, chủ quyền, toàn vẹn lãnh thổ",
        "Nguyên tắc các bên cùng có lợi",
        "Thực hiện điều ước quốc tế",
        "Thực hiện thỏa thuận quốc tế",
        "Tuân thủ pháp luật Việt Nam"
      ],
      "keyphrases": [
        "hợp tác quốc tế về phòng, chống ma túy",
        "hợp tác với các nước, tổ chức quốc tế, tổ chức, cá nhân nước ngoài trong hoạt động phòng, chống ma túy",
        "chương trình hợp tác về phòng, chống ma túy"
      ],
      "similar": [
        "hợp tác quốc tế trong lĩnh vực phòng, chống ma túy",
        "hợp tác song phương và đa phương về phòng, chống ma túy"
      ]
    },
    {
      "name": "Điều ước quốc tế về phòng, chống ma túy",
      "meaning": "Các thỏa thuận pháp lý ràng buộc giữa các quốc gia hoặc tổ chức quốc tế liên quan đến việc phòng ngừa và chống lại ma túy.",
      "attrs": [
        "Ràng buộc pháp lý",
        "Liên quan đến phòng, chống ma túy",
        "Nước Cộng hòa xã hội chủ nghĩa Việt Nam là thành viên"
      ],
      "keyphrases": [
        "điều ước quốc tế về phòng, chống ma túy",
        "điều ước quốc tế khác có liên quan"
      ],
      "similar": [
        "Hiệp ước quốc tế về phòng, chống ma túy",
        "Công ước quốc tế về phòng, chống ma túy"
      ]
    },
    {
      "name": "Thỏa thuận quốc tế",
      "meaning": "Các thỏa thuận giữa Việt Nam và các đối tác quốc tế về hợp tác phòng, chống ma túy, được ký kết trên cơ sở điều ước quốc tế và pháp luật Việt Nam.",
      "attrs": [
        "Cơ sở là điều ước quốc tế",
        "Cơ sở là pháp luật Việt Nam",
        "Được ký kết bởi cơ quan có thẩm quyền của Việt Nam",
        "Liên quan đến chương trình hợp tác"
      ],
      "keyphrases": [
        "thỏa thuận quốc tế đã ký kết",
        "chương trình hợp tác"
      ],
      "similar": [
        "Hiệp định quốc tế",
        "Bản ghi nhớ hợp tác"
      ]
    },
    {
      "name": "Nguyên tắc tôn trọng độc lập, chủ quyền, toàn vẹn lãnh thổ",
      "meaning": "Một trong những nguyên tắc cơ bản trong hợp tác quốc tế, yêu cầu các quốc gia tôn trọng quyền tự quyết và sự toàn vẹn lãnh thổ của nhau.",
      "attrs": [
        "Nguyên tắc cơ bản của luật quốc tế",
        "Áp dụng trong hợp tác quốc tế",
        "Tôn trọng quyền tự quyết",
        "Tôn trọng sự toàn vẹn lãnh thổ"
      ],
      "keyphrases": [
        "tôn trọng độc lập, chủ quyền, toàn vẹn lãnh thổ"
      ],
      "similar": [
        "Nguyên tắc chủ quyền quốc gia",
        "Nguyên tắc bất khả xâm phạm lãnh thổ"
      ]
    },
    {
      "name": "Nguyên tắc các bên cùng có lợi",
      "meaning": "Nguyên tắc hợp tác dựa trên sự công bằng và lợi ích chung của tất cả các bên tham gia.",
      "attrs": [
        "Nguyên tắc hợp tác",
        "Đảm bảo lợi ích chung",
        "Công bằng"
      ],
      "keyphrases": [
        "các bên cùng có lợi"
      ],
      "similar": [
        "Nguyên tắc đôi bên cùng có lợi",
        "Nguyên tắc win-win"
      ]
    }
  ]
},
{
  "article_id": "article_52",
  "article_number": "52",
  "text": "Điều 52. Chính sách hợp tác quốc tế về phòng, chống ma túy\nNhà nước Việt Nam thực hiện chính sách hợp tác quốc tế đa phương và song phương trong lĩnh vực phòng, chống ma túy trên nguyên tắc tôn trọng độc lập, chủ quyền quốc gia với các nước; khuyến khích tổ chức quốc tế, tổ chức, cá nhân nước ngoài hợp tác với cơ quan, tổ chức của Việt Nam hỗ trợ lẫn nhau về cơ sở vật chất, tăng cường năng lực pháp luật, thông tin, công nghệ đào tạo và y tế cho hoạt động phòng, chống ma túy.",
  "concepts": [
    {
      "name": "Hợp tác quốc tế về phòng, chống ma túy",
      "meaning": "Sự phối hợp giữa Việt Nam và các quốc gia, tổ chức quốc tế trong lĩnh vực phòng ngừa và đấu tranh chống ma túy.",
      "attrs": [
        "Đa phương",
        "Song phương",
        "Nguyên tắc tôn trọng độc lập, chủ quyền quốc gia",
        "Hỗ trợ lẫn nhau về cơ sở vật chất, tăng cường năng lực pháp luật, thông tin, công nghệ đào tạo và y tế"
      ],
      "keyphrases": [
        "hợp tác quốc tế",
        "phòng, chống ma túy",
        "đa phương",
        "song phương"
      ],
      "similar": [
        "hợp tác quốc tế trong lĩnh vực phòng, chống ma túy"
      ]
    },
    {
      "name": "Nguyên tắc tôn trọng độc lập, chủ quyền quốc gia",
      "meaning": "Một trong những nguyên tắc cơ bản trong hợp tác quốc tế, yêu cầu các quốc gia tôn trọng quyền tự quyết và toàn vẹn lãnh thổ của nhau.",
      "attrs": [
        "Tôn trọng độc lập",
        "Tôn trọng chủ quyền quốc gia"
      ],
      "keyphrases": [
        "tôn trọng độc lập",
        "chủ quyền quốc gia"
      ],
      "similar": [
        "tôn trọng chủ quyền và toàn vẹn lãnh thổ"
      ]
    },
    {
      "name": "Hỗ trợ lẫn nhau",
      "meaning": "Sự giúp đỡ, chia sẻ nguồn lực và kinh nghiệm giữa các bên tham gia hợp tác quốc tế.",
      "attrs": [
        "Cơ sở vật chất",
        "Năng lực pháp luật",
        "Thông tin",
        "Công nghệ đào tạo",
        "Y tế"
      ],
      "keyphrases": [
        "hỗ trợ lẫn nhau",
        "cơ sở vật chất",
        "năng lực pháp luật",
        "thông tin",
        "công nghệ đào tạo",
        "y tế"
      ],
      "similar": [
        "giúp đỡ",
        "chia sẻ nguồn lực"
      ]
    }
  ]
},
{
  "article_id": "article_53",
  "article_number": "53",
  "text": "Điều 53. Chuyển giao hàng hóa có kiểm soát\nNhà nước Việt Nam thực hiện yêu cầu chuyển giao hàng hóa có kiểm soát trên cơ sở điều ước quốc tế mà nước Cộng hòa xã hội chủ nghĩa Việt Nam là thành viên để phát hiện và truy cứu trách nhiệm hình sự đối với người phạm tội về ma túy. Việc quyết định áp dụng và tiến hành biện pháp này thực hiện theo thỏa thuận giữa cơ quan có thẩm quyền của Việt Nam và của nước có liên quan.\nChương VIII\nĐIỀU KHOẢN THI HÀNH",
  "concepts": [
    {
      "name": "Chuyển giao hàng hóa có kiểm soát",
      "meaning": "Một biện pháp nghiệp vụ được thực hiện để phát hiện và truy cứu trách nhiệm hình sự đối với tội phạm ma túy, dựa trên cơ sở điều ước quốc tế.",
      "attrs": [
        "Mục đích: Phát hiện và truy cứu trách nhiệm hình sự đối với người phạm tội về ma túy",
        "Cơ sở pháp lý: Điều ước quốc tế mà Việt Nam là thành viên",
        "Thực hiện: Theo thỏa thuận giữa cơ quan có thẩm quyền của Việt Nam và nước có liên quan"
      ],
      "keyphrases": [
        "chuyển giao hàng hóa có kiểm soát"
      ],
      "similar": []
    },
    {
      "name": "Điều ước quốc tế",
      "meaning": "Thỏa thuận bằng văn bản được ký kết giữa các quốc gia và được luật pháp quốc tế điều chỉnh.",
      "attrs": [
        "Cơ sở pháp lý cho chuyển giao hàng hóa có kiểm soát",
        "Việt Nam là thành viên"
      ],
      "keyphrases": [
        "điều ước quốc tế",
        "nước Cộng hòa xã hội chủ nghĩa Việt Nam là thành viên"
      ],
      "similar": [
        "Hiệp ước quốc tế",
        "Công ước quốc tế"
      ]
    },
    {
      "name": "Truy cứu trách nhiệm hình sự",
      "meaning": "Quá trình điều tra, truy tố, xét xử và thi hành án đối với người phạm tội.",
      "attrs": [
        "Mục tiêu của chuyển giao hàng hóa có kiểm soát",
        "Đối tượng: Người phạm tội về ma túy"
      ],
      "keyphrases": [
        "truy cứu trách nhiệm hình sự",
        "người phạm tội về ma túy"
      ],
      "similar": [
        "Khởi tố hình sự",
        "Xử lý hình sự"
      ]
    },
    {
      "name": "Cơ quan có thẩm quyền",
      "meaning": "Cơ quan nhà nước được trao quyền thực hiện các hành vi pháp lý nhất định.",
      "attrs": [
        "Thực hiện thỏa thuận chuyển giao hàng hóa có kiểm soát",
        "Của Việt Nam và của nước có liên quan"
      ],
      "keyphrases": [
        "cơ quan có thẩm quyền",
        "của Việt Nam",
        "của nước có liên quan"
      ],
      "similar": [
        "Cơ quan nhà nước có thẩm quyền"
      ]
    }
  ]
},
{
  "article_id": "article_54",
  "article_number": "54",
  "text": "Điều 54. Hiệu lực thi hành\n1. Luật này có hiệu lực thi hành từ ngày 01 tháng 01 năm 2022.\n2. Luật Phòng, chống ma túy số 23/2000/QH10 đã được sửa đổi, bổ sung một số điều theo Luật số 16/2008/QH12 hết hiệu lực kể từ ngày Luật này có hiệu lực thi hành.",
  "concepts": [
    {
      "name": "Hiệu lực thi hành",
      "meaning": "Thời điểm mà một văn bản luật bắt đầu có giá trị pháp lý và được áp dụng.",
      "attrs": [
        "Thời điểm bắt đầu",
        "Phạm vi áp dụng"
      ],
      "keyphrases": [
        "hiệu lực thi hành",
        "có hiệu lực thi hành"
      ],
      "similar": [
        "thời điểm có hiệu lực",
        "ngày có hiệu lực"
      ]
    },
    {
      "name": "Luật",
      "meaning": "Văn bản quy phạm pháp luật do Quốc hội ban hành, có hiệu lực pháp lý cao nhất, quy định các vấn đề cơ bản của đời sống xã hội.",
      "attrs": [
        "Do Quốc hội ban hành",
        "Tính quy phạm",
        "Tính bắt buộc"
      ],
      "keyphrases": [
        "Luật này",
        "Luật Phòng, chống ma túy"
      ],
      "similar": [
        "văn bản luật",
        "quy định pháp luật"
      ]
    },
    {
      "name": "Hết hiệu lực",
      "meaning": "Trạng thái một văn bản luật không còn giá trị pháp lý và không còn được áp dụng.",
      "attrs": [
        "Thời điểm chấm dứt hiệu lực",
        "Lý do chấm dứt hiệu lực"
      ],
      "keyphrases": [
        "hết hiệu lực"
      ],
      "similar": [
        "mất hiệu lực",
        "không còn hiệu lực"
      ]
    },
    {
      "name": "Luật Phòng, chống ma túy",
      "meaning": "Luật quy định về phòng ngừa, ngăn chặn, kiểm soát, đấu tranh chống tệ nạn ma túy, kiểm soát các hoạt động hợp pháp liên quan đến ma túy, quản lý người sử dụng trái phép chất ma túy, người nghiện ma túy và trách nhiệm của cá nhân, gia đình, cơ quan, tổ chức trong phòng, chống ma túy.",
      "attrs": [
        "Số hiệu: 23/2000/QH10",
        "Đã được sửa đổi, bổ sung"
      ],
      "keyphrases": [
        "Luật Phòng, chống ma túy số 23/2000/QH10",
        "Luật số 16/2008/QH12"
      ],
      "similar": []
    },
    {
      "name": "Sửa đổi, bổ sung",
      "meaning": "Việc thay đổi, thêm bớt nội dung của một văn bản luật hiện hành.",
      "attrs": [
        "Mục đích: Hoàn thiện văn bản",
        "Cơ quan có thẩm quyền: Quốc hội"
      ],
      "keyphrases": [
        "sửa đổi, bổ sung"
      ],
      "similar": [
        "điều chỉnh",
        "bổ sung"
      ]
    }
  ]
},
{
  "article_id": "article_55",
  "article_number": "55",
  "text": "Điều 55. Quy định chuyển tiếp\n1. Kể từ ngày Luật này có hiệu lực thi hành:\na) Người đang thực hiện cai nghiện ma túy tự nguyện tại gia đình, cộng đồng hoặc tại cơ sở cai nghiện thì tiếp tục thực hiện cai nghiện ma túy tự nguyện đến hết thời hạn đã đăng ký theo quy định của Luật Phòng, chống ma túy số 23/2000/QH10 đã được sửa đổi, bổ sung một số điều theo Luật số 16/2008/QH12 và bị quản lý sau cai nghiện ma túy theo quy định của Luật này;\nb) Người đang bị quản lý sau cai nghiện ma túy thì tiếp tục chấp hành quyết định quản lý sau cai nghiện ma túy đến hết thời hạn quản lý sau cai nghiện theo quy định của Luật Phòng, chống ma túy số 23/2000/QH10 đã được sửa đổi, bổ sung một số điều theo Luật số 16/2008/QH12. Trường hợp người đang trong thời gian quản lý sau cai nghiện ma túy đủ 18 tuổi kể từ ngày Luật này có hiệu lực thi hành mà tái nghiện thì áp dụng biện pháp xử lý hành chính đưa vào cơ sở cai nghiện bắt buộc;\nc) Người đang chấp hành quyết định cai nghiện ma túy bắt buộc tại cộng đồng theo quy định của Luật Phòng, chống ma túy số 23/2000/QH10 đã được sửa đổi, bổ sung một số điều theo Luật số 16/2008/QH12 thì được đăng ký cai nghiện tự nguyện theo quy định của Luật này. Thời gian đã chấp hành quyết định cai nghiện ma túy bắt buộc tại cộng đồng được tính vào thời hạn cai nghiện ma túy tự nguyện;\nd) Người thuộc trường hợp phải đưa vào cơ sở cai nghiện bắt buộc theo quy định của Luật Phòng, chống ma túy số 23/2000/QH10 đã được sửa đổi, bổ sung một số điều theo Luật số 16/2008/QH12 đang trong quá trình lập hồ sơ đưa vào cơ sở cai nghiện bắt buộc thì thực hiện việc cai nghiện ma túy theo quy định của Luật này;\nđ) Giấy phép liên quan đến hoạt động hợp pháp liên quan đến ma túy đã được cấp tiếp tục được sử dụng đến hết thời hạn ghi trên giấy phép.\n2. Trong thời hạn 02 năm kể từ ngày Luật này có hiệu lực thi hành, cơ sở cai nghiện ma túy bắt buộc được thành lập theo quy định của Luật Phòng, chống ma túy số 23/2000/QH10 đã được sửa đổi, bổ sung một số điều theo Luật số 16/2008/QH12 phải đáp ứng đủ điều kiện của cơ sở cai nghiện ma túy công lập theo quy định của Luật này.\nCác cơ sở khác về cai nghiện ma túy theo quy định của Luật Phòng, chống ma túy số 23/2000/QH10 đã được sửa đổi, bổ sung một số điều theo Luật số 16/2008/QH12 đã được cấp giấy phép hoạt động trước ngày Luật này có hiệu lực thi hành được tiếp tục hoạt động cho đến khi hết thời hạn của giấy phép.\nLuật này được Quốc hội nước Cộng hòa xã hội chủ nghĩa Việt Nam khóa XIV, kỳ họp thứ 11 thông qua ngày 30 tháng 3 năm 2021.\nCHỦ TỊCH QUỐC HỘI\nNguyễn Thị Kim Ngân",
  "concepts": [
    {
      "name": "Cai nghiện ma túy tự nguyện",
      "meaning": "Việc người nghiện ma túy tự nguyện tham gia các chương trình cai nghiện tại gia đình, cộng đồng hoặc cơ sở cai nghiện.",
      "attrs": [
        "tự nguyện",
        "tại gia đình",
        "tại cộng đồng",
        "tại cơ sở cai nghiện",
        "thời hạn đã đăng ký"
      ],
      "keyphrases": [
        "cai nghiện ma túy tự nguyện",
        "thực hiện cai nghiện ma túy tự nguyện",
        "đăng ký cai nghiện tự nguyện"
      ],
      "similar": [
        "cai nghiện tự nguyện"
      ]
    },
    {
      "name": "Quản lý sau cai nghiện ma túy",
      "meaning": "Biện pháp quản lý đối với người đã hoàn thành quá trình cai nghiện ma túy nhằm giúp họ ổn định cuộc sống và phòng ngừa tái nghiện.",
      "attrs": [
        "thời hạn quản lý",
        "tái nghiện",
        "đủ 18 tuổi"
      ],
      "keyphrases": [
        "quản lý sau cai nghiện ma túy",
        "bị quản lý sau cai nghiện ma túy",
        "thời gian quản lý sau cai nghiện"
      ],
      "similar": [
        "quản lý sau cai"
      ]
    },
    {
      "name": "Cai nghiện ma túy bắt buộc tại cộng đồng",
      "meaning": "Hình thức cai nghiện ma túy do cơ quan nhà nước có thẩm quyền quyết định, được thực hiện tại cộng đồng.",
      "attrs": [
        "quyết định",
        "tại cộng đồng",
        "thời gian chấp hành",
        "đăng ký cai nghiện tự nguyện"
      ],
      "keyphrases": [
        "cai nghiện ma túy bắt buộc tại cộng đồng",
        "chấp hành quyết định cai nghiện ma túy bắt buộc tại cộng đồng"
      ],
      "similar": [
        "cai nghiện bắt buộc tại cộng đồng"
      ]
    },
    {
      "name": "Cơ sở cai nghiện bắt buộc",
      "meaning": "Cơ sở do Nhà nước thành lập để thực hiện việc cai nghiện ma túy bắt buộc đối với người nghiện ma túy.",
      "attrs": [
        "lập hồ sơ",
        "cơ sở cai nghiện",
        "công lập",
        "điều kiện"
      ],
      "keyphrases": [
        "cơ sở cai nghiện bắt buộc",
        "đưa vào cơ sở cai nghiện bắt buộc",
        "cơ sở cai nghiện ma túy công lập"
      ],
      "similar": [
        "trung tâm cai nghiện bắt buộc"
      ]
    },
    {
      "name": "Hoạt động hợp pháp liên quan đến ma túy",
      "meaning": "Các hoạt động được pháp luật cho phép liên quan đến ma túy, ví dụ như sản xuất thuốc có chứa chất ma túy.",
      "attrs": [
        "giấy phép",
        "thời hạn"
      ],
      "keyphrases": [
        "hoạt động hợp pháp liên quan đến ma túy",
        "giấy phép liên quan đến hoạt động hợp pháp liên quan đến ma túy"
      ],
      "similar": [
        "kinh doanh dược phẩm chứa chất ma túy"
      ]
    },
    {
      "name": "Hiệu lực thi hành của Luật",
      "meaning": "Thời điểm mà Luật bắt đầu có giá trị pháp lý và được áp dụng.",
      "attrs": [
        "ngày có hiệu lực",
        "thời hạn chuyển tiếp"
      ],
      "keyphrases": [
        "hiệu lực thi hành",
        "kể từ ngày Luật này có hiệu lực thi hành"
      ],
      "similar": [
        "thời điểm luật có hiệu lực"
      ]
    },
    {
      "name": "Biện pháp xử lý hành chính",
      "meaning": "Các biện pháp do cơ quan nhà nước có thẩm quyền áp dụng đối với cá nhân, tổ chức vi phạm hành chính.",
      "attrs": [
        "tái nghiện",
        "đưa vào cơ sở cai nghiện bắt buộc"
      ],
      "keyphrases": [
        "biện pháp xử lý hành chính"
      ],
      "similar": [
        "xử phạt hành chính"
      ]
    }
  ]
}
]
